[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:10:26
 
 import { checkPhaseAScope } from './pl-scope-guard.mjs';
 
-function sha256(content) {
-  return createHash('sha256').update(content).digest('hex');
-}
+function sha256(content) {}
 
 /**
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: rollback aborted, target diverged from activation state: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-XaCC3G/a.txt

[Killed] StringLiteral
src/scripts/pl-dogfood-activate.mjs:11:21
 import { checkPhaseAScope } from './pl-scope-guard.mjs';
 
 function sha256(content) {
-  return createHash('sha256').update(content).digest('hex');
+  return createHash("").update(content).digest('hex');
 }
 
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: Digest method not supported

[Killed] StringLiteral
src/scripts/pl-dogfood-activate.mjs:11:54
 import { checkPhaseAScope } from './pl-scope-guard.mjs';
 
 function sha256(content) {
-  return createHash('sha256').update(content).digest('hex');
+  return createHash('sha256').update(content).digest("");
 }
 
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: rollback aborted, target diverged from activation state: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-rYGYds/a.txt

[Killed] ArrowFunction
src/scripts/pl-dogfood-activate.mjs:20:62
  * @param {(path: string) => string} [readFile]
  * @param {(path: string) => boolean} [fileExists]
  */
-export function activate(targetList, snapshotDir, readFile = (p) => readFileSync(p, 'utf8'), fileExists = existsSync) {
+export function activate(targetList, snapshotDir, readFile = () => undefined, fileExists = existsSync) {
   const { targets, allowedPaths = [] } = targetList;
 
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] ArrowFunction
src/scripts/pl-dogfood-activate.mjs:23:51
 export function activate(targetList, snapshotDir, readFile = (p) => readFileSync(p, 'utf8'), fileExists = existsSync) {
   const { targets, allowedPaths = [] } = targetList;
 
-  const violations = checkPhaseAScope(targets.map((t) => t.path), allowedPaths);
+  const violations = checkPhaseAScope(targets.map(() => undefined), allowedPaths);
   if (violations.length) {
     throw new Error(`target path(s) outside declared allowlist: ${violations.join(', ')}`);
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: target path(s) outside declared allowlist: undefined, undefined, undefined, undefined

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:24:7
   const { targets, allowedPaths = [] } = targetList;
 
   const violations = checkPhaseAScope(targets.map((t) => t.path), allowedPaths);
-  if (violations.length) {
+  if (false) {
     throw new Error(`target path(s) outside declared allowlist: ${violations.join(', ')}`);
   }
killedBy: activate aborts with zero writes when a target path is outside the declared allowlist
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:24:7
   const { targets, allowedPaths = [] } = targetList;
 
   const violations = checkPhaseAScope(targets.map((t) => t.path), allowedPaths);
-  if (violations.length) {
+  if (true) {
     throw new Error(`target path(s) outside declared allowlist: ${violations.join(', ')}`);
   }
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: target path(s) outside declared allowlist:

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:29:51
   }
 
   // Snapshot phase: fully completes before any apply-phase write begins.
-  const snapshotEntries = targets.map((target) => {
-    const existedBefore = fileExists(target.path);
-    if (!existedBefore) {
-      return { path: target.path, existed_before: false, snapshot_path: null };
-    }
-    const snapshotPath = join(snapshotDir, target.path);
-    const content = readFile(target.path);
-    mkdirSync(dirname(snapshotPath), { recursive: true });
-    writeFileSync(snapshotPath, content);
-    return { path: target.path, existed_before: true, snapshot_path: snapshotPath };
-  });
+  const snapshotEntries = targets.map((target) => {});
 
   // Apply phase: write tmp -> rename, per target, only after every snapshot succeeded.
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: Cannot read properties of undefined (reading 'existed_before')

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:31:9
   // Snapshot phase: fully completes before any apply-phase write begins.
   const snapshotEntries = targets.map((target) => {
     const existedBefore = fileExists(target.path);
-    if (!existedBefore) {
+    if (false) {
       return { path: target.path, existed_before: false, snapshot_path: null };
     }
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: ENOENT: no such file or directory, open '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-qlHj0v/b.txt'

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:31:25
   // Snapshot phase: fully completes before any apply-phase write begins.
   const snapshotEntries = targets.map((target) => {
     const existedBefore = fileExists(target.path);
-    if (!existedBefore) {
-      return { path: target.path, existed_before: false, snapshot_path: null };
-    }
+    if (!existedBefore) {}
     const snapshotPath = join(snapshotDir, target.path);
     const content = readFile(target.path);
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: ENOENT: no such file or directory, open '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-activate-tWwQXW/d.txt'

[Killed] BooleanLiteral
src/scripts/pl-dogfood-activate.mjs:32:51
   const snapshotEntries = targets.map((target) => {
     const existedBefore = fileExists(target.path);
     if (!existedBefore) {
-      return { path: target.path, existed_before: false, snapshot_path: null };
+      return { path: target.path, existed_before: true, snapshot_path: null };
     }
     const snapshotPath = join(snapshotDir, target.path);
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: The "path" argument must be of type string or an instance of Buffer or URL. Received null

[Killed] BooleanLiteral
src/scripts/pl-dogfood-activate.mjs:36:51
     }
     const snapshotPath = join(snapshotDir, target.path);
     const content = readFile(target.path);
-    mkdirSync(dirname(snapshotPath), { recursive: true });
+    mkdirSync(dirname(snapshotPath), { recursive: false });
     writeFileSync(snapshotPath, content);
     return { path: target.path, existed_before: true, snapshot_path: snapshotPath };
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: ENOENT: no such file or directory, mkdir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-zqB9Qd/snapshot/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-zqB9Qd'

[Killed] ObjectLiteral
src/scripts/pl-dogfood-activate.mjs:36:38
     }
     const snapshotPath = join(snapshotDir, target.path);
     const content = readFile(target.path);
-    mkdirSync(dirname(snapshotPath), { recursive: true });
+    mkdirSync(dirname(snapshotPath), {});
     writeFileSync(snapshotPath, content);
     return { path: target.path, existed_before: true, snapshot_path: snapshotPath };
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: ENOENT: no such file or directory, mkdir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-xOdgPx/snapshot/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-xOdgPx'

[Killed] BooleanLiteral
src/scripts/pl-dogfood-activate.mjs:38:49
     const content = readFile(target.path);
     mkdirSync(dirname(snapshotPath), { recursive: true });
     writeFileSync(snapshotPath, content);
-    return { path: target.path, existed_before: true, snapshot_path: snapshotPath };
+    return { path: target.path, existed_before: false, snapshot_path: snapshotPath };
   });
 
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/scripts/pl-dogfood-activate.mjs:38:12
     const content = readFile(target.path);
     mkdirSync(dirname(snapshotPath), { recursive: true });
     writeFileSync(snapshotPath, content);
-    return { path: target.path, existed_before: true, snapshot_path: snapshotPath };
+    return {};
   });
 
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrayDeclaration
src/scripts/pl-dogfood-activate.mjs:46:27
   // later target's write/rename throws, every already-applied target still has a
   // manifest entry attached to the thrown error -- otherwise a partial failure
   // would leave live-modified files with no manifest to feed pl-dogfood-rollback.mjs.
-  const manifestTargets = [];
+  const manifestTargets = ["Stryker was here"];
   try {
     for (let index = 0; index < targets.length; index += 1) {
killedBy: activate emits a manifest enumerating every applied target with path/existed_before/snapshot_path/new_hash
statusReason: expected [ 'Stryker was here', { …(4) }, …(1) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:47:7
   // manifest entry attached to the thrown error -- otherwise a partial failure
   // would leave live-modified files with no manifest to feed pl-dogfood-rollback.mjs.
   const manifestTargets = [];
-  try {
-    for (let index = 0; index < targets.length; index += 1) {
-      const target = targets[index];
-      const snapshotEntry = snapshotEntries[index];
-      mkdirSync(dirname(target.path), { recursive: true });
-      const tmpPath = `${target.path}.tmp`;
-      writeFileSync(tmpPath, target.content);
-      renameSync(tmpPath, target.path);
-      manifestTargets.push({
-        path: target.path,
-        existed_before: snapshotEntry.existed_before,
-        snapshot_path: snapshotEntry.snapshot_path,
-        new_hash: sha256(target.content),
-      });
-    }
-  } catch (error) {
+  try {} catch (error) {
     error.partialManifest = { version: '1', snapshot_dir: snapshotDir, targets: manifestTargets };
     throw error;
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: expected 'original-content' to be 'new-content' // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-dogfood-activate.mjs:48:25
   // would leave live-modified files with no manifest to feed pl-dogfood-rollback.mjs.
   const manifestTargets = [];
   try {
-    for (let index = 0; index < targets.length; index += 1) {
+    for (let index = 0; index <= targets.length; index += 1) {
       const target = targets[index];
       const snapshotEntry = snapshotEntries[index];
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: Cannot read properties of undefined (reading 'path')

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:48:61
   // would leave live-modified files with no manifest to feed pl-dogfood-rollback.mjs.
   const manifestTargets = [];
   try {
-    for (let index = 0; index < targets.length; index += 1) {
-      const target = targets[index];
-      const snapshotEntry = snapshotEntries[index];
-      mkdirSync(dirname(target.path), { recursive: true });
-      const tmpPath = `${target.path}.tmp`;
-      writeFileSync(tmpPath, target.content);
-      renameSync(tmpPath, target.path);
-      manifestTargets.push({
-        path: target.path,
-        existed_before: snapshotEntry.existed_before,
-        snapshot_path: snapshotEntry.snapshot_path,
-        new_hash: sha256(target.content),
-      });
-    }
+    for (let index = 0; index < targets.length; index += 1) {}
   } catch (error) {
     error.partialManifest = { version: '1', snapshot_dir: snapshotDir, targets: manifestTargets };
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: Cannot read properties of undefined (reading 'existed_before')

[Killed] BooleanLiteral
src/scripts/pl-dogfood-activate.mjs:51:52
     for (let index = 0; index < targets.length; index += 1) {
       const target = targets[index];
       const snapshotEntry = snapshotEntries[index];
-      mkdirSync(dirname(target.path), { recursive: true });
+      mkdirSync(dirname(target.path), { recursive: false });
       const tmpPath = `${target.path}.tmp`;
       writeFileSync(tmpPath, target.content);
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: EEXIST: file already exists, mkdir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-activate-k78tV9'

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:62:19
         new_hash: sha256(target.content),
       });
     }
-  } catch (error) {
-    error.partialManifest = { version: '1', snapshot_dir: snapshotDir, targets: manifestTargets };
-    throw error;
-  }
+  } catch (error) {}
 
   return {
killedBy: activate attaches a partial manifest to the thrown error when a later target fails mid-apply
statusReason: expected undefined not to be undefined

[Survived] StringLiteral
src/scripts/pl-dogfood-activate.mjs:63:40
       });
     }
   } catch (error) {
-    error.partialManifest = { version: '1', snapshot_dir: snapshotDir, targets: manifestTargets };
+    error.partialManifest = { version: "", snapshot_dir: snapshotDir, targets: manifestTargets };
     throw error;
   }

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:76:44
 
 export function runCli(argv) {
   const args = {};
-  for (let i = 0; i < argv.length; i += 1) {
-    if (argv[i] === '--manifest') args.manifest = argv[i + 1];
-    if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
-    if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
-  }
+  for (let i = 0; i < argv.length; i += 1) {}
   if (!args.manifest || !args.snapshotDir) {
     process.stderr.write('usage: pl-dogfood-activate.mjs --manifest <target-list.json> --snapshot-dir <dir> [--manifest-out <path>]\n');
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:76:19
 
 export function runCli(argv) {
   const args = {};
-  for (let i = 0; i < argv.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     if (argv[i] === '--manifest') args.manifest = argv[i + 1];
     if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-dogfood-activate.mjs:77:9
 export function runCli(argv) {
   const args = {};
   for (let i = 0; i < argv.length; i += 1) {
-    if (argv[i] === '--manifest') args.manifest = argv[i + 1];
+    if (argv[i] !== '--manifest') args.manifest = argv[i + 1];
     if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
     if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/scripts/pl-dogfood-activate.mjs:77:56
 export function runCli(argv) {
   const args = {};
   for (let i = 0; i < argv.length; i += 1) {
-    if (argv[i] === '--manifest') args.manifest = argv[i + 1];
+    if (argv[i] === '--manifest') args.manifest = argv[i - 1];
     if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
     if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:78:9
   const args = {};
   for (let i = 0; i < argv.length; i += 1) {
     if (argv[i] === '--manifest') args.manifest = argv[i + 1];
-    if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
+    if (true) args.snapshotDir = argv[i + 1];
     if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
   }
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-dogfood-activate.mjs:78:9
   const args = {};
   for (let i = 0; i < argv.length; i += 1) {
     if (argv[i] === '--manifest') args.manifest = argv[i + 1];
-    if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
+    if (argv[i] !== '--snapshot-dir') args.snapshotDir = argv[i + 1];
     if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
   }
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:79:9
   for (let i = 0; i < argv.length; i += 1) {
     if (argv[i] === '--manifest') args.manifest = argv[i + 1];
     if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
-    if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
+    if (true) args.manifestOut = argv[i + 1];
   }
   if (!args.manifest || !args.snapshotDir) {
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: ENOENT: no such file or directory, open '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-activate-HS8OOt/manifest.json'

[Killed] EqualityOperator
src/scripts/pl-dogfood-activate.mjs:79:9
   for (let i = 0; i < argv.length; i += 1) {
     if (argv[i] === '--manifest') args.manifest = argv[i + 1];
     if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
-    if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
+    if (argv[i] !== '--manifest-out') args.manifestOut = argv[i + 1];
   }
   if (!args.manifest || !args.snapshotDir) {
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: ENOENT: no such file or directory, open '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-activate-r0JMWq/manifest.json'

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:81:7
     if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
     if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
   }
-  if (!args.manifest || !args.snapshotDir) {
+  if (true) {
     process.stderr.write('usage: pl-dogfood-activate.mjs --manifest <target-list.json> --snapshot-dir <dir> [--manifest-out <path>]\n');
     return 2;
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:81:44
     if (argv[i] === '--snapshot-dir') args.snapshotDir = argv[i + 1];
     if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
   }
-  if (!args.manifest || !args.snapshotDir) {
-    process.stderr.write('usage: pl-dogfood-activate.mjs --manifest <target-list.json> --snapshot-dir <dir> [--manifest-out <path>]\n');
-    return 2;
-  }
+  if (!args.manifest || !args.snapshotDir) {}
   const targetList = JSON.parse(readFileSync(args.manifest, 'utf8'));
   try {
killedBy: runCli prints usage and returns exit code 2 when required args are missing
statusReason: The "path" argument must be of type string or an instance of Buffer or URL. Received undefined

[Killed] StringLiteral
src/scripts/pl-dogfood-activate.mjs:82:26
     if (argv[i] === '--manifest-out') args.manifestOut = argv[i + 1];
   }
   if (!args.manifest || !args.snapshotDir) {
-    process.stderr.write('usage: pl-dogfood-activate.mjs --manifest <target-list.json> --snapshot-dir <dir> [--manifest-out <path>]\n');
+    process.stderr.write("");
     return 2;
   }
killedBy: runCli prints usage and returns exit code 2 when required args are missing
statusReason: expected "spy" to be called with arguments: [ StringContaining "usage:" ]

Received: 

  1st spy call:

  Array [
-   StringContaining "usage:",

[Survived] StringLiteral
src/scripts/pl-dogfood-activate.mjs:85:61
     process.stderr.write('usage: pl-dogfood-activate.mjs --manifest <target-list.json> --snapshot-dir <dir> [--manifest-out <path>]\n');
     return 2;
   }
-  const targetList = JSON.parse(readFileSync(args.manifest, 'utf8'));
+  const targetList = JSON.parse(readFileSync(args.manifest, ""));
   try {
     const manifest = activate(targetList, args.snapshotDir);

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:86:7
     return 2;
   }
   const targetList = JSON.parse(readFileSync(args.manifest, 'utf8'));
-  try {
-    const manifest = activate(targetList, args.snapshotDir);
-    const json = JSON.stringify(manifest, null, 2);
-    process.stdout.write(`${json}\n`);
-    if (args.manifestOut) {
-      writeFileSync(args.manifestOut, json);
-    }
-    return 0;
-  } catch (error) {
+  try {} catch (error) {
     if (error.partialManifest && args.manifestOut) {
       writeFileSync(args.manifestOut, JSON.stringify(error.partialManifest, null, 2));
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: expected undefined to be +0 // Object.is equality

[Survived] StringLiteral
src/scripts/pl-dogfood-activate.mjs:89:26
   try {
     const manifest = activate(targetList, args.snapshotDir);
     const json = JSON.stringify(manifest, null, 2);
-    process.stdout.write(`${json}\n`);
+    process.stdout.write(``);
     if (args.manifestOut) {
       writeFileSync(args.manifestOut, json);

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:90:27
     const manifest = activate(targetList, args.snapshotDir);
     const json = JSON.stringify(manifest, null, 2);
     process.stdout.write(`${json}\n`);
-    if (args.manifestOut) {
-      writeFileSync(args.manifestOut, json);
-    }
+    if (args.manifestOut) {}
     return 0;
   } catch (error) {
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: ENOENT: no such file or directory, open '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-activate-INhIBD/manifest.json'

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:90:9
     const manifest = activate(targetList, args.snapshotDir);
     const json = JSON.stringify(manifest, null, 2);
     process.stdout.write(`${json}\n`);
-    if (args.manifestOut) {
+    if (false) {
       writeFileSync(args.manifestOut, json);
     }
killedBy: runCli runs activation end-to-end, writes stdout and --manifest-out, and returns 0
statusReason: ENOENT: no such file or directory, open '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-activate-vcD1qz/manifest.json'

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:94:19
       writeFileSync(args.manifestOut, json);
     }
     return 0;
-  } catch (error) {
-    if (error.partialManifest && args.manifestOut) {
-      writeFileSync(args.manifestOut, JSON.stringify(error.partialManifest, null, 2));
-      process.stderr.write(
-        `activation failed partway through: ${error.message}\npartial manifest written to ${args.manifestOut} -- run pl-dogfood-rollback.mjs against it to restore already-applied targets\n`,
-      );
-    } else {
-      process.stderr.write(`${error.message}\n`);
-    }
-    return 1;
-  }
+  } catch (error) {}
 }
 
killedBy: runCli writes the partial manifest to --manifest-out and returns 1 when activation fails partway through
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-dogfood-activate.mjs:95:52
     }
     return 0;
   } catch (error) {
-    if (error.partialManifest && args.manifestOut) {
-      writeFileSync(args.manifestOut, JSON.stringify(error.partialManifest, null, 2));
-      process.stderr.write(
-        `activation failed partway through: ${error.message}\npartial manifest written to ${args.manifestOut} -- run pl-dogfood-rollback.mjs against it to restore already-applied targets\n`,
-      );
-    } else {
+    if (error.partialManifest && args.manifestOut) {} else {
       process.stderr.write(`${error.message}\n`);
     }
killedBy: runCli writes the partial manifest to --manifest-out and returns 1 when activation fails partway through
statusReason: expected "spy" to be called with arguments: [ StringContaining{…} ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:95:9
     }
     return 0;
   } catch (error) {
-    if (error.partialManifest && args.manifestOut) {
+    if (false) {
       writeFileSync(args.manifestOut, JSON.stringify(error.partialManifest, null, 2));
       process.stderr.write(
killedBy: runCli writes the partial manifest to --manifest-out and returns 1 when activation fails partway through
statusReason: expected "spy" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st spy call:

  Array [
-   StringContaining "partial manifest written",

[NoCoverage] BlockStatement
src/scripts/pl-dogfood-activate.mjs:100:12
       process.stderr.write(
         `activation failed partway through: ${error.message}\npartial manifest written to ${args.manifestOut} -- run pl-dogfood-rollback.mjs against it to restore already-applied targets\n`,
       );
-    } else {
-      process.stderr.write(`${error.message}\n`);
-    }
+    } else {}
     return 1;
   }

[Killed] ConditionalExpression
src/scripts/pl-dogfood-activate.mjs:108:10
 }
 
 export function isMainModule(moduleUrl, argv1) {
-  return moduleUrl === pathToFileURL(argv1 ?? '').href;
+  return true;
 }
 
killedBy: isMainModule is false when argv[1] points at a different file
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
src/scripts/pl-dogfood-activate.mjs:112:29
 }
 
 if (isMainModule(import.meta.url, process.argv[1])) {
-  process.exitCode = runCli(process.argv.slice(2));
+  process.exitCode = runCli(process.argv);
 }
 
