[Killed] ArrowFunction
src/scripts/pl-dogfood-rollback.mjs:17:47
  * @param {(path: string) => string} [readFile]
  * @param {(path: string) => boolean} [fileExists]
  */
-export function rollback(manifest, readFile = (p) => readFileSync(p, 'utf8'), fileExists = existsSync) {
+export function rollback(manifest, readFile = () => undefined, fileExists = existsSync) {
   // Pre-restore integrity check: if anything touched a target after activation
   // (its current bytes no longer match what activation wrote), refuse to
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:21:42
   // Pre-restore integrity check: if anything touched a target after activation
   // (its current bytes no longer match what activation wrote), refuse to
   // silently clobber that change -- abort before restoring any target.
-  for (const target of manifest.targets) {
-    if (fileExists(target.path)) {
-      const actual = readFile(target.path);
-      if (sha256(actual) !== target.new_hash) {
-        throw new Error(`rollback aborted, target diverged from activation state: ${target.path}`);
-      }
-    }
-  }
+  for (const target of manifest.targets) {}
 
   for (const target of manifest.targets) {
killedBy: rollback refuses to restore (aborts before any write) when a target diverged from the recorded post-activation state
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-dogfood-rollback.mjs:22:9
   // (its current bytes no longer match what activation wrote), refuse to
   // silently clobber that change -- abort before restoring any target.
   for (const target of manifest.targets) {
-    if (fileExists(target.path)) {
+    if (false) {
       const actual = readFile(target.path);
       if (sha256(actual) !== target.new_hash) {
killedBy: rollback refuses to restore (aborts before any write) when a target diverged from the recorded post-activation state
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:22:34
   // (its current bytes no longer match what activation wrote), refuse to
   // silently clobber that change -- abort before restoring any target.
   for (const target of manifest.targets) {
-    if (fileExists(target.path)) {
-      const actual = readFile(target.path);
-      if (sha256(actual) !== target.new_hash) {
-        throw new Error(`rollback aborted, target diverged from activation state: ${target.path}`);
-      }
-    }
+    if (fileExists(target.path)) {}
   }
 
killedBy: rollback refuses to restore (aborts before any write) when a target diverged from the recorded post-activation state
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-dogfood-rollback.mjs:24:11
   for (const target of manifest.targets) {
     if (fileExists(target.path)) {
       const actual = readFile(target.path);
-      if (sha256(actual) !== target.new_hash) {
+      if (false) {
         throw new Error(`rollback aborted, target diverged from activation state: ${target.path}`);
       }
killedBy: rollback refuses to restore (aborts before any write) when a target diverged from the recorded post-activation state
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:24:47
   for (const target of manifest.targets) {
     if (fileExists(target.path)) {
       const actual = readFile(target.path);
-      if (sha256(actual) !== target.new_hash) {
-        throw new Error(`rollback aborted, target diverged from activation state: ${target.path}`);
-      }
+      if (sha256(actual) !== target.new_hash) {}
     }
   }
killedBy: rollback refuses to restore (aborts before any write) when a target diverged from the recorded post-activation state
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:30:42
     }
   }
 
-  for (const target of manifest.targets) {
-    if (target.existed_before) {
-      const content = readFile(target.snapshot_path);
-      mkdirSync(dirname(target.path), { recursive: true });
-      const tmpPath = `${target.path}.tmp`;
-      writeFileSync(tmpPath, content);
-      renameSync(tmpPath, target.path);
-    } else if (fileExists(target.path)) {
-      rmSync(target.path);
-    }
-  }
+  for (const target of manifest.targets) {}
 
   for (const target of manifest.targets) {
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: rollback mismatch: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-NlRbUB/a.txt

[Killed] ConditionalExpression
src/scripts/pl-dogfood-rollback.mjs:31:9
   }
 
   for (const target of manifest.targets) {
-    if (target.existed_before) {
+    if (false) {
       const content = readFile(target.snapshot_path);
       mkdirSync(dirname(target.path), { recursive: true });
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: rollback mismatch: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-DE0lGO/a.txt

[Killed] ConditionalExpression
src/scripts/pl-dogfood-rollback.mjs:31:9
   }
 
   for (const target of manifest.targets) {
-    if (target.existed_before) {
+    if (true) {
       const content = readFile(target.snapshot_path);
       mkdirSync(dirname(target.path), { recursive: true });
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: The "path" argument must be of type string or an instance of Buffer or URL. Received null

[Killed] BooleanLiteral
src/scripts/pl-dogfood-rollback.mjs:33:52
   for (const target of manifest.targets) {
     if (target.existed_before) {
       const content = readFile(target.snapshot_path);
-      mkdirSync(dirname(target.path), { recursive: true });
+      mkdirSync(dirname(target.path), { recursive: false });
       const tmpPath = `${target.path}.tmp`;
       writeFileSync(tmpPath, content);
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: EEXIST: file already exists, mkdir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-RC2RDV'

[Killed] StringLiteral
src/scripts/pl-dogfood-rollback.mjs:34:23
     if (target.existed_before) {
       const content = readFile(target.snapshot_path);
       mkdirSync(dirname(target.path), { recursive: true });
-      const tmpPath = `${target.path}.tmp`;
+      const tmpPath = ``;
       writeFileSync(tmpPath, content);
       renameSync(tmpPath, target.path);
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: ENOENT: no such file or directory, open ''

[Killed] ConditionalExpression
src/scripts/pl-dogfood-rollback.mjs:37:16
       const tmpPath = `${target.path}.tmp`;
       writeFileSync(tmpPath, content);
       renameSync(tmpPath, target.path);
-    } else if (fileExists(target.path)) {
+    } else if (false) {
       rmSync(target.path);
     }
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: rollback mismatch: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-MKt2gp/b.txt

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:37:41
       const tmpPath = `${target.path}.tmp`;
       writeFileSync(tmpPath, content);
       renameSync(tmpPath, target.path);
-    } else if (fileExists(target.path)) {
-      rmSync(target.path);
-    }
+    } else if (fileExists(target.path)) {}
   }
 
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: rollback mismatch: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-ICXKe6/b.txt

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:42:42
     }
   }
 
-  for (const target of manifest.targets) {
-    if (target.existed_before) {
-      const expected = readFile(target.snapshot_path);
-      const actual = fileExists(target.path) ? readFile(target.path) : null;
-      if (actual === null || sha256(actual) !== sha256(expected)) {
-        throw new Error(`rollback mismatch: ${target.path}`);
-      }
-    } else if (fileExists(target.path)) {
-      throw new Error(`rollback mismatch: ${target.path}`);
-    }
-  }
+  for (const target of manifest.targets) {}
 
   return { restored: manifest.targets.length };
killedBy: rollback post-restore verification independently detects a mismatch even when the pre-restore check passes
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:43:32
   }
 
   for (const target of manifest.targets) {
-    if (target.existed_before) {
-      const expected = readFile(target.snapshot_path);
-      const actual = fileExists(target.path) ? readFile(target.path) : null;
-      if (actual === null || sha256(actual) !== sha256(expected)) {
-        throw new Error(`rollback mismatch: ${target.path}`);
-      }
-    } else if (fileExists(target.path)) {
+    if (target.existed_before) {} else if (fileExists(target.path)) {
       throw new Error(`rollback mismatch: ${target.path}`);
     }
killedBy: rollback post-restore verification independently detects a mismatch even when the pre-restore check passes
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:46:67
     if (target.existed_before) {
       const expected = readFile(target.snapshot_path);
       const actual = fileExists(target.path) ? readFile(target.path) : null;
-      if (actual === null || sha256(actual) !== sha256(expected)) {
-        throw new Error(`rollback mismatch: ${target.path}`);
-      }
+      if (actual === null || sha256(actual) !== sha256(expected)) {}
     } else if (fileExists(target.path)) {
       throw new Error(`rollback mismatch: ${target.path}`);
killedBy: rollback post-restore verification independently detects a mismatch even when the pre-restore check passes
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-dogfood-rollback.mjs:46:30
     if (target.existed_before) {
       const expected = readFile(target.snapshot_path);
       const actual = fileExists(target.path) ? readFile(target.path) : null;
-      if (actual === null || sha256(actual) !== sha256(expected)) {
+      if (actual === null || false) {
         throw new Error(`rollback mismatch: ${target.path}`);
       }
killedBy: rollback post-restore verification independently detects a mismatch even when the pre-restore check passes
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-dogfood-rollback.mjs:49:16
       if (actual === null || sha256(actual) !== sha256(expected)) {
         throw new Error(`rollback mismatch: ${target.path}`);
       }
-    } else if (fileExists(target.path)) {
+    } else if (true) {
       throw new Error(`rollback mismatch: ${target.path}`);
     }
killedBy: rollback produces an empty diff for both existed-before and did-not-exist-before targets
statusReason: rollback mismatch: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-rollback-03Kgxa/b.txt

[NoCoverage] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:49:41
       if (actual === null || sha256(actual) !== sha256(expected)) {
         throw new Error(`rollback mismatch: ${target.path}`);
       }
-    } else if (fileExists(target.path)) {
-      throw new Error(`rollback mismatch: ${target.path}`);
-    }
+    } else if (fileExists(target.path)) {}
   }
 

[NoCoverage] StringLiteral
src/scripts/pl-dogfood-rollback.mjs:50:23
         throw new Error(`rollback mismatch: ${target.path}`);
       }
     } else if (fileExists(target.path)) {
-      throw new Error(`rollback mismatch: ${target.path}`);
+      throw new Error(``);
     }
   }

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:57:30
   return { restored: manifest.targets.length };
 }
 
-export function runCli(argv) {
-  const args = {};
-  for (let i = 0; i < argv.length; i += 1) {
-    if (argv[i] === '--manifest') args.manifest = argv[i + 1];
-  }
-  if (!args.manifest) {
-    process.stderr.write('usage: pl-dogfood-rollback.mjs --manifest <manifest-out-path>\n');
-    return 2;
-  }
-  const manifest = JSON.parse(readFileSync(args.manifest, 'utf8'));
-  try {
-    const result = rollback(manifest);
-    process.stdout.write(`${JSON.stringify(result, null, 2)}\n`);
-    return 0;
-  } catch (error) {
-    process.stderr.write(`${error.message}\n`);
-    return 1;
-  }
-}
+export function runCli(argv) {}
 
 export function isMainModule(moduleUrl, argv1) {
killedBy: runCli prints usage and returns exit code 2 when required args are missing
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:59:44
 
 export function runCli(argv) {
   const args = {};
-  for (let i = 0; i < argv.length; i += 1) {
-    if (argv[i] === '--manifest') args.manifest = argv[i + 1];
-  }
+  for (let i = 0; i < argv.length; i += 1) {}
   if (!args.manifest) {
     process.stderr.write('usage: pl-dogfood-rollback.mjs --manifest <manifest-out-path>\n');
killedBy: runCli runs rollback end-to-end and returns 0 on success
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-dogfood-rollback.mjs:62:7
   for (let i = 0; i < argv.length; i += 1) {
     if (argv[i] === '--manifest') args.manifest = argv[i + 1];
   }
-  if (!args.manifest) {
+  if (false) {
     process.stderr.write('usage: pl-dogfood-rollback.mjs --manifest <manifest-out-path>\n');
     return 2;
killedBy: runCli prints usage and returns exit code 2 when required args are missing
statusReason: The "path" argument must be of type string or an instance of Buffer or URL. Received undefined

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:62:23
   for (let i = 0; i < argv.length; i += 1) {
     if (argv[i] === '--manifest') args.manifest = argv[i + 1];
   }
-  if (!args.manifest) {
-    process.stderr.write('usage: pl-dogfood-rollback.mjs --manifest <manifest-out-path>\n');
-    return 2;
-  }
+  if (!args.manifest) {}
   const manifest = JSON.parse(readFileSync(args.manifest, 'utf8'));
   try {
killedBy: runCli prints usage and returns exit code 2 when required args are missing
statusReason: The "path" argument must be of type string or an instance of Buffer or URL. Received undefined

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:67:7
     return 2;
   }
   const manifest = JSON.parse(readFileSync(args.manifest, 'utf8'));
-  try {
-    const result = rollback(manifest);
-    process.stdout.write(`${JSON.stringify(result, null, 2)}\n`);
-    return 0;
-  } catch (error) {
+  try {} catch (error) {
     process.stderr.write(`${error.message}\n`);
     return 1;
killedBy: runCli runs rollback end-to-end and returns 0 on success
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:71:19
     const result = rollback(manifest);
     process.stdout.write(`${JSON.stringify(result, null, 2)}\n`);
     return 0;
-  } catch (error) {
-    process.stderr.write(`${error.message}\n`);
-    return 1;
-  }
+  } catch (error) {}
 }
 
killedBy: runCli returns 1 and writes an error message when rollback throws
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-dogfood-rollback.mjs:81:53
   return moduleUrl === pathToFileURL(argv1 ?? '').href;
 }
 
-if (isMainModule(import.meta.url, process.argv[1])) {
-  process.exitCode = runCli(process.argv.slice(2));
-}
+if (isMainModule(import.meta.url, process.argv[1])) {}
 
killedBy: rollback CLI top-level entrypoint (in-process) runs the CLI and sets exitCode when argv[1] resolves to this module
statusReason: expected undefined to be 2 // Object.is equality
