[Killed] BlockStatement
src/scripts/pl-scope-guard.mjs:8:60
 
 const MANIFEST = 'scripts/release-manifest.json';
 
-export function checkPhaseAScope(paths, allowedPaths = []) {
-  const normalizedAllowed = allowedPaths.map((value) => {
-    const normalized = posix.normalize(String(value).replaceAll('\\', '/'));
-    if (
-      normalized === '' ||
-      normalized === '.' ||
-      normalized === '..' ||
-      normalized.startsWith('../')
-    ) {
-      throw new Error(`unsafe allowedPaths entry: ${value}`);
-    }
-    return normalized;
-  });
-  const isAllowed = (value) =>
-    normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
-  return paths
-    .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/') && !isAllowed(value))
-    .sort();
-}
+export function checkPhaseAScope(paths, allowedPaths = []) {}
 
 export function isMainModule(moduleUrl, argv1) {
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/scripts/pl-scope-guard.mjs:9:57
 const MANIFEST = 'scripts/release-manifest.json';
 
 export function checkPhaseAScope(paths, allowedPaths = []) {
-  const normalizedAllowed = allowedPaths.map((value) => {
-    const normalized = posix.normalize(String(value).replaceAll('\\', '/'));
-    if (
-      normalized === '' ||
-      normalized === '.' ||
-      normalized === '..' ||
-      normalized.startsWith('../')
-    ) {
-      throw new Error(`unsafe allowedPaths entry: ${value}`);
-    }
-    return normalized;
-  });
+  const normalizedAllowed = allowedPaths.map((value) => {});
   const isAllowed = (value) =>
     normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
killedBy: Phase A scope guard permits a declared allowedPaths entry and still rejects everything else outside src/
statusReason: expected [ '.agents/other.json', …(1) ] to deeply equal [ '.agents/other.json' ]

[Killed] StringLiteral
src/scripts/pl-scope-guard.mjs:10:65
 
 export function checkPhaseAScope(paths, allowedPaths = []) {
   const normalizedAllowed = allowedPaths.map((value) => {
-    const normalized = posix.normalize(String(value).replaceAll('\\', '/'));
+    const normalized = posix.normalize(String(value).replaceAll("", '/'));
     if (
       normalized === '' ||
killedBy: Phase A scope guard permits a declared allowedPaths entry and still rejects everything else outside src/
statusReason: expected [ '.agents/other.json', …(1) ] to deeply equal [ '.agents/other.json' ]

[Killed] LogicalOperator
src/scripts/pl-scope-guard.mjs:12:7
   const normalizedAllowed = allowedPaths.map((value) => {
     const normalized = posix.normalize(String(value).replaceAll('\\', '/'));
     if (
-      normalized === '' ||
-      normalized === '.' ||
-      normalized === '..' ||
+      (normalized === '' || normalized === '.') && normalized === '..' ||
       normalized.startsWith('../')
     ) {
killedBy: Phase A scope guard rejects an unsafe allowedPaths entry "" instead of silently permitting everything
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/scripts/pl-scope-guard.mjs:12:7
   const normalizedAllowed = allowedPaths.map((value) => {
     const normalized = posix.normalize(String(value).replaceAll('\\', '/'));
     if (
-      normalized === '' ||
+      normalized !== '' ||
       normalized === '.' ||
       normalized === '..' ||
killedBy: Phase A scope guard permits a declared allowedPaths entry and still rejects everything else outside src/
statusReason: unsafe allowedPaths entry: .agents/ts-deliver-router/registry.json

[Killed] EqualityOperator
src/scripts/pl-scope-guard.mjs:13:7
     const normalized = posix.normalize(String(value).replaceAll('\\', '/'));
     if (
       normalized === '' ||
-      normalized === '.' ||
+      normalized !== '.' ||
       normalized === '..' ||
       normalized.startsWith('../')
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: unsafe allowedPaths entry: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-activate-7H17Yz/a.txt

[Killed] ConditionalExpression
src/scripts/pl-scope-guard.mjs:13:7
     const normalized = posix.normalize(String(value).replaceAll('\\', '/'));
     if (
       normalized === '' ||
-      normalized === '.' ||
+      false ||
       normalized === '..' ||
       normalized.startsWith('../')
killedBy: activate rejects an unsafe allowedPaths entry (dot/dotdot/traversal) instead of silently permitting everything
statusReason: expected [Function] to throw error matching /unsafe allowedPaths entry/ but got 'target path(s) outside declared allow…'

[Killed] ConditionalExpression
src/scripts/pl-scope-guard.mjs:14:7
     if (
       normalized === '' ||
       normalized === '.' ||
-      normalized === '..' ||
+      false ||
       normalized.startsWith('../')
     ) {
killedBy: Phase A scope guard rejects an unsafe allowedPaths entry ".." instead of silently permitting everything
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/scripts/pl-scope-guard.mjs:14:7
     if (
       normalized === '' ||
       normalized === '.' ||
-      normalized === '..' ||
+      normalized !== '..' ||
       normalized.startsWith('../')
     ) {
killedBy: activate snapshots every target before any write (three existing, one not-yet-existing)
statusReason: unsafe allowedPaths entry: /var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-dogfood-activate-c5ChFL/a.txt

[Killed] MethodExpression
src/scripts/pl-scope-guard.mjs:15:7
       normalized === '' ||
       normalized === '.' ||
       normalized === '..' ||
-      normalized.startsWith('../')
+      normalized.endsWith('../')
     ) {
       throw new Error(`unsafe allowedPaths entry: ${value}`);
killedBy: Phase A scope guard rejects an unsafe allowedPaths entry "../escape" instead of silently permitting everything
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-scope-guard.mjs:16:7
       normalized === '.' ||
       normalized === '..' ||
       normalized.startsWith('../')
-    ) {
-      throw new Error(`unsafe allowedPaths entry: ${value}`);
-    }
+    ) {}
     return normalized;
   });
killedBy: Phase A scope guard rejects an unsafe allowedPaths entry "" instead of silently permitting everything
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/scripts/pl-scope-guard.mjs:21:21
     }
     return normalized;
   });
-  const isAllowed = (value) =>
-    normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
+  const isAllowed = () => undefined;
   return paths
     .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
killedBy: Phase A scope guard permits a declared allowedPaths entry and still rejects everything else outside src/
statusReason: expected [ '.agents/other.json', …(1) ] to deeply equal [ '.agents/other.json' ]

[Killed] EqualityOperator
src/scripts/pl-scope-guard.mjs:22:41
     return normalized;
   });
   const isAllowed = (value) =>
-    normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
+    normalizedAllowed.some((allowed) => value !== allowed || value.startsWith(`${allowed}/`));
   return paths
     .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
killedBy: activate aborts before any apply-phase write when a snapshot copy fails
statusReason: expected [Function] to throw error including 'permission error' but got 'target path(s) outside declared allow…'

[Killed] ArrowFunction
src/scripts/pl-scope-guard.mjs:22:28
     return normalized;
   });
   const isAllowed = (value) =>
-    normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
+    normalizedAllowed.some(() => undefined);
   return paths
     .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
killedBy: Phase A scope guard permits a declared allowedPaths entry and still rejects everything else outside src/
statusReason: expected [ '.agents/other.json', …(1) ] to deeply equal [ '.agents/other.json' ]

[Killed] MethodExpression
src/scripts/pl-scope-guard.mjs:23:10
   });
   const isAllowed = (value) =>
     normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
-  return paths
-    .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/') && !isAllowed(value))
-    .sort();
+  return paths.map(value => posix.normalize(String(value).replaceAll('\\', '/'))).filter(value => value !== MANIFEST && !value.startsWith('src/') && !isAllowed(value));
 }
 
killedBy: Phase A scope guard rejects every other implementation path
statusReason: expected [ 'package.json', …(3) ] to deeply equal [ '.agents/registry.json', …(3) ]

[Killed] MethodExpression
src/scripts/pl-scope-guard.mjs:23:10
   });
   const isAllowed = (value) =>
     normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
-  return paths
-    .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/') && !isAllowed(value))
+  return paths.map(value => posix.normalize(String(value).replaceAll('\\', '/')))
     .sort();
 }
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BooleanLiteral
src/scripts/pl-scope-guard.mjs:25:46
     normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
   return paths
     .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/') && !isAllowed(value))
+    .filter((value) => value !== MANIFEST && value.startsWith('src/') && !isAllowed(value))
     .sort();
 }
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: expected [ 'src/scripts/pl-arch-check.mjs' ] to deeply equal []

[Killed] MethodExpression
src/scripts/pl-scope-guard.mjs:25:47
     normalizedAllowed.some((allowed) => value === allowed || value.startsWith(`${allowed}/`));
   return paths
     .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/') && !isAllowed(value))
+    .filter((value) => value !== MANIFEST && !value.endsWith('src/') && !isAllowed(value))
     .sort();
 }
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: expected [ 'src/scripts/pl-arch-check.mjs' ] to deeply equal []

[Killed] ConditionalExpression
src/scripts/pl-scope-guard.mjs:35:7
 
 if (isMainModule(import.meta.url, process.argv[1])) {
   const violations = checkPhaseAScope(process.argv.slice(2));
-  if (violations.length) {
+  if (true) {
     process.stderr.write(`${violations.join('\n')}\n`);
     process.exitCode = 1;
killedBy: Phase A scope guard top-level CLI guard (in-process) sets no exit code when argv[1] resolves to this module but every path is in scope
statusReason: expected 1 to be undefined
