[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:24:24
   contract: join(SCRIPT_DIR, 'pl-contract-check.mjs'),
   scenario: join(SCRIPT_DIR, 'gen-scenarios.mjs'),
 };
-const HOSTS = new Set(['codex', 'claude-code']);
+const HOSTS = new Set(["", 'claude-code']);
 const RULE_ID_PATTERN = /\bPL-[A-Z]+(?:-[A-Z0-9]+)+\b/gi;
 
killedBy: loadDescriptor loads both host descriptors
statusReason: Unknown descriptor host in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/codex/descriptor.json: codex

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:24:33
   contract: join(SCRIPT_DIR, 'pl-contract-check.mjs'),
   scenario: join(SCRIPT_DIR, 'gen-scenarios.mjs'),
 };
-const HOSTS = new Set(['codex', 'claude-code']);
+const HOSTS = new Set(['codex', ""]);
 const RULE_ID_PATTERN = /\bPL-[A-Z]+(?:-[A-Z0-9]+)+\b/gi;
 
killedBy: loadDescriptor loads both host descriptors
statusReason: Unknown descriptor host in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/claude-code/descriptor.json: claude-code

[Killed] Regex
src/scripts/pl-adapter-conformance.mjs:25:25
   scenario: join(SCRIPT_DIR, 'gen-scenarios.mjs'),
 };
 const HOSTS = new Set(['codex', 'claude-code']);
-const RULE_ID_PATTERN = /\bPL-[A-Z]+(?:-[A-Z0-9]+)+\b/gi;
+const RULE_ID_PATTERN = /\bPL-[A-Z](?:-[A-Z0-9]+)+\b/gi;
 
 const slash = (value) => String(value).replaceAll('\\', '/');
killedBy: checkAdapterBoundary fails a template planted with an embedded kernel rule id
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/scripts/pl-adapter-conformance.mjs:27:15
 const HOSTS = new Set(['codex', 'claude-code']);
 const RULE_ID_PATTERN = /\bPL-[A-Z]+(?:-[A-Z0-9]+)+\b/gi;
 
-const slash = (value) => String(value).replaceAll('\\', '/');
+const slash = () => undefined;
 const inside = (root, value) => {
   const rel = relative(root, value);
killedBy: loadDescriptor loads both host descriptors
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:27:57
 const HOSTS = new Set(['codex', 'claude-code']);
 const RULE_ID_PATTERN = /\bPL-[A-Z]+(?:-[A-Z0-9]+)+\b/gi;
 
-const slash = (value) => String(value).replaceAll('\\', '/');
+const slash = (value) => String(value).replaceAll('\\', "");
 const inside = (root, value) => {
   const rel = relative(root, value);
killedBy: normalizeObservation parses structured JSON stdout and slash-normalizes diagnostic paths
statusReason: expected 'srca.ts' to be 'src/a.ts' // Object.is equality

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:28:33
 const RULE_ID_PATTERN = /\bPL-[A-Z]+(?:-[A-Z0-9]+)+\b/gi;
 
 const slash = (value) => String(value).replaceAll('\\', '/');
-const inside = (root, value) => {
-  const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
-};
+const inside = (root, value) => {};
 
 function structuralError(rule_id, message) {
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case compliant-architecture fixture path escapes the shared fixture root: ../pl-sample-app/compliant

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:30:10
 const slash = (value) => String(value).replaceAll('\\', '/');
 const inside = (root, value) => {
   const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
+  return false;
 };
 
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case compliant-architecture fixture path escapes the shared fixture root: ../pl-sample-app/compliant

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:30:25
 const slash = (value) => String(value).replaceAll('\\', '/');
 const inside = (root, value) => {
   const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
+  return rel === '' || (false);
 };
 
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case compliant-architecture fixture path escapes the shared fixture root: ../pl-sample-app/compliant

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:33:44
   return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
 };
 
-function structuralError(rule_id, message) {
-  return Object.assign(new Error(message), { rule: rule_id });
-}
+function structuralError(rule_id, message) {}
 
 /** Loads and validates the shared fixture manifest driving both hosts. */
killedBy: loadManifest rejects a manifest that fails to parse as JSON
statusReason: expected [Function] to throw an error

[Survived] ObjectLiteral
src/scripts/pl-adapter-conformance.mjs:34:44
 };
 
 function structuralError(rule_id, message) {
-  return Object.assign(new Error(message), { rule: rule_id });
+  return Object.assign(new Error(message), {});
 }
 

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:41:7
 export function loadManifest(path, { fixtureRoot }) {
   const canonicalFixtureRoot = realpathSync(resolve(fixtureRoot));
   let raw;
-  try {
-    raw = JSON.parse(readFileSync(path, 'utf8'));
-  } catch (error) {
+  try {} catch (error) {
     throw structuralError('PL-ADAPTER-MANIFEST-PARSE', `Unable to parse fixture manifest: ${error.message}`);
   }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Unsupported fixture manifest version

[Survived] StringLiteral
src/scripts/pl-adapter-conformance.mjs:42:41
   const canonicalFixtureRoot = realpathSync(resolve(fixtureRoot));
   let raw;
   try {
-    raw = JSON.parse(readFileSync(path, 'utf8'));
+    raw = JSON.parse(readFileSync(path, ""));
   } catch (error) {
     throw structuralError('PL-ADAPTER-MANIFEST-PARSE', `Unable to parse fixture manifest: ${error.message}`);

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:43:19
   let raw;
   try {
     raw = JSON.parse(readFileSync(path, 'utf8'));
-  } catch (error) {
-    throw structuralError('PL-ADAPTER-MANIFEST-PARSE', `Unable to parse fixture manifest: ${error.message}`);
-  }
+  } catch (error) {}
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-MANIFEST-VERSION', 'Unsupported fixture manifest version');
   if (!Array.isArray(raw.cases) || raw.cases.length === 0) throw structuralError('PL-ADAPTER-MANIFEST-EMPTY', 'Fixture manifest cases must be non-empty');
killedBy: loadManifest rejects a manifest that fails to parse as JSON
statusReason: expected [Function] to throw error matching /Unable to parse fixture manifest/ but got 'Unsupported fixture manifest version'

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:44:56
   try {
     raw = JSON.parse(readFileSync(path, 'utf8'));
   } catch (error) {
-    throw structuralError('PL-ADAPTER-MANIFEST-PARSE', `Unable to parse fixture manifest: ${error.message}`);
+    throw structuralError('PL-ADAPTER-MANIFEST-PARSE', ``);
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-MANIFEST-VERSION', 'Unsupported fixture manifest version');
killedBy: loadManifest rejects a manifest that fails to parse as JSON
statusReason: expected [Function] to throw error matching /Unable to parse fixture manifest/ but got ''

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:46:7
   } catch (error) {
     throw structuralError('PL-ADAPTER-MANIFEST-PARSE', `Unable to parse fixture manifest: ${error.message}`);
   }
-  if (raw?.version !== '1') throw structuralError('PL-ADAPTER-MANIFEST-VERSION', 'Unsupported fixture manifest version');
+  if (true) throw structuralError('PL-ADAPTER-MANIFEST-VERSION', 'Unsupported fixture manifest version');
   if (!Array.isArray(raw.cases) || raw.cases.length === 0) throw structuralError('PL-ADAPTER-MANIFEST-EMPTY', 'Fixture manifest cases must be non-empty');
 
killedBy: loadManifest loads the shared fixture manifest
statusReason: Unsupported fixture manifest version

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:46:7
   } catch (error) {
     throw structuralError('PL-ADAPTER-MANIFEST-PARSE', `Unable to parse fixture manifest: ${error.message}`);
   }
-  if (raw?.version !== '1') throw structuralError('PL-ADAPTER-MANIFEST-VERSION', 'Unsupported fixture manifest version');
+  if (false) throw structuralError('PL-ADAPTER-MANIFEST-VERSION', 'Unsupported fixture manifest version');
   if (!Array.isArray(raw.cases) || raw.cases.length === 0) throw structuralError('PL-ADAPTER-MANIFEST-EMPTY', 'Fixture manifest cases must be non-empty');
 
killedBy: loadManifest rejects an unsupported manifest version
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:47:36
     throw structuralError('PL-ADAPTER-MANIFEST-PARSE', `Unable to parse fixture manifest: ${error.message}`);
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-MANIFEST-VERSION', 'Unsupported fixture manifest version');
-  if (!Array.isArray(raw.cases) || raw.cases.length === 0) throw structuralError('PL-ADAPTER-MANIFEST-EMPTY', 'Fixture manifest cases must be non-empty');
+  if (!Array.isArray(raw.cases) || false) throw structuralError('PL-ADAPTER-MANIFEST-EMPTY', 'Fixture manifest cases must be non-empty');
 
   const ids = new Set();
killedBy: loadManifest rejects an empty case list
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:47:36
     throw structuralError('PL-ADAPTER-MANIFEST-PARSE', `Unable to parse fixture manifest: ${error.message}`);
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-MANIFEST-VERSION', 'Unsupported fixture manifest version');
-  if (!Array.isArray(raw.cases) || raw.cases.length === 0) throw structuralError('PL-ADAPTER-MANIFEST-EMPTY', 'Fixture manifest cases must be non-empty');
+  if (!Array.isArray(raw.cases) || raw.cases.length !== 0) throw structuralError('PL-ADAPTER-MANIFEST-EMPTY', 'Fixture manifest cases must be non-empty');
 
   const ids = new Set();
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture manifest cases must be non-empty

[Killed] MethodExpression
src/scripts/pl-adapter-conformance.mjs:51:18
 
   const ids = new Set();
   const cases = raw.cases.map((entry) => {
-    const keys = Object.keys(entry ?? {}).sort();
+    const keys = Object.keys(entry ?? {});
     const allowed = ['args', 'command', 'expected', 'fixture', 'id'];
     if (keys.join(',') !== allowed.join(',')) {
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case has unexpected fields: id, command, fixture, args, expected

[Killed] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:51:30
 
   const ids = new Set();
   const cases = raw.cases.map((entry) => {
-    const keys = Object.keys(entry ?? {}).sort();
+    const keys = Object.keys(entry && {}).sort();
     const allowed = ['args', 'command', 'expected', 'fixture', 'id'];
     if (keys.join(',') !== allowed.join(',')) {
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case has unexpected fields:

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:52:22
   const ids = new Set();
   const cases = raw.cases.map((entry) => {
     const keys = Object.keys(entry ?? {}).sort();
-    const allowed = ['args', 'command', 'expected', 'fixture', 'id'];
+    const allowed = ["", 'command', 'expected', 'fixture', 'id'];
     if (keys.join(',') !== allowed.join(',')) {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-SHAPE', `Fixture case has unexpected fields: ${keys.join(', ')}`);
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case has unexpected fields: args, command, expected, fixture, id

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:52:53
   const ids = new Set();
   const cases = raw.cases.map((entry) => {
     const keys = Object.keys(entry ?? {}).sort();
-    const allowed = ['args', 'command', 'expected', 'fixture', 'id'];
+    const allowed = ['args', 'command', 'expected', "", 'id'];
     if (keys.join(',') !== allowed.join(',')) {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-SHAPE', `Fixture case has unexpected fields: ${keys.join(', ')}`);
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case has unexpected fields: args, command, expected, fixture, id

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:53:47
   const cases = raw.cases.map((entry) => {
     const keys = Object.keys(entry ?? {}).sort();
     const allowed = ['args', 'command', 'expected', 'fixture', 'id'];
-    if (keys.join(',') !== allowed.join(',')) {
-      throw structuralError('PL-ADAPTER-MANIFEST-CASE-SHAPE', `Fixture case has unexpected fields: ${keys.join(', ')}`);
-    }
+    if (keys.join(',') !== allowed.join(',')) {}
     if (typeof entry.id !== 'string' || entry.id.trim() === '') {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-ID', 'Fixture case id must be a non-empty string');
killedBy: loadManifest rejects a host-specific extra field on a case (no per-host fixture/golden paths)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:53:9
   const cases = raw.cases.map((entry) => {
     const keys = Object.keys(entry ?? {}).sort();
     const allowed = ['args', 'command', 'expected', 'fixture', 'id'];
-    if (keys.join(',') !== allowed.join(',')) {
+    if (true) {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-SHAPE', `Fixture case has unexpected fields: ${keys.join(', ')}`);
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case has unexpected fields: args, command, expected, fixture, id

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:54:63
     const keys = Object.keys(entry ?? {}).sort();
     const allowed = ['args', 'command', 'expected', 'fixture', 'id'];
     if (keys.join(',') !== allowed.join(',')) {
-      throw structuralError('PL-ADAPTER-MANIFEST-CASE-SHAPE', `Fixture case has unexpected fields: ${keys.join(', ')}`);
+      throw structuralError('PL-ADAPTER-MANIFEST-CASE-SHAPE', ``);
     }
     if (typeof entry.id !== 'string' || entry.id.trim() === '') {
killedBy: loadManifest rejects a host-specific extra field on a case (no per-host fixture/golden paths)
statusReason: expected [Function] to throw error matching /unexpected fields/ but got ''

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:56:9
     if (keys.join(',') !== allowed.join(',')) {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-SHAPE', `Fixture case has unexpected fields: ${keys.join(', ')}`);
     }
-    if (typeof entry.id !== 'string' || entry.id.trim() === '') {
+    if (true) {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-ID', 'Fixture case id must be a non-empty string');
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case id must be a non-empty string

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:56:9
     if (keys.join(',') !== allowed.join(',')) {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-SHAPE', `Fixture case has unexpected fields: ${keys.join(', ')}`);
     }
-    if (typeof entry.id !== 'string' || entry.id.trim() === '') {
+    if (typeof entry.id === 'string' || entry.id.trim() === '') {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-ID', 'Fixture case id must be a non-empty string');
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case id must be a non-empty string

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:59:9
     if (typeof entry.id !== 'string' || entry.id.trim() === '') {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-ID', 'Fixture case id must be a non-empty string');
     }
-    if (ids.has(entry.id)) throw structuralError('PL-ADAPTER-MANIFEST-DUPLICATE-ID', `Duplicate fixture case id: ${entry.id}`);
+    if (true) throw structuralError('PL-ADAPTER-MANIFEST-DUPLICATE-ID', `Duplicate fixture case id: ${entry.id}`);
     ids.add(entry.id);
     if (!KERNEL_COMMANDS[entry.command]) {
killedBy: loadManifest loads the shared fixture manifest
statusReason: Duplicate fixture case id: compliant-architecture

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:59:9
     if (typeof entry.id !== 'string' || entry.id.trim() === '') {
       throw structuralError('PL-ADAPTER-MANIFEST-CASE-ID', 'Fixture case id must be a non-empty string');
     }
-    if (ids.has(entry.id)) throw structuralError('PL-ADAPTER-MANIFEST-DUPLICATE-ID', `Duplicate fixture case id: ${entry.id}`);
+    if (false) throw structuralError('PL-ADAPTER-MANIFEST-DUPLICATE-ID', `Duplicate fixture case id: ${entry.id}`);
     ids.add(entry.id);
     if (!KERNEL_COMMANDS[entry.command]) {
killedBy: loadManifest rejects duplicate case ids
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:61:9
     }
     if (ids.has(entry.id)) throw structuralError('PL-ADAPTER-MANIFEST-DUPLICATE-ID', `Duplicate fixture case id: ${entry.id}`);
     ids.add(entry.id);
-    if (!KERNEL_COMMANDS[entry.command]) {
+    if (KERNEL_COMMANDS[entry.command]) {
       throw structuralError('PL-ADAPTER-MANIFEST-COMMAND', `Fixture case ${entry.id} references unknown command: ${entry.command}`);
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case compliant-architecture references unknown command: arch

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:61:9
     }
     if (ids.has(entry.id)) throw structuralError('PL-ADAPTER-MANIFEST-DUPLICATE-ID', `Duplicate fixture case id: ${entry.id}`);
     ids.add(entry.id);
-    if (!KERNEL_COMMANDS[entry.command]) {
+    if (true) {
       throw structuralError('PL-ADAPTER-MANIFEST-COMMAND', `Fixture case ${entry.id} references unknown command: ${entry.command}`);
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case compliant-architecture references unknown command: arch

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:65:9
       throw structuralError('PL-ADAPTER-MANIFEST-COMMAND', `Fixture case ${entry.id} references unknown command: ${entry.command}`);
     }
     const fixtureRootAbs = resolve(dirname(path), entry.fixture);
-    if (!existsSync(fixtureRootAbs) || !inside(canonicalFixtureRoot, realpathSync(fixtureRootAbs))) {
+    if (existsSync(fixtureRootAbs) || !inside(canonicalFixtureRoot, realpathSync(fixtureRootAbs))) {
       throw structuralError('PL-ADAPTER-MANIFEST-PATH-ESCAPE', `Fixture case ${entry.id} fixture path escapes the shared fixture root: ${entry.fixture}`);
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case compliant-architecture fixture path escapes the shared fixture root: ../pl-sample-app/compliant

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:65:9
       throw structuralError('PL-ADAPTER-MANIFEST-COMMAND', `Fixture case ${entry.id} references unknown command: ${entry.command}`);
     }
     const fixtureRootAbs = resolve(dirname(path), entry.fixture);
-    if (!existsSync(fixtureRootAbs) || !inside(canonicalFixtureRoot, realpathSync(fixtureRootAbs))) {
+    if (true) {
       throw structuralError('PL-ADAPTER-MANIFEST-PATH-ESCAPE', `Fixture case ${entry.id} fixture path escapes the shared fixture root: ${entry.fixture}`);
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case compliant-architecture fixture path escapes the shared fixture root: ../pl-sample-app/compliant

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:69:9
       throw structuralError('PL-ADAPTER-MANIFEST-PATH-ESCAPE', `Fixture case ${entry.id} fixture path escapes the shared fixture root: ${entry.fixture}`);
     }
     const expectedAbs = resolve(dirname(path), entry.expected);
-    if (!existsSync(expectedAbs) || !inside(canonicalFixtureRoot, realpathSync(expectedAbs))) {
+    if (true) {
       throw structuralError('PL-ADAPTER-MANIFEST-EXPECTED-MISSING', `Fixture case ${entry.id} expected reference is missing or escapes the shared fixture root: ${entry.expected}`);
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case compliant-architecture expected reference is missing or escapes the shared fixture root: ../pl-sample-app/compliant/expected.json

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:69:9
       throw structuralError('PL-ADAPTER-MANIFEST-PATH-ESCAPE', `Fixture case ${entry.id} fixture path escapes the shared fixture root: ${entry.fixture}`);
     }
     const expectedAbs = resolve(dirname(path), entry.expected);
-    if (!existsSync(expectedAbs) || !inside(canonicalFixtureRoot, realpathSync(expectedAbs))) {
+    if (false) {
       throw structuralError('PL-ADAPTER-MANIFEST-EXPECTED-MISSING', `Fixture case ${entry.id} expected reference is missing or escapes the shared fixture root: ${entry.expected}`);
     }
killedBy: loadManifest rejects a missing expected reference
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:72:66
     if (!existsSync(expectedAbs) || !inside(canonicalFixtureRoot, realpathSync(expectedAbs))) {
       throw structuralError('PL-ADAPTER-MANIFEST-EXPECTED-MISSING', `Fixture case ${entry.id} expected reference is missing or escapes the shared fixture root: ${entry.expected}`);
     }
-    if (!Array.isArray(entry.args) || entry.args.some((value) => typeof value !== 'string')) {
+    if (!Array.isArray(entry.args) || entry.args.some((value) => true)) {
       throw structuralError('PL-ADAPTER-MANIFEST-ARGS', `Fixture case ${entry.id} args must be an array of strings`);
     }
killedBy: loadManifest loads the shared fixture manifest
statusReason: Fixture case contract-violation args must be an array of strings

[Killed] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:72:9
     if (!existsSync(expectedAbs) || !inside(canonicalFixtureRoot, realpathSync(expectedAbs))) {
       throw structuralError('PL-ADAPTER-MANIFEST-EXPECTED-MISSING', `Fixture case ${entry.id} expected reference is missing or escapes the shared fixture root: ${entry.expected}`);
     }
-    if (!Array.isArray(entry.args) || entry.args.some((value) => typeof value !== 'string')) {
+    if (!Array.isArray(entry.args) && entry.args.some(value => typeof value !== 'string')) {
       throw structuralError('PL-ADAPTER-MANIFEST-ARGS', `Fixture case ${entry.id} args must be an array of strings`);
     }
killedBy: loadManifest rejects a case whose args is not an array of strings
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/scripts/pl-adapter-conformance.mjs:75:12
     if (!Array.isArray(entry.args) || entry.args.some((value) => typeof value !== 'string')) {
       throw structuralError('PL-ADAPTER-MANIFEST-ARGS', `Fixture case ${entry.id} args must be an array of strings`);
     }
-    return { id: entry.id, command: entry.command, fixtureRoot: fixtureRootAbs, args: entry.args, expectedPath: expectedAbs };
+    return {};
   });
 
killedBy: loadManifest loads the shared fixture manifest
statusReason: expected [ undefined, undefined, …(4) ] to deeply equal [ 'compliant-architecture', …(5) ]

[Survived] StringLiteral
src/scripts/pl-adapter-conformance.mjs:78:21
     return { id: entry.id, command: entry.command, fixtureRoot: fixtureRootAbs, args: entry.args, expectedPath: expectedAbs };
   });
 
-  return { version: '1', cases };
+  return { version: "", cases };
 }
 

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:82:38
 }
 
 /** Loads and validates a host adapter descriptor. Descriptors carry no kernel rule ids. */
-export function loadDescriptor(path) {
-  let raw;
-  try {
-    raw = JSON.parse(readFileSync(path, 'utf8'));
-  } catch (error) {
-    throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', `Unable to parse host descriptor: ${error.message}`);
-  }
-  if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
-  if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
-  if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
-  if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
-  if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
-    || slash(raw.entry).split('/').includes('..')) {
-    throw structuralError('PL-ADAPTER-DESCRIPTOR-ENTRY', `Descriptor entry must be a non-empty project-relative path with no '..' segments in ${path}`);
-  }
-  return { version: '1', host: raw.host, invocation: raw.invocation, entry: raw.entry, display: raw.display };
-}
+export function loadDescriptor(path) {}
 
 /**
killedBy: loadDescriptor rejects a descriptor that fails to parse as JSON
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:86:19
   let raw;
   try {
     raw = JSON.parse(readFileSync(path, 'utf8'));
-  } catch (error) {
-    throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', `Unable to parse host descriptor: ${error.message}`);
-  }
+  } catch (error) {}
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
killedBy: loadDescriptor rejects a descriptor that fails to parse as JSON
statusReason: expected [Function] to throw error matching /Unable to parse host descriptor/ but got 'Unsupported descriptor version in /va…'

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:87:58
   try {
     raw = JSON.parse(readFileSync(path, 'utf8'));
   } catch (error) {
-    throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', `Unable to parse host descriptor: ${error.message}`);
+    throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', ``);
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
killedBy: loadDescriptor rejects a descriptor that fails to parse as JSON
statusReason: expected [Function] to throw error matching /Unable to parse host descriptor/ but got ''

[Survived] StringLiteral
src/scripts/pl-adapter-conformance.mjs:87:27
   try {
     raw = JSON.parse(readFileSync(path, 'utf8'));
   } catch (error) {
-    throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', `Unable to parse host descriptor: ${error.message}`);
+    throw structuralError("", `Unable to parse host descriptor: ${error.message}`);
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:89:7
   } catch (error) {
     throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', `Unable to parse host descriptor: ${error.message}`);
   }
-  if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
+  if (true) throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
killedBy: loadDescriptor loads both host descriptors
statusReason: Unsupported descriptor version in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/codex/descriptor.json

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:89:7
   } catch (error) {
     throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', `Unable to parse host descriptor: ${error.message}`);
   }
-  if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
+  if (raw?.version === '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
killedBy: loadDescriptor loads both host descriptors
statusReason: Unsupported descriptor version in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/codex/descriptor.json
