[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:90:7
     throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', `Unable to parse host descriptor: ${error.message}`);
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
-  if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
+  if (false) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
   if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
killedBy: loadDescriptor rejects unknown host
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:90:7
     throw structuralError('PL-ADAPTER-DESCRIPTOR-PARSE', `Unable to parse host descriptor: ${error.message}`);
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
-  if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
+  if (true) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
   if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
killedBy: loadDescriptor loads both host descriptors
statusReason: Unknown descriptor host in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/codex/descriptor.json: codex

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:91:7
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
-  if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
+  if (raw.invocation === 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
   if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
   if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
killedBy: loadDescriptor loads both host descriptors
statusReason: Unsupported descriptor invocation in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/codex/descriptor.json: pl-kernel

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:91:7
   }
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
-  if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
+  if (false) throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
   if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
   if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
killedBy: loadDescriptor rejects unknown invocation
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:92:7
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
-  if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
+  if (true) throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
   if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
     || slash(raw.entry).split('/').includes('..')) {
killedBy: loadDescriptor loads both host descriptors
statusReason: Unsupported descriptor display mode in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/codex/descriptor.json: passthrough

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:92:7
   if (raw?.version !== '1') throw structuralError('PL-ADAPTER-DESCRIPTOR-VERSION', `Unsupported descriptor version in ${path}`);
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
-  if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
+  if (raw.display === 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
   if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
     || slash(raw.entry).split('/').includes('..')) {
killedBy: loadDescriptor loads both host descriptors
statusReason: Unsupported descriptor display mode in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/codex/descriptor.json: passthrough

[Killed] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:93:7
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
   if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
-  if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
+  if ((typeof raw.entry !== 'string' || raw.entry.trim() === '') && isAbsolute(raw.entry)
     || slash(raw.entry).split('/').includes('..')) {
     throw structuralError('PL-ADAPTER-DESCRIPTOR-ENTRY', `Descriptor entry must be a non-empty project-relative path with no '..' segments in ${path}`);
killedBy: loadDescriptor rejects a non-relative entry path
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:93:7
   if (!HOSTS.has(raw.host)) throw structuralError('PL-ADAPTER-DESCRIPTOR-HOST', `Unknown descriptor host in ${path}: ${raw.host}`);
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
   if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
-  if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
-    || slash(raw.entry).split('/').includes('..')) {
+  if (true) {
     throw structuralError('PL-ADAPTER-DESCRIPTOR-ENTRY', `Descriptor entry must be a non-empty project-relative path with no '..' segments in ${path}`);
   }
killedBy: loadDescriptor loads both host descriptors
statusReason: Descriptor entry must be a non-empty project-relative path with no '..' segments in /Users/ctony/work/workspace/agenticToolset/.stryker-tmp/sandbox-mM0mvr/src/skills/ts-pl/references/templates/codex/descriptor.json

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:94:52
   if (raw.invocation !== 'pl-kernel') throw structuralError('PL-ADAPTER-DESCRIPTOR-INVOCATION', `Unsupported descriptor invocation in ${path}: ${raw.invocation}`);
   if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
   if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
-    || slash(raw.entry).split('/').includes('..')) {
-    throw structuralError('PL-ADAPTER-DESCRIPTOR-ENTRY', `Descriptor entry must be a non-empty project-relative path with no '..' segments in ${path}`);
-  }
+    || slash(raw.entry).split('/').includes('..')) {}
   return { version: '1', host: raw.host, invocation: raw.invocation, entry: raw.entry, display: raw.display };
 }
killedBy: loadDescriptor rejects a non-relative entry path
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/scripts/pl-adapter-conformance.mjs:95:27
   if (raw.display !== 'passthrough') throw structuralError('PL-ADAPTER-DESCRIPTOR-DISPLAY', `Unsupported descriptor display mode in ${path}: ${raw.display}`);
   if (typeof raw.entry !== 'string' || raw.entry.trim() === '' || isAbsolute(raw.entry)
     || slash(raw.entry).split('/').includes('..')) {
-    throw structuralError('PL-ADAPTER-DESCRIPTOR-ENTRY', `Descriptor entry must be a non-empty project-relative path with no '..' segments in ${path}`);
+    throw structuralError("", `Descriptor entry must be a non-empty project-relative path with no '..' segments in ${path}`);
   }
   return { version: '1', host: raw.host, invocation: raw.invocation, entry: raw.entry, display: raw.display };

[Killed] ArrayDeclaration
src/scripts/pl-adapter-conformance.mjs:106:22
  * normative rule behavior must live only in the Phase A kernel.
  */
 export function checkAdapterBoundary(paths) {
-  const violations = [];
+  const violations = ["Stryker was here"];
   for (const path of paths) {
     const text = readFileSync(path, 'utf8');
killedBy: checkAdapterBoundary passes on the real descriptors and templates (no embedded rule ids)
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ArrowFunction
src/scripts/pl-adapter-conformance.mjs:109:69
   const violations = [];
   for (const path of paths) {
     const text = readFileSync(path, 'utf8');
-    const matches = new Set([...text.matchAll(RULE_ID_PATTERN)].map((match) => match[0]));
+    const matches = new Set([...text.matchAll(RULE_ID_PATTERN)].map(() => undefined));
     for (const ruleId of matches) {
killedBy: checkAdapterBoundary fails a template planted with an embedded kernel rule id
statusReason: expected 'Adapter-owned file embeds kernel rule…' to contain 'PL-ARCH-FORBIDDEN-IMPORT'

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:118:52
 }
 
 /** Runs one kernel command as a real subprocess and returns a raw (unnormalized) result. */
-function runKernelCommand(command, { root, args }) {
-  const script = KERNEL_COMMANDS[command];
-  const finalArgs = command === 'scenario'
-    ? [...args, '--format', 'json']
-    : [...args, '--root', root, '--format', 'json'];
-  const result = spawnSync(process.execPath, [script, ...finalArgs], { encoding: 'utf8', cwd: root });
-  return { exit_code: result.status, stdout: result.stdout ?? '', stderr: result.stderr ?? '' };
-}
+function runKernelCommand(command, { root, args }) {}
 
 /**
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:120:21
 /** Runs one kernel command as a real subprocess and returns a raw (unnormalized) result. */
 function runKernelCommand(command, { root, args }) {
   const script = KERNEL_COMMANDS[command];
-  const finalArgs = command === 'scenario'
+  const finalArgs = command !== 'scenario'
     ? [...args, '--format', 'json']
     : [...args, '--root', root, '--format', 'json'];
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: expected '' to deeply equal [ { version: '1', …(5) } ]

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:120:21
 /** Runs one kernel command as a real subprocess and returns a raw (unnormalized) result. */
 function runKernelCommand(command, { root, args }) {
   const script = KERNEL_COMMANDS[command];
-  const finalArgs = command === 'scenario'
+  const finalArgs = false
     ? [...args, '--format', 'json']
     : [...args, '--root', root, '--format', 'json'];
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: expected '' to deeply equal [ { version: '1', …(5) } ]

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:121:17
 function runKernelCommand(command, { root, args }) {
   const script = KERNEL_COMMANDS[command];
   const finalArgs = command === 'scenario'
-    ? [...args, '--format', 'json']
+    ? [...args, "", 'json']
     : [...args, '--root', root, '--format', 'json'];
   const result = spawnSync(process.execPath, [script, ...finalArgs], { encoding: 'utf8', cwd: root });
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: expected '' to deeply equal [ { version: '1', …(5) } ]

[Killed] ArrayDeclaration
src/scripts/pl-adapter-conformance.mjs:122:7
   const script = KERNEL_COMMANDS[command];
   const finalArgs = command === 'scenario'
     ? [...args, '--format', 'json']
-    : [...args, '--root', root, '--format', 'json'];
+    : [];
   const result = spawnSync(process.execPath, [script, ...finalArgs], { encoding: 'utf8', cwd: root });
   return { exit_code: result.status, stdout: result.stdout ?? '', stderr: result.stderr ?? '' };
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: expected '' to deeply equal []

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:122:33
   const script = KERNEL_COMMANDS[command];
   const finalArgs = command === 'scenario'
     ? [...args, '--format', 'json']
-    : [...args, '--root', root, '--format', 'json'];
+    : [...args, '--root', root, "", 'json'];
   const result = spawnSync(process.execPath, [script, ...finalArgs], { encoding: 'utf8', cwd: root });
   return { exit_code: result.status, stdout: result.stdout ?? '', stderr: result.stderr ?? '' };
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: expected '' to deeply equal []

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:123:82
   const finalArgs = command === 'scenario'
     ? [...args, '--format', 'json']
     : [...args, '--root', root, '--format', 'json'];
-  const result = spawnSync(process.execPath, [script, ...finalArgs], { encoding: 'utf8', cwd: root });
+  const result = spawnSync(process.execPath, [script, ...finalArgs], { encoding: "", cwd: root });
   return { exit_code: result.status, stdout: result.stdout ?? '', stderr: result.stderr ?? '' };
 }
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: stdout.trim is not a function

[Killed] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:124:46
     ? [...args, '--format', 'json']
     : [...args, '--root', root, '--format', 'json'];
   const result = spawnSync(process.execPath, [script, ...finalArgs], { encoding: 'utf8', cwd: root });
-  return { exit_code: result.status, stdout: result.stdout ?? '', stderr: result.stderr ?? '' };
+  return { exit_code: result.status, stdout: result.stdout && '', stderr: result.stderr ?? '' };
 }
 
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: expected '' to deeply equal []

[Survived] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:124:75
     ? [...args, '--format', 'json']
     : [...args, '--root', root, '--format', 'json'];
   const result = spawnSync(process.execPath, [script, ...finalArgs], { encoding: 'utf8', cwd: root });
-  return { exit_code: result.status, stdout: result.stdout ?? '', stderr: result.stderr ?? '' };
+  return { exit_code: result.status, stdout: result.stdout ?? '', stderr: result.stderr && '' };
 }
 

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:133:93
  * failure) is kept as a normalized string. Diagnostic path fields are
  * slash-normalized so Windows and POSIX runs compare identically.
  */
-export function normalizeObservation({ host, case_id, command, exit_code, stdout, stderr }) {
-  let parsedStdout = stdout;
-  const trimmed = stdout.trim();
-  if (trimmed.startsWith('[') || trimmed.startsWith('{')) {
-    try {
-      const parsed = JSON.parse(trimmed);
-      parsedStdout = Array.isArray(parsed)
-        ? parsed.map((item) => (item && typeof item === 'object' ? { ...item, file: slash(item.file ?? ''), dependency: slash(item.dependency ?? '') } : item))
-        : parsed;
-    } catch {
-      parsedStdout = trimmed;
-    }
-  } else {
-    parsedStdout = trimmed;
-  }
-  return { version: '1', host, case_id, command, exit_code, stdout: parsedStdout, stderr: stderr.trim() };
-}
+export function normalizeObservation({ host, case_id, command, exit_code, stdout, stderr }) {}
 
 /** Installs a host adapter's template into an isolated consumer root; records generated paths. */
killedBy: normalizeObservation parses structured JSON stdout and slash-normalizes diagnostic paths
statusReason: Cannot read properties of undefined (reading 'stdout')

[Killed] MethodExpression
src/scripts/pl-adapter-conformance.mjs:135:19
  */
 export function normalizeObservation({ host, case_id, command, exit_code, stdout, stderr }) {
   let parsedStdout = stdout;
-  const trimmed = stdout.trim();
+  const trimmed = stdout;
   if (trimmed.startsWith('[') || trimmed.startsWith('{')) {
     try {
killedBy: normalizeObservation keeps non-JSON stdout as a trimmed string
statusReason: expected '  ok  \n' to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:136:7
 export function normalizeObservation({ host, case_id, command, exit_code, stdout, stderr }) {
   let parsedStdout = stdout;
   const trimmed = stdout.trim();
-  if (trimmed.startsWith('[') || trimmed.startsWith('{')) {
+  if (false) {
     try {
       const parsed = JSON.parse(trimmed);
killedBy: normalizeObservation parses structured JSON stdout and slash-normalizes diagnostic paths
statusReason: expected undefined to be 'src/a.ts' // Object.is equality

[Killed] MethodExpression
src/scripts/pl-adapter-conformance.mjs:136:7
 export function normalizeObservation({ host, case_id, command, exit_code, stdout, stderr }) {
   let parsedStdout = stdout;
   const trimmed = stdout.trim();
-  if (trimmed.startsWith('[') || trimmed.startsWith('{')) {
+  if (trimmed.endsWith('[') || trimmed.startsWith('{')) {
     try {
       const parsed = JSON.parse(trimmed);
killedBy: normalizeObservation parses structured JSON stdout and slash-normalizes diagnostic paths
statusReason: expected undefined to be 'src/a.ts' // Object.is equality

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:137:9
   let parsedStdout = stdout;
   const trimmed = stdout.trim();
   if (trimmed.startsWith('[') || trimmed.startsWith('{')) {
-    try {
-      const parsed = JSON.parse(trimmed);
-      parsedStdout = Array.isArray(parsed)
-        ? parsed.map((item) => (item && typeof item === 'object' ? { ...item, file: slash(item.file ?? ''), dependency: slash(item.dependency ?? '') } : item))
-        : parsed;
-    } catch {
+    try {} catch {
       parsedStdout = trimmed;
     }
killedBy: normalizeObservation parses structured JSON stdout and slash-normalizes diagnostic paths
statusReason: expected undefined to be 'src/a.ts' // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:140:41
     try {
       const parsed = JSON.parse(trimmed);
       parsedStdout = Array.isArray(parsed)
-        ? parsed.map((item) => (item && typeof item === 'object' ? { ...item, file: slash(item.file ?? ''), dependency: slash(item.dependency ?? '') } : item))
+        ? parsed.map((item) => (item && typeof item !== 'object' ? { ...item, file: slash(item.file ?? ''), dependency: slash(item.dependency ?? '') } : item))
         : parsed;
     } catch {
killedBy: normalizeObservation parses structured JSON stdout and slash-normalizes diagnostic paths
statusReason: expected 'src\a.ts' to be 'src/a.ts' // Object.is equality

[Killed] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:140:127
     try {
       const parsed = JSON.parse(trimmed);
       parsedStdout = Array.isArray(parsed)
-        ? parsed.map((item) => (item && typeof item === 'object' ? { ...item, file: slash(item.file ?? ''), dependency: slash(item.dependency ?? '') } : item))
+        ? parsed.map((item) => (item && typeof item === 'object' ? { ...item, file: slash(item.file ?? ''), dependency: slash(item.dependency && '') } : item))
         : parsed;
     } catch {
killedBy: normalizeObservation parses structured JSON stdout and slash-normalizes diagnostic paths
statusReason: expected '' to be 'src/b.ts' // Object.is equality

[Survived] BlockStatement
src/scripts/pl-adapter-conformance.mjs:142:13
       parsedStdout = Array.isArray(parsed)
         ? parsed.map((item) => (item && typeof item === 'object' ? { ...item, file: slash(item.file ?? ''), dependency: slash(item.dependency ?? '') } : item))
         : parsed;
-    } catch {
-      parsedStdout = trimmed;
-    }
+    } catch {}
   } else {
     parsedStdout = trimmed;

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:145:10
     } catch {
       parsedStdout = trimmed;
     }
-  } else {
-    parsedStdout = trimmed;
-  }
+  } else {}
   return { version: '1', host, case_id, command, exit_code, stdout: parsedStdout, stderr: stderr.trim() };
 }
killedBy: normalizeObservation keeps non-JSON stdout as a trimmed string
statusReason: expected '  ok  \n' to be 'ok' // Object.is equality

[Survived] MethodExpression
src/scripts/pl-adapter-conformance.mjs:148:91
   } else {
     parsedStdout = trimmed;
   }
-  return { version: '1', host, case_id, command, exit_code, stdout: parsedStdout, stderr: stderr.trim() };
+  return { version: '1', host, case_id, command, exit_code, stdout: parsedStdout, stderr: stderr };
 }
 

[Killed] ObjectLiteral
src/scripts/pl-adapter-conformance.mjs:148:10
   } else {
     parsedStdout = trimmed;
   }
-  return { version: '1', host, case_id, command, exit_code, stdout: parsedStdout, stderr: stderr.trim() };
+  return {};
 }
 
killedBy: normalizeObservation parses structured JSON stdout and slash-normalizes diagnostic paths
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:152:73
 }
 
 /** Installs a host adapter's template into an isolated consumer root; records generated paths. */
-export function installAdapter(descriptor, templatesRoot, consumerRoot) {
-  const hostTemplatesRoot = resolve(templatesRoot, descriptor.host);
-  const source = resolve(hostTemplatesRoot, descriptor.entry);
-  const destination = resolve(consumerRoot, descriptor.entry);
-  const root = resolve(consumerRoot);
-  if (!inside(hostTemplatesRoot, source)) {
-    throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the host templates root: ${descriptor.entry}`);
-  }
-  if (!inside(root, destination)) {
-    throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the consumer root: ${descriptor.entry}`);
-  }
-  const createdDirs = [];
-  for (let dir = dirname(destination); inside(root, dir) && dir !== root && !existsSync(dir); dir = dirname(dir)) {
-    createdDirs.push(dir);
-  }
-  mkdirSync(dirname(destination), { recursive: true });
-  cpSync(source, destination);
-  return { generated: [destination], createdDirs: createdDirs.sort((a, b) => b.length - a.length) };
-}
+export function installAdapter(descriptor, templatesRoot, consumerRoot) {}
 
 /** Removes every path an installAdapter() call generated, including directories it created. */
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: Cannot read properties of undefined (reading 'generated')

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:157:7
   const source = resolve(hostTemplatesRoot, descriptor.entry);
   const destination = resolve(consumerRoot, descriptor.entry);
   const root = resolve(consumerRoot);
-  if (!inside(hostTemplatesRoot, source)) {
+  if (inside(hostTemplatesRoot, source)) {
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the host templates root: ${descriptor.entry}`);
   }
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: Descriptor entry escapes the host templates root: .codex/commands/pl-check.md

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:157:7
   const source = resolve(hostTemplatesRoot, descriptor.entry);
   const destination = resolve(consumerRoot, descriptor.entry);
   const root = resolve(consumerRoot);
-  if (!inside(hostTemplatesRoot, source)) {
+  if (false) {
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the host templates root: ${descriptor.entry}`);
   }
killedBy: installAdapter / rollbackAdapter rejects a hand-built descriptor whose entry escapes the host templates root (defense in depth, bypassing loadDescriptor)
statusReason: expected [Function] to throw error matching /escapes the host templates root/ but got 'Descriptor entry escapes the consumer…'

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:158:61
   const destination = resolve(consumerRoot, descriptor.entry);
   const root = resolve(consumerRoot);
   if (!inside(hostTemplatesRoot, source)) {
-    throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the host templates root: ${descriptor.entry}`);
+    throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', ``);
   }
   if (!inside(root, destination)) {
killedBy: installAdapter / rollbackAdapter rejects a hand-built descriptor whose entry escapes the host templates root (defense in depth, bypassing loadDescriptor)
statusReason: expected [Function] to throw error matching /escapes the host templates root/ but got ''

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:160:7
   if (!inside(hostTemplatesRoot, source)) {
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the host templates root: ${descriptor.entry}`);
   }
-  if (!inside(root, destination)) {
+  if (true) {
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the consumer root: ${descriptor.entry}`);
   }
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: Descriptor entry escapes the consumer root: .codex/commands/pl-check.md

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:160:7
   if (!inside(hostTemplatesRoot, source)) {
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the host templates root: ${descriptor.entry}`);
   }
-  if (!inside(root, destination)) {
+  if (inside(root, destination)) {
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the consumer root: ${descriptor.entry}`);
   }
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: Descriptor entry escapes the consumer root: .codex/commands/pl-check.md
