[Killed] ArrayDeclaration
src/scripts/pl-adapter-conformance.mjs:163:23
   if (!inside(root, destination)) {
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the consumer root: ${descriptor.entry}`);
   }
-  const createdDirs = [];
+  const createdDirs = ["Stryker was here"];
   for (let dir = dirname(destination); inside(root, dir) && dir !== root && !existsSync(dir); dir = dirname(dir)) {
     createdDirs.push(dir);
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: expected [ …(3) ] to deeply equal [ …(2) ]

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:164:77
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the consumer root: ${descriptor.entry}`);
   }
   const createdDirs = [];
-  for (let dir = dirname(destination); inside(root, dir) && dir !== root && !existsSync(dir); dir = dirname(dir)) {
+  for (let dir = dirname(destination); inside(root, dir) && dir !== root && existsSync(dir); dir = dirname(dir)) {
     createdDirs.push(dir);
   }
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:164:40
     throw structuralError('PL-ADAPTER-INSTALL-PATH-ESCAPE', `Descriptor entry escapes the consumer root: ${descriptor.entry}`);
   }
   const createdDirs = [];
-  for (let dir = dirname(destination); inside(root, dir) && dir !== root && !existsSync(dir); dir = dirname(dir)) {
+  for (let dir = dirname(destination); inside(root, dir) && dir !== root || !existsSync(dir); dir = dirname(dir)) {
     createdDirs.push(dir);
   }
killedBy: installAdapter / rollbackAdapter does not remove a pre-existing directory during rollback (only removes directories it created)
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:167:48
   for (let dir = dirname(destination); inside(root, dir) && dir !== root && !existsSync(dir); dir = dirname(dir)) {
     createdDirs.push(dir);
   }
-  mkdirSync(dirname(destination), { recursive: true });
+  mkdirSync(dirname(destination), { recursive: false });
   cpSync(source, destination);
   return { generated: [destination], createdDirs: createdDirs.sort((a, b) => b.length - a.length) };
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: ENOENT: no such file or directory, mkdir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-adapter-consumer-NQa0L2/.codex/commands'

[Killed] ObjectLiteral
src/scripts/pl-adapter-conformance.mjs:167:35
   for (let dir = dirname(destination); inside(root, dir) && dir !== root && !existsSync(dir); dir = dirname(dir)) {
     createdDirs.push(dir);
   }
-  mkdirSync(dirname(destination), { recursive: true });
+  mkdirSync(dirname(destination), {});
   cpSync(source, destination);
   return { generated: [destination], createdDirs: createdDirs.sort((a, b) => b.length - a.length) };
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: ENOENT: no such file or directory, mkdir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-adapter-consumer-UzQovo/.codex/commands'

[Survived] ArithmeticOperator
src/scripts/pl-adapter-conformance.mjs:169:78
   }
   mkdirSync(dirname(destination), { recursive: true });
   cpSync(source, destination);
-  return { generated: [destination], createdDirs: createdDirs.sort((a, b) => b.length - a.length) };
+  return { generated: [destination], createdDirs: createdDirs.sort((a, b) => b.length + a.length) };
 }
 

[Survived] ArrowFunction
src/scripts/pl-adapter-conformance.mjs:169:68
   }
   mkdirSync(dirname(destination), { recursive: true });
   cpSync(source, destination);
-  return { generated: [destination], createdDirs: createdDirs.sort((a, b) => b.length - a.length) };
+  return { generated: [destination], createdDirs: createdDirs.sort(() => undefined) };
 }
 

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:173:50
 }
 
 /** Removes every path an installAdapter() call generated, including directories it created. */
-export function rollbackAdapter(installManifest) {
-  for (const path of installManifest.generated) rmSync(path, { force: true });
-  for (const dir of installManifest.createdDirs ?? []) {
-    try { rmdirSync(dir); } catch { /* not empty, or already removed */ }
-  }
-}
+export function rollbackAdapter(installManifest) {}
 
 export function baselineHash(root) {
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: expected [Function] to throw an error

[Survived] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:174:71
 
 /** Removes every path an installAdapter() call generated, including directories it created. */
 export function rollbackAdapter(installManifest) {
-  for (const path of installManifest.generated) rmSync(path, { force: true });
+  for (const path of installManifest.generated) rmSync(path, { force: false });
   for (const dir of installManifest.createdDirs ?? []) {
     try { rmdirSync(dir); } catch { /* not empty, or already removed */ }

[Killed] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:175:21
 /** Removes every path an installAdapter() call generated, including directories it created. */
 export function rollbackAdapter(installManifest) {
   for (const path of installManifest.generated) rmSync(path, { force: true });
-  for (const dir of installManifest.createdDirs ?? []) {
+  for (const dir of installManifest.createdDirs && []) {
     try { rmdirSync(dir); } catch { /* not empty, or already removed */ }
   }
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:175:56
 /** Removes every path an installAdapter() call generated, including directories it created. */
 export function rollbackAdapter(installManifest) {
   for (const path of installManifest.generated) rmSync(path, { force: true });
-  for (const dir of installManifest.createdDirs ?? []) {
-    try { rmdirSync(dir); } catch { /* not empty, or already removed */ }
-  }
+  for (const dir of installManifest.createdDirs ?? []) {}
 }
 
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:176:9
 export function rollbackAdapter(installManifest) {
   for (const path of installManifest.generated) rmSync(path, { force: true });
   for (const dir of installManifest.createdDirs ?? []) {
-    try { rmdirSync(dir); } catch { /* not empty, or already removed */ }
+    try {} catch { /* not empty, or already removed */ }
   }
 }
killedBy: installAdapter / rollbackAdapter installs the descriptor entry into the consumer root and rolls back to baseline
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:180:36
   }
 }
 
-export function baselineHash(root) {
-  if (!existsSync(root)) return '';
-  const entries = [];
-  const walk = (dir) => {
-    for (const name of readdirSync(dir).sort()) {
-      const full = join(dir, name);
-      const stat = statSync(full);
-      entries.push(`${slash(relative(root, full))}:${stat.isDirectory() ? 'dir' : stat.size}`);
-      if (stat.isDirectory()) walk(full);
-    }
-  };
-  walk(root);
-  return entries.join('\n');
-}
+export function baselineHash(root) {}
 
 export function compareObservations(a, b) {
killedBy: baselineHash returns empty string for a root that does not exist
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:181:7
 }
 
 export function baselineHash(root) {
-  if (!existsSync(root)) return '';
+  if (false) return '';
   const entries = [];
   const walk = (dir) => {
killedBy: baselineHash returns empty string for a root that does not exist
statusReason: ENOENT: no such file or directory, scandir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-adapter-nonexistent-root'

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:181:7
 }
 
 export function baselineHash(root) {
-  if (!existsSync(root)) return '';
+  if (existsSync(root)) return '';
   const entries = [];
   const walk = (dir) => {
killedBy: baselineHash returns empty string for a root that does not exist
statusReason: ENOENT: no such file or directory, scandir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-adapter-nonexistent-root'

[Survived] ArrayDeclaration
src/scripts/pl-adapter-conformance.mjs:182:19
 
 export function baselineHash(root) {
   if (!existsSync(root)) return '';
-  const entries = [];
+  const entries = ["Stryker was here"];
   const walk = (dir) => {
     for (const name of readdirSync(dir).sort()) {

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:183:25
 export function baselineHash(root) {
   if (!existsSync(root)) return '';
   const entries = [];
-  const walk = (dir) => {
-    for (const name of readdirSync(dir).sort()) {
-      const full = join(dir, name);
-      const stat = statSync(full);
-      entries.push(`${slash(relative(root, full))}:${stat.isDirectory() ? 'dir' : stat.size}`);
-      if (stat.isDirectory()) walk(full);
-    }
-  };
+  const walk = (dir) => {};
   walk(root);
   return entries.join('\n');
killedBy: baselineHash walks nested directories and includes each file and directory entry
statusReason: expected '' to contain 'a:dir'

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:184:49
   if (!existsSync(root)) return '';
   const entries = [];
   const walk = (dir) => {
-    for (const name of readdirSync(dir).sort()) {
-      const full = join(dir, name);
-      const stat = statSync(full);
-      entries.push(`${slash(relative(root, full))}:${stat.isDirectory() ? 'dir' : stat.size}`);
-      if (stat.isDirectory()) walk(full);
-    }
+    for (const name of readdirSync(dir).sort()) {}
   };
   walk(root);
killedBy: baselineHash walks nested directories and includes each file and directory entry
statusReason: expected '' to contain 'a:dir'

[Survived] MethodExpression
src/scripts/pl-adapter-conformance.mjs:184:24
   if (!existsSync(root)) return '';
   const entries = [];
   const walk = (dir) => {
-    for (const name of readdirSync(dir).sort()) {
+    for (const name of readdirSync(dir)) {
       const full = join(dir, name);
       const stat = statSync(full);

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:188:11
       const full = join(dir, name);
       const stat = statSync(full);
       entries.push(`${slash(relative(root, full))}:${stat.isDirectory() ? 'dir' : stat.size}`);
-      if (stat.isDirectory()) walk(full);
+      if (false) walk(full);
     }
   };
killedBy: baselineHash walks nested directories and includes each file and directory entry
statusReason: expected 'a:dir' to contain 'a/b:dir'

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:188:11
       const full = join(dir, name);
       const stat = statSync(full);
       entries.push(`${slash(relative(root, full))}:${stat.isDirectory() ? 'dir' : stat.size}`);
-      if (stat.isDirectory()) walk(full);
+      if (true) walk(full);
     }
   };
killedBy: baselineHash walks nested directories and includes each file and directory entry
statusReason: ENOTDIR: not a directory, scandir '/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-adapter-hash-E5MboF/a/b/file.txt'

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:195:43
   return entries.join('\n');
 }
 
-export function compareObservations(a, b) {
-  const differences = [];
-  const fields = new Set([...Object.keys(a), ...Object.keys(b)].filter((key) => key !== 'host'));
-  for (const field of fields) {
-    if (JSON.stringify(a[field]) !== JSON.stringify(b[field])) differences.push(field);
-  }
-  return differences;
-}
+export function compareObservations(a, b) {}
 
 /**
killedBy: compareObservations reports no differences for identical observations across hosts
statusReason: expected undefined to deeply equal []

[Killed] ArrayDeclaration
src/scripts/pl-adapter-conformance.mjs:196:23
 }
 
 export function compareObservations(a, b) {
-  const differences = [];
+  const differences = ["Stryker was here"];
   const fields = new Set([...Object.keys(a), ...Object.keys(b)].filter((key) => key !== 'host'));
   for (const field of fields) {
killedBy: compareObservations reports no differences for identical observations across hosts
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:197:81
 
 export function compareObservations(a, b) {
   const differences = [];
-  const fields = new Set([...Object.keys(a), ...Object.keys(b)].filter((key) => key !== 'host'));
+  const fields = new Set([...Object.keys(a), ...Object.keys(b)].filter((key) => false));
   for (const field of fields) {
     if (JSON.stringify(a[field]) !== JSON.stringify(b[field])) differences.push(field);
killedBy: compareObservations detects a mutated exit code between hosts
statusReason: expected [] to deeply equal [ 'exit_code' ]

[Killed] MethodExpression
src/scripts/pl-adapter-conformance.mjs:197:26
 
 export function compareObservations(a, b) {
   const differences = [];
-  const fields = new Set([...Object.keys(a), ...Object.keys(b)].filter((key) => key !== 'host'));
+  const fields = new Set([...Object.keys(a), ...Object.keys(b)]);
   for (const field of fields) {
     if (JSON.stringify(a[field]) !== JSON.stringify(b[field])) differences.push(field);
killedBy: compareObservations reports no differences for identical observations across hosts
statusReason: expected [ 'host' ] to deeply equal []

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:198:31
 export function compareObservations(a, b) {
   const differences = [];
   const fields = new Set([...Object.keys(a), ...Object.keys(b)].filter((key) => key !== 'host'));
-  for (const field of fields) {
-    if (JSON.stringify(a[field]) !== JSON.stringify(b[field])) differences.push(field);
-  }
+  for (const field of fields) {}
   return differences;
 }
killedBy: compareObservations detects a mutated exit code between hosts
statusReason: expected [] to deeply equal [ 'exit_code' ]

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:199:9
   const differences = [];
   const fields = new Set([...Object.keys(a), ...Object.keys(b)].filter((key) => key !== 'host'));
   for (const field of fields) {
-    if (JSON.stringify(a[field]) !== JSON.stringify(b[field])) differences.push(field);
+    if (false) differences.push(field);
   }
   return differences;
killedBy: compareObservations detects a mutated exit code between hosts
statusReason: expected [] to deeply equal [ 'exit_code' ]

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:199:9
   const differences = [];
   const fields = new Set([...Object.keys(a), ...Object.keys(b)].filter((key) => key !== 'host'));
   for (const field of fields) {
-    if (JSON.stringify(a[field]) !== JSON.stringify(b[field])) differences.push(field);
+    if (JSON.stringify(a[field]) === JSON.stringify(b[field])) differences.push(field);
   }
   return differences;
killedBy: compareObservations reports no differences for identical observations across hosts
statusReason: expected [ 'version', 'case_id', …(4) ] to deeply equal []

[Killed] ArrayDeclaration
src/scripts/pl-adapter-conformance.mjs:212:23
  * (structural, exit 2).
  */
 export function runConformance({ manifest, descriptors, templatesRoot, consumerRootFactory }) {
-  const diagnostics = [];
+  const diagnostics = ["Stryker was here"];
   const observations = [];
   let structuralFailure = false;
killedBy: runConformance (full parity suite, in-process) overall exit code matches the worst case across the suite (0/1/2)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:214:27
 export function runConformance({ manifest, descriptors, templatesRoot, consumerRootFactory }) {
   const diagnostics = [];
   const observations = [];
-  let structuralFailure = false;
+  let structuralFailure = true;
 
   const hostSet = new Set(descriptors.map((d) => d.host));
killedBy: runConformance (full parity suite, in-process) overall exit code matches the worst case across the suite (0/1/2)
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArrowFunction
src/scripts/pl-adapter-conformance.mjs:216:43
   const observations = [];
   let structuralFailure = false;
 
-  const hostSet = new Set(descriptors.map((d) => d.host));
+  const hostSet = new Set(descriptors.map(() => undefined));
   if (descriptors.length !== 2 || hostSet.size !== 2) {
     return {
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:217:7
   let structuralFailure = false;
 
   const hostSet = new Set(descriptors.map((d) => d.host));
-  if (descriptors.length !== 2 || hostSet.size !== 2) {
+  if (true) {
     return {
       exitCode: 2,
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: Target cannot be null or undefined.

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:217:35
   let structuralFailure = false;
 
   const hostSet = new Set(descriptors.map((d) => d.host));
-  if (descriptors.length !== 2 || hostSet.size !== 2) {
+  if (descriptors.length !== 2 || hostSet.size === 2) {
     return {
       exitCode: 2,
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:227:43
 
   for (const kase of manifest.cases) {
     const perHostObservations = {};
-    for (const descriptor of descriptors) {
-      const consumerRoot = consumerRootFactory(kase.id, descriptor.host);
-      mkdirSync(consumerRoot, { recursive: true });
-      const before = baselineHash(consumerRoot);
-      let installManifest;
-      try {
-        installManifest = installAdapter(descriptor, templatesRoot, consumerRoot);
-      } catch (error) {
-        structuralFailure = true;
-        diagnostics.push({ version: '1', rule_id: error.rule ?? 'PL-ADAPTER-INSTALL', severity: 'error', file: kase.id, dependency: descriptor.host, message: error.message });
-        continue;
-      }
-      const raw = runKernelCommand(kase.command, { root: kase.fixtureRoot, args: kase.args });
-      const observation = normalizeObservation({ host: descriptor.host, case_id: kase.id, command: kase.command, ...raw });
-      observations.push(observation);
-      perHostObservations[descriptor.host] = observation;
-      rollbackAdapter(installManifest);
-      const after = baselineHash(consumerRoot);
-      if (before !== after) {
-        structuralFailure = true;
-        diagnostics.push({ version: '1', rule_id: 'PL-ADAPTER-ROLLBACK', severity: 'error', file: kase.id, dependency: descriptor.host, message: 'Adapter rollback left residual generated files' });
-      }
-    }
+    for (const descriptor of descriptors) {}
 
     const hosts = Object.keys(perHostObservations);
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: Target cannot be null or undefined.

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:229:44
     const perHostObservations = {};
     for (const descriptor of descriptors) {
       const consumerRoot = consumerRootFactory(kase.id, descriptor.host);
-      mkdirSync(consumerRoot, { recursive: true });
+      mkdirSync(consumerRoot, { recursive: false });
       const before = baselineHash(consumerRoot);
       let installManifest;
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:232:11
       mkdirSync(consumerRoot, { recursive: true });
       const before = baselineHash(consumerRoot);
       let installManifest;
-      try {
-        installManifest = installAdapter(descriptor, templatesRoot, consumerRoot);
-      } catch (error) {
+      try {} catch (error) {
         structuralFailure = true;
         diagnostics.push({ version: '1', rule_id: error.rule ?? 'PL-ADAPTER-INSTALL', severity: 'error', file: kase.id, dependency: descriptor.host, message: error.message });
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: Cannot read properties of undefined (reading 'generated')

[NoCoverage] BlockStatement
src/scripts/pl-adapter-conformance.mjs:234:23
       let installManifest;
       try {
         installManifest = installAdapter(descriptor, templatesRoot, consumerRoot);
-      } catch (error) {
-        structuralFailure = true;
-        diagnostics.push({ version: '1', rule_id: error.rule ?? 'PL-ADAPTER-INSTALL', severity: 'error', file: kase.id, dependency: descriptor.host, message: error.message });
-        continue;
-      }
+      } catch (error) {}
       const raw = runKernelCommand(kase.command, { root: kase.fixtureRoot, args: kase.args });
       const observation = normalizeObservation({ host: descriptor.host, case_id: kase.id, command: kase.command, ...raw });

[NoCoverage] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:235:29
       try {
         installManifest = installAdapter(descriptor, templatesRoot, consumerRoot);
       } catch (error) {
-        structuralFailure = true;
+        structuralFailure = false;
         diagnostics.push({ version: '1', rule_id: error.rule ?? 'PL-ADAPTER-INSTALL', severity: 'error', file: kase.id, dependency: descriptor.host, message: error.message });
         continue;

[NoCoverage] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:236:51
         installManifest = installAdapter(descriptor, templatesRoot, consumerRoot);
       } catch (error) {
         structuralFailure = true;
-        diagnostics.push({ version: '1', rule_id: error.rule ?? 'PL-ADAPTER-INSTALL', severity: 'error', file: kase.id, dependency: descriptor.host, message: error.message });
+        diagnostics.push({ version: '1', rule_id: error.rule && 'PL-ADAPTER-INSTALL', severity: 'error', file: kase.id, dependency: descriptor.host, message: error.message });
         continue;
       }

[NoCoverage] StringLiteral
src/scripts/pl-adapter-conformance.mjs:236:97
         installManifest = installAdapter(descriptor, templatesRoot, consumerRoot);
       } catch (error) {
         structuralFailure = true;
-        diagnostics.push({ version: '1', rule_id: error.rule ?? 'PL-ADAPTER-INSTALL', severity: 'error', file: kase.id, dependency: descriptor.host, message: error.message });
+        diagnostics.push({ version: '1', rule_id: error.rule ?? 'PL-ADAPTER-INSTALL', severity: "", file: kase.id, dependency: descriptor.host, message: error.message });
         continue;
       }

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:245:11
       perHostObservations[descriptor.host] = observation;
       rollbackAdapter(installManifest);
       const after = baselineHash(consumerRoot);
-      if (before !== after) {
+      if (true) {
         structuralFailure = true;
         diagnostics.push({ version: '1', rule_id: 'PL-ADAPTER-ROLLBACK', severity: 'error', file: kase.id, dependency: descriptor.host, message: 'Adapter rollback left residual generated files' });
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: expected [ { version: '1', …(5) }, …(11) ] to deeply equal []

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:245:11
       perHostObservations[descriptor.host] = observation;
       rollbackAdapter(installManifest);
       const after = baselineHash(consumerRoot);
-      if (before !== after) {
+      if (before === after) {
         structuralFailure = true;
         diagnostics.push({ version: '1', rule_id: 'PL-ADAPTER-ROLLBACK', severity: 'error', file: kase.id, dependency: descriptor.host, message: 'Adapter rollback left residual generated files' });
killedBy: runConformance (full parity suite, in-process) runs every fixture case through both hosts with identical normalized results, and cleans up after itself
statusReason: expected [ { version: '1', …(5) }, …(11) ] to deeply equal []

[NoCoverage] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:246:29
       rollbackAdapter(installManifest);
       const after = baselineHash(consumerRoot);
       if (before !== after) {
-        structuralFailure = true;
+        structuralFailure = false;
         diagnostics.push({ version: '1', rule_id: 'PL-ADAPTER-ROLLBACK', severity: 'error', file: kase.id, dependency: descriptor.host, message: 'Adapter rollback left residual generated files' });
       }

[NoCoverage] StringLiteral
src/scripts/pl-adapter-conformance.mjs:247:84
       const after = baselineHash(consumerRoot);
       if (before !== after) {
         structuralFailure = true;
-        diagnostics.push({ version: '1', rule_id: 'PL-ADAPTER-ROLLBACK', severity: 'error', file: kase.id, dependency: descriptor.host, message: 'Adapter rollback left residual generated files' });
+        diagnostics.push({ version: '1', rule_id: 'PL-ADAPTER-ROLLBACK', severity: "", file: kase.id, dependency: descriptor.host, message: 'Adapter rollback left residual generated files' });
       }
     }

[NoCoverage] StringLiteral
src/scripts/pl-adapter-conformance.mjs:247:146
       const after = baselineHash(consumerRoot);
       if (before !== after) {
         structuralFailure = true;
-        diagnostics.push({ version: '1', rule_id: 'PL-ADAPTER-ROLLBACK', severity: 'error', file: kase.id, dependency: descriptor.host, message: 'Adapter rollback left residual generated files' });
+        diagnostics.push({ version: '1', rule_id: 'PL-ADAPTER-ROLLBACK', severity: 'error', file: kase.id, dependency: descriptor.host, message: "" });
       }
     }

[Survived] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:252:9
     }
 
     const hosts = Object.keys(perHostObservations);
-    if (hosts.length === 2) {
+    if (hosts.length !== 2) {
       const [first, second] = hosts;
       const differences = compareObservations(perHostObservations[first], perHostObservations[second]);

[Survived] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:252:9
     }
 
     const hosts = Object.keys(perHostObservations);
-    if (hosts.length === 2) {
+    if (false) {
       const [first, second] = hosts;
       const differences = compareObservations(perHostObservations[first], perHostObservations[second]);

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:265:26
   return { exitCode, observations, diagnostics };
 }
 
-function parseArgs(args) {
-  const options = { manifest: null, descriptors: [], templatesRoot: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
-    const key = args[index];
-    if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
-    else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
-    else throw new Error(`Unknown argument: ${key}`);
-  }
-  if (!options.manifest || options.descriptors.length !== 2 || !options.templatesRoot) {
-    throw new Error('--manifest, exactly two --descriptor, and --templates-root are required');
-  }
-  return options;
-}
+function parseArgs(args) {}
 
 export function isMainModule(moduleUrl, argv1) {
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/scripts/pl-adapter-conformance.mjs:266:19
 }
 
 function parseArgs(args) {
-  const options = { manifest: null, descriptors: [], templatesRoot: null, format: 'text' };
+  const options = {};
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality
