[Survived] StringLiteral
src/scripts/pl-adapter-conformance.mjs:266:83
 }
 
 function parseArgs(args) {
-  const options = { manifest: null, descriptors: [], templatesRoot: null, format: 'text' };
+  const options = { manifest: null, descriptors: [], templatesRoot: null, format: "" };
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:267:56
 
 function parseArgs(args) {
   const options = { manifest: null, descriptors: [], templatesRoot: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
-    const key = args[index];
-    if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
-    else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
-    else throw new Error(`Unknown argument: ${key}`);
-  }
+  for (let index = 0; index < args.length; index += 1) {}
   if (!options.manifest || options.descriptors.length !== 2 || !options.templatesRoot) {
     throw new Error('--manifest, exactly two --descriptor, and --templates-root are required');
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:267:23
 
 function parseArgs(args) {
   const options = { manifest: null, descriptors: [], templatesRoot: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
+  for (let index = 0; index <= args.length; index += 1) {
     const key = args[index];
     if (key === '--manifest') options.manifest = resolve(args[++index]);
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:269:9
   const options = { manifest: null, descriptors: [], templatesRoot: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
-    if (key === '--manifest') options.manifest = resolve(args[++index]);
+    if (key !== '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
     else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:269:9
   const options = { manifest: null, descriptors: [], templatesRoot: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
-    if (key === '--manifest') options.manifest = resolve(args[++index]);
+    if (true) options.manifest = resolve(args[++index]);
     else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
     else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:270:14
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
     if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
+    else if (false) options.descriptors.push(resolve(args[++index]));
     else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:270:14
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
     if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
+    else if (true) options.descriptors.push(resolve(args[++index]));
     else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:271:14
     const key = args[index];
     if (key === '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
-    else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
+    else if (key !== '--templates-root') options.templatesRoot = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:271:14
     const key = args[index];
     if (key === '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
-    else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
+    else if (true) options.templatesRoot = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:272:14
     if (key === '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
     else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
+    else if (key !== '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
   }
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:272:14
     if (key === '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--descriptor') options.descriptors.push(resolve(args[++index]));
     else if (key === '--templates-root') options.templatesRoot = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
+    else if (false) options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
   }
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/scripts/pl-adapter-conformance.mjs:275:7
     else if (key === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
   }
-  if (!options.manifest || options.descriptors.length !== 2 || !options.templatesRoot) {
+  if (options.manifest || options.descriptors.length !== 2 || !options.templatesRoot) {
     throw new Error('--manifest, exactly two --descriptor, and --templates-root are required');
   }
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:275:7
     else if (key === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
   }
-  if (!options.manifest || options.descriptors.length !== 2 || !options.templatesRoot) {
+  if (true) {
     throw new Error('--manifest, exactly two --descriptor, and --templates-root are required');
   }
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:276:21
     else throw new Error(`Unknown argument: ${key}`);
   }
   if (!options.manifest || options.descriptors.length !== 2 || !options.templatesRoot) {
-    throw new Error('--manifest, exactly two --descriptor, and --templates-root are required');
+    throw new Error("");
   }
   return options;
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) rejects missing required arguments (in-process)
statusReason: expected '\n' to contain '--manifest, exactly two --descriptor,…'

[Survived] LogicalOperator
src/scripts/pl-adapter-conformance.mjs:291:41
  * Exported so tests can drive every branch in-process; the isMainModule
  * block below is the only piece that actually writes to the real process.
  */
-export function runCli(argv, { tmpdir = process.env.TMPDIR ?? '/tmp', pid = process.pid } = {}) {
+export function runCli(argv, { tmpdir = process.env.TMPDIR && '/tmp', pid = process.pid } = {}) {
   try {
     const options = parseArgs(argv);

[Killed] ArrowFunction
src/scripts/pl-adapter-conformance.mjs:296:49
     const options = parseArgs(argv);
     const fixtureRoot = resolve(dirname(options.manifest), '..');
     const manifest = loadManifest(options.manifest, { fixtureRoot });
-    const descriptors = options.descriptors.map((path) => loadDescriptor(path));
+    const descriptors = options.descriptors.map(() => undefined);
     const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map((d) => resolve(options.templatesRoot, d.host, d.entry))]);
     if (boundaryViolations.length) {
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArrowFunction
src/scripts/pl-adapter-conformance.mjs:297:97
     const fixtureRoot = resolve(dirname(options.manifest), '..');
     const manifest = loadManifest(options.manifest, { fixtureRoot });
     const descriptors = options.descriptors.map((path) => loadDescriptor(path));
-    const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map((d) => resolve(options.templatesRoot, d.host, d.entry))]);
+    const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map(() => undefined)]);
     if (boundaryViolations.length) {
       const stdout = options.format === 'json' ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:298:36
     const manifest = loadManifest(options.manifest, { fixtureRoot });
     const descriptors = options.descriptors.map((path) => loadDescriptor(path));
     const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map((d) => resolve(options.templatesRoot, d.host, d.entry))]);
-    if (boundaryViolations.length) {
-      const stdout = options.format === 'json' ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
-      return { exitCode: 2, stdout, stderr: '' };
-    }
+    if (boundaryViolations.length) {}
     let seq = 0;
     const result = runConformance({
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 2 and reports a boundary violation as text when format is not json
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:298:9
     const manifest = loadManifest(options.manifest, { fixtureRoot });
     const descriptors = options.descriptors.map((path) => loadDescriptor(path));
     const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map((d) => resolve(options.templatesRoot, d.host, d.entry))]);
-    if (boundaryViolations.length) {
+    if (true) {
       const stdout = options.format === 'json' ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
       return { exitCode: 2, stdout, stderr: '' };
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-adapter-conformance.mjs:299:22
     const descriptors = options.descriptors.map((path) => loadDescriptor(path));
     const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map((d) => resolve(options.templatesRoot, d.host, d.entry))]);
     if (boundaryViolations.length) {
-      const stdout = options.format === 'json' ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
+      const stdout = options.format !== 'json' ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
       return { exitCode: 2, stdout, stderr: '' };
     }
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 2 and reports a boundary violation as text when format is not json
statusReason: expected '[\n  {\n    "version": "1",\n    "rul…' to match /PL-ADAPTER-BOUNDARY .*:/

[Killed] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:299:22
     const descriptors = options.descriptors.map((path) => loadDescriptor(path));
     const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map((d) => resolve(options.templatesRoot, d.host, d.entry))]);
     if (boundaryViolations.length) {
-      const stdout = options.format === 'json' ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
+      const stdout = true ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
       return { exitCode: 2, stdout, stderr: '' };
     }
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 2 and reports a boundary violation as text when format is not json
statusReason: expected '[\n  {\n    "version": "1",\n    "rul…' to match /PL-ADAPTER-BOUNDARY .*:/

[Killed] ObjectLiteral
src/scripts/pl-adapter-conformance.mjs:300:14
     const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map((d) => resolve(options.templatesRoot, d.host, d.entry))]);
     if (boundaryViolations.length) {
       const stdout = options.format === 'json' ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
-      return { exitCode: 2, stdout, stderr: '' };
+      return {};
     }
     let seq = 0;
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 2 and reports a boundary violation as text when format is not json
statusReason: expected undefined to be 2 // Object.is equality

[Survived] StringLiteral
src/scripts/pl-adapter-conformance.mjs:300:45
     const boundaryViolations = checkAdapterBoundary([...options.descriptors, ...descriptors.map((d) => resolve(options.templatesRoot, d.host, d.entry))]);
     if (boundaryViolations.length) {
       const stdout = options.format === 'json' ? `${JSON.stringify(boundaryViolations, null, 2)}\n` : boundaryViolations.map((v) => `${v.rule_id} ${v.file}: ${v.message}`).join('\n') + '\n';
-      return { exitCode: 2, stdout, stderr: '' };
+      return { exitCode: 2, stdout, stderr: "Stryker was here!" };
     }
     let seq = 0;

[Killed] ArrowFunction
src/scripts/pl-adapter-conformance.mjs:307:28
       manifest,
       descriptors,
       templatesRoot: options.templatesRoot,
-      consumerRootFactory: (caseId, host) => join(tmpdir, `pl-adapter-conformance-${pid}-${seq++}-${caseId}-${host}`),
+      consumerRootFactory: () => undefined,
     });
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 2 to be +0 // Object.is equality

[Survived] UpdateOperator
src/scripts/pl-adapter-conformance.mjs:307:92
       manifest,
       descriptors,
       templatesRoot: options.templatesRoot,
-      consumerRootFactory: (caseId, host) => join(tmpdir, `pl-adapter-conformance-${pid}-${seq++}-${caseId}-${host}`),
+      consumerRootFactory: (caseId, host) => join(tmpdir, `pl-adapter-conformance-${pid}-${seq--}-${caseId}-${host}`),
     });

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:310:57
       consumerRootFactory: (caseId, host) => join(tmpdir, `pl-adapter-conformance-${pid}-${seq++}-${caseId}-${host}`),
     });
-    return { exitCode: result.exitCode, stdout, stderr: '' };
+    return { exitCode: result.exitCode, stdout, stderr: "Stryker was here!" };
   } catch (error) {
     return { exitCode: 2, stdout: '', stderr: `${error.message}\n` };
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 0 with empty JSON diagnostics for the full fixture suite
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] BlockStatement
src/scripts/pl-adapter-conformance.mjs:311:19
     });
     return { exitCode: result.exitCode, stdout, stderr: '' };
-  } catch (error) {
-    return { exitCode: 2, stdout: '', stderr: `${error.message}\n` };
-  }
+  } catch (error) {}
 }
 
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 2 via the catch branch when --manifest points at a nonexistent file
statusReason: Cannot read properties of undefined (reading 'exitCode')

[Killed] StringLiteral
src/scripts/pl-adapter-conformance.mjs:312:47
     return { exitCode: result.exitCode, stdout, stderr: '' };
   } catch (error) {
-    return { exitCode: 2, stdout: '', stderr: `${error.message}\n` };
+    return { exitCode: 2, stdout: '', stderr: `` };
   }
 }
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 2 via the catch branch when --manifest points at a nonexistent file
statusReason: expected '' not to be '' // Object.is equality

[Killed] ObjectLiteral
src/scripts/pl-adapter-conformance.mjs:312:12
     return { exitCode: result.exitCode, stdout, stderr: '' };
   } catch (error) {
-    return { exitCode: 2, stdout: '', stderr: `${error.message}\n` };
+    return {};
   }
 }
killedBy: runCli (in-process, exercises every branch Stryker can attribute to this file) exits 2 via the catch branch when --manifest points at a nonexistent file
statusReason: expected undefined to be 2 // Object.is equality

[Survived] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:316:5
   }
 }
 
-if (isMainModule(import.meta.url, process.argv[1])) {
+if (false) {
   const result = runCli(process.argv.slice(2));
   if (result.stdout) process.stdout.write(result.stdout);

[NoCoverage] MethodExpression
src/scripts/pl-adapter-conformance.mjs:317:25
 }
 
 if (isMainModule(import.meta.url, process.argv[1])) {
-  const result = runCli(process.argv.slice(2));
+  const result = runCli(process.argv);
   if (result.stdout) process.stdout.write(result.stdout);
   if (result.stderr) process.stderr.write(result.stderr);

[NoCoverage] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:318:7
 
 if (isMainModule(import.meta.url, process.argv[1])) {
   const result = runCli(process.argv.slice(2));
-  if (result.stdout) process.stdout.write(result.stdout);
+  if (true) process.stdout.write(result.stdout);
   if (result.stderr) process.stderr.write(result.stderr);
   process.exitCode = result.exitCode;

[NoCoverage] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:318:7
 
 if (isMainModule(import.meta.url, process.argv[1])) {
   const result = runCli(process.argv.slice(2));
-  if (result.stdout) process.stdout.write(result.stdout);
+  if (false) process.stdout.write(result.stdout);
   if (result.stderr) process.stderr.write(result.stderr);
   process.exitCode = result.exitCode;

[NoCoverage] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:319:7
 if (isMainModule(import.meta.url, process.argv[1])) {
   const result = runCli(process.argv.slice(2));
   if (result.stdout) process.stdout.write(result.stdout);
-  if (result.stderr) process.stderr.write(result.stderr);
+  if (true) process.stderr.write(result.stderr);
   process.exitCode = result.exitCode;
 }

[NoCoverage] ConditionalExpression
src/scripts/pl-adapter-conformance.mjs:319:7
 if (isMainModule(import.meta.url, process.argv[1])) {
   const result = runCli(process.argv.slice(2));
   if (result.stdout) process.stdout.write(result.stdout);
-  if (result.stderr) process.stderr.write(result.stderr);
+  if (false) process.stderr.write(result.stderr);
   process.exitCode = result.exitCode;
 }
