[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:7:20
 import { basename, resolve } from 'node:path';
 import { pathToFileURL } from 'node:url';
 
-const diagnostic = (rule_id, file, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency: '', message,
-});
+const diagnostic = () => undefined;
 
 function modelFrom(input) {
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: 2, …(3) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:8:36
 import { pathToFileURL } from 'node:url';
 
 const diagnostic = (rule_id, file, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency: '', message,
+  version: '1', rule_id, severity: "", file, dependency: '', message,
 });
 
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: 2, …(3) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:8:12
 import { pathToFileURL } from 'node:url';
 
 const diagnostic = (rule_id, file, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency: '', message,
+  version: "", rule_id, severity: 'error', file, dependency: '', message,
 });
 
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: 2, …(3) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/gen-scenarios.mjs:11:27
   version: '1', rule_id, severity: 'error', file, dependency: '', message,
 });
 
-function modelFrom(input) {
-  return input?.exploration_output ?? input;
-}
+function modelFrom(input) {}
 
 function validate(model, file) {
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/scripts/gen-scenarios.mjs:12:10
 });
 
 function modelFrom(input) {
-  return input?.exploration_output ?? input;
+  return input?.exploration_output && input;
 }
 
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] OptionalChaining
src/scripts/gen-scenarios.mjs:12:10
 });
 
 function modelFrom(input) {
-  return input?.exploration_output ?? input;
+  return input.exploration_output ?? input;
 }
 
killedBy: scenario generation does not throw when the model itself is missing (optional-chained legacy-key lookup)
statusReason: Cannot read properties of null (reading 'exploration_output')

[Killed] ArrayDeclaration
src/scripts/gen-scenarios.mjs:16:19
 }
 
 function validate(model, file) {
-  const invalid = [];
+  const invalid = ["Stryker was here"];
   const legacyKeys = ['domain_events', 'commands', 'aggregates'];
   for (const key of legacyKeys) {
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:17:40
 
 function validate(model, file) {
   const invalid = [];
-  const legacyKeys = ['domain_events', 'commands', 'aggregates'];
+  const legacyKeys = ['domain_events', "", 'aggregates'];
   for (const key of legacyKeys) {
     if (!Array.isArray(model?.[key]) || model[key].length === 0
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:17:23
 
 function validate(model, file) {
   const invalid = [];
-  const legacyKeys = ['domain_events', 'commands', 'aggregates'];
+  const legacyKeys = ["", 'commands', 'aggregates'];
   for (const key of legacyKeys) {
     if (!Array.isArray(model?.[key]) || model[key].length === 0
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/scripts/gen-scenarios.mjs:18:33
 function validate(model, file) {
   const invalid = [];
   const legacyKeys = ['domain_events', 'commands', 'aggregates'];
-  for (const key of legacyKeys) {
-    if (!Array.isArray(model?.[key]) || model[key].length === 0
-      || model[key].some((value) => typeof value !== 'string' || value.trim() === '' || /[\r\n]/.test(value))
-      || new Set(model[key]).size !== model[key].length) {
-      invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `${key} must remain a non-empty array of unique, non-empty single-line strings`));
-    }
-  }
+  for (const key of legacyKeys) {}
   const unknownVersion = Object.keys(model ?? {})
     .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
killedBy: scenario generation does not throw when the model itself is missing (optional-chained legacy-key lookup)
statusReason: expected [ { version: '1', …(5) } ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:19:9
   const invalid = [];
   const legacyKeys = ['domain_events', 'commands', 'aggregates'];
   for (const key of legacyKeys) {
-    if (!Array.isArray(model?.[key]) || model[key].length === 0
-      || model[key].some((value) => typeof value !== 'string' || value.trim() === '' || /[\r\n]/.test(value))
-      || new Set(model[key]).size !== model[key].length) {
+    if (false) {
       invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `${key} must remain a non-empty array of unique, non-empty single-line strings`));
     }
killedBy: scenario generation does not throw when the model itself is missing (optional-chained legacy-key lookup)
statusReason: expected [ { version: '1', …(5) } ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:19:9
   const invalid = [];
   const legacyKeys = ['domain_events', 'commands', 'aggregates'];
   for (const key of legacyKeys) {
-    if (!Array.isArray(model?.[key]) || model[key].length === 0
-      || model[key].some((value) => typeof value !== 'string' || value.trim() === '' || /[\r\n]/.test(value))
+    if (false
       || new Set(model[key]).size !== model[key].length) {
       invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `${key} must remain a non-empty array of unique, non-empty single-line strings`));
killedBy: scenario generation does not throw when the model itself is missing (optional-chained legacy-key lookup)
statusReason: Cannot read properties of null (reading 'domain_events')

[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:20:66
   const legacyKeys = ['domain_events', 'commands', 'aggregates'];
   for (const key of legacyKeys) {
     if (!Array.isArray(model?.[key]) || model[key].length === 0
-      || model[key].some((value) => typeof value !== 'string' || value.trim() === '' || /[\r\n]/.test(value))
+      || model[key].some((value) => typeof value !== 'string' || value.trim() !== '' || /[\r\n]/.test(value))
       || new Set(model[key]).size !== model[key].length) {
       invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `${key} must remain a non-empty array of unique, non-empty single-line strings`));
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/scripts/gen-scenarios.mjs:20:37
   const legacyKeys = ['domain_events', 'commands', 'aggregates'];
   for (const key of legacyKeys) {
     if (!Array.isArray(model?.[key]) || model[key].length === 0
-      || model[key].some((value) => typeof value !== 'string' || value.trim() === '' || /[\r\n]/.test(value))
+      || model[key].some((value) => (typeof value !== 'string' || value.trim() === '') && /[\r\n]/.test(value))
       || new Set(model[key]).size !== model[key].length) {
       invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `${key} must remain a non-empty array of unique, non-empty single-line strings`));
killedBy: scenario generation flags domain_events individually for each invalid shape
statusReason: expected [ { version: '1', …(5) } ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:21:10
   for (const key of legacyKeys) {
     if (!Array.isArray(model?.[key]) || model[key].length === 0
       || model[key].some((value) => typeof value !== 'string' || value.trim() === '' || /[\r\n]/.test(value))
-      || new Set(model[key]).size !== model[key].length) {
+      || false) {
       invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `${key} must remain a non-empty array of unique, non-empty single-line strings`));
     }
killedBy: scenario generation flags domain_events individually for each invalid shape
statusReason: expected [ { version: '1', …(5) } ] to deep equally contain ObjectContaining{…}

[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:21:10
   for (const key of legacyKeys) {
     if (!Array.isArray(model?.[key]) || model[key].length === 0
       || model[key].some((value) => typeof value !== 'string' || value.trim() === '' || /[\r\n]/.test(value))
-      || new Set(model[key]).size !== model[key].length) {
+      || new Set(model[key]).size === model[key].length) {
       invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `${key} must remain a non-empty array of unique, non-empty single-line strings`));
     }
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/scripts/gen-scenarios.mjs:25:38
       invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `${key} must remain a non-empty array of unique, non-empty single-line strings`));
     }
   }
-  const unknownVersion = Object.keys(model ?? {})
+  const unknownVersion = Object.keys(model && {})
     .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
   if (unknownVersion) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
killedBy: scenario generation rejects missing ownership, unknown versions, and non-exact references
statusReason: expected { exitCode: +0, diagnostics: [], …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:26:62
     }
   }
   const unknownVersion = Object.keys(model ?? {})
-    .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
+    .find((key) => /^ownership_relations_v\d+$/.test(key) && key === 'ownership_relations_v1');
   if (unknownVersion) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
   if (!Array.isArray(model?.ownership_relations_v1)) {
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:26:20
     }
   }
   const unknownVersion = Object.keys(model ?? {})
-    .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
+    .find((key) => false);
   if (unknownVersion) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
   if (!Array.isArray(model?.ownership_relations_v1)) {
killedBy: scenario generation rejects missing ownership, unknown versions, and non-exact references
statusReason: expected { exitCode: +0, diagnostics: [], …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:27:7
   }
   const unknownVersion = Object.keys(model ?? {})
     .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
-  if (unknownVersion) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
+  if (false) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
   if (!Array.isArray(model?.ownership_relations_v1)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, 'ownership_relations_v1 must be an array'));
killedBy: scenario generation rejects missing ownership, unknown versions, and non-exact references
statusReason: expected { exitCode: +0, diagnostics: [], …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:27:7
   }
   const unknownVersion = Object.keys(model ?? {})
     .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
-  if (unknownVersion) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
+  if (true) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
   if (!Array.isArray(model?.ownership_relations_v1)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, 'ownership_relations_v1 must be an array'));
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:28:7
   const unknownVersion = Object.keys(model ?? {})
     .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
   if (unknownVersion) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
-  if (!Array.isArray(model?.ownership_relations_v1)) {
+  if (false) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, 'ownership_relations_v1 must be an array'));
   }
killedBy: scenario generation requires ownership_relations_v1 to be an array even when other keys are valid
statusReason: model.ownership_relations_v1 is not iterable

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:28:7
   const unknownVersion = Object.keys(model ?? {})
     .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
   if (unknownVersion) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
-  if (!Array.isArray(model?.ownership_relations_v1)) {
+  if (Array.isArray(model?.ownership_relations_v1)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, 'ownership_relations_v1 must be an array'));
   }
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Survived] StringLiteral
src/scripts/gen-scenarios.mjs:29:29
     .find((key) => /^ownership_relations_v\d+$/.test(key) && key !== 'ownership_relations_v1');
   if (unknownVersion) invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, `Unsupported ownership relation version: ${unknownVersion}`));
   if (!Array.isArray(model?.ownership_relations_v1)) {
-    invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, 'ownership_relations_v1 must be an array'));
+    invalid.push(diagnostic("", file, 'ownership_relations_v1 must be an array'));
   }
   if (invalid.length) return invalid;

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:31:7
   if (!Array.isArray(model?.ownership_relations_v1)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, 'ownership_relations_v1 must be an array'));
   }
-  if (invalid.length) return invalid;
+  if (true) return invalid;
 
   const commands = new Set(model.commands);
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: +0, diagnostics: [], …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:31:7
   if (!Array.isArray(model?.ownership_relations_v1)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file, 'ownership_relations_v1 must be an array'));
   }
-  if (invalid.length) return invalid;
+  if (false) return invalid;
 
   const commands = new Set(model.commands);
killedBy: scenario generation does not throw when the model itself is missing (optional-chained legacy-key lookup)
statusReason: Cannot read properties of null (reading 'commands')

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:36:52
   const commands = new Set(model.commands);
   const events = new Set(model.domain_events);
   const aggregates = new Set(model.aggregates);
-  const commandCounts = new Map(model.commands.map((value) => [value, 0]));
+  const commandCounts = new Map(model.commands.map(() => undefined));
   const eventCounts = new Map(model.domain_events.map((value) => [value, 0]));
   let exactReferences = true;
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: Iterator value undefined is not an entry object

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:37:55
   const events = new Set(model.domain_events);
   const aggregates = new Set(model.aggregates);
   const commandCounts = new Map(model.commands.map((value) => [value, 0]));
-  const eventCounts = new Map(model.domain_events.map((value) => [value, 0]));
+  const eventCounts = new Map(model.domain_events.map(() => undefined));
   let exactReferences = true;
   for (const relation of model.ownership_relations_v1) {
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/scripts/gen-scenarios.mjs:37:66
   const events = new Set(model.domain_events);
   const aggregates = new Set(model.aggregates);
   const commandCounts = new Map(model.commands.map((value) => [value, 0]));
-  const eventCounts = new Map(model.domain_events.map((value) => [value, 0]));
+  const eventCounts = new Map(model.domain_events.map((value) => []));
   let exactReferences = true;
   for (const relation of model.ownership_relations_v1) {
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:38:25
   const aggregates = new Set(model.aggregates);
   const commandCounts = new Map(model.commands.map((value) => [value, 0]));
   const eventCounts = new Map(model.domain_events.map((value) => [value, 0]));
-  let exactReferences = true;
+  let exactReferences = false;
   for (const relation of model.ownership_relations_v1) {
     if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/scripts/gen-scenarios.mjs:39:56
   const commandCounts = new Map(model.commands.map((value) => [value, 0]));
   const eventCounts = new Map(model.domain_events.map((value) => [value, 0]));
   let exactReferences = true;
-  for (const relation of model.ownership_relations_v1) {
-    if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
-      || typeof relation.event !== 'string' || !commands.has(relation.command)
-      || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
-      exactReferences = false;
-      continue;
-    }
-    commandCounts.set(relation.command, commandCounts.get(relation.command) + 1);
-    eventCounts.set(relation.event, eventCounts.get(relation.event) + 1);
-  }
+  for (const relation of model.ownership_relations_v1) {}
   if (!exactReferences || [...commandCounts.values(), ...eventCounts.values()].some((count) => count !== 1)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file,
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/scripts/gen-scenarios.mjs:40:9
   const eventCounts = new Map(model.domain_events.map((value) => [value, 0]));
   let exactReferences = true;
   for (const relation of model.ownership_relations_v1) {
-    if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
-      || typeof relation.event !== 'string' || !commands.has(relation.command)
+    if ((!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string') && typeof relation.event !== 'string' || !commands.has(relation.command)
       || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
       exactReferences = false;
killedBy: scenario generation flags a relation object with the wrong field types or an unknown command/event/aggregate reference
statusReason: Cannot read properties of null (reading 'event')

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:40:9
   const eventCounts = new Map(model.domain_events.map((value) => [value, 0]));
   let exactReferences = true;
   for (const relation of model.ownership_relations_v1) {
-    if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
-      || typeof relation.event !== 'string' || !commands.has(relation.command)
-      || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
+    if (false) {
       exactReferences = false;
       continue;
killedBy: scenario generation rejects missing ownership, unknown versions, and non-exact references
statusReason: expected { exitCode: +0, diagnostics: [], …(2) } to match object { exitCode: 2 }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:41:10
   let exactReferences = true;
   for (const relation of model.ownership_relations_v1) {
     if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
-      || typeof relation.event !== 'string' || !commands.has(relation.command)
+      || typeof relation.event === 'string' || !commands.has(relation.command)
       || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
       exactReferences = false;
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:41:48
   let exactReferences = true;
   for (const relation of model.ownership_relations_v1) {
     if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
-      || typeof relation.event !== 'string' || !commands.has(relation.command)
+      || typeof relation.event !== 'string' || commands.has(relation.command)
       || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
       exactReferences = false;
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:42:41
   for (const relation of model.ownership_relations_v1) {
     if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
       || typeof relation.event !== 'string' || !commands.has(relation.command)
-      || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
+      || !events.has(relation.event) || aggregates.has(relation.aggregate)) {
       exactReferences = false;
       continue;
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:42:10
   for (const relation of model.ownership_relations_v1) {
     if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
       || typeof relation.event !== 'string' || !commands.has(relation.command)
-      || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
+      || events.has(relation.event) || !aggregates.has(relation.aggregate)) {
       exactReferences = false;
       continue;
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Survived] BooleanLiteral
src/scripts/gen-scenarios.mjs:43:25
     if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
       || typeof relation.event !== 'string' || !commands.has(relation.command)
       || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
-      exactReferences = false;
+      exactReferences = true;
       continue;
     }

[Killed] ArithmeticOperator
src/scripts/gen-scenarios.mjs:46:41
       exactReferences = false;
       continue;
     }
-    commandCounts.set(relation.command, commandCounts.get(relation.command) + 1);
+    commandCounts.set(relation.command, commandCounts.get(relation.command) - 1);
     eventCounts.set(relation.event, eventCounts.get(relation.event) + 1);
   }
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/scripts/gen-scenarios.mjs:47:37
       continue;
     }
     commandCounts.set(relation.command, commandCounts.get(relation.command) + 1);
-    eventCounts.set(relation.event, eventCounts.get(relation.event) + 1);
+    eventCounts.set(relation.event, eventCounts.get(relation.event) - 1);
   }
   if (!exactReferences || [...commandCounts.values(), ...eventCounts.values()].some((count) => count !== 1)) {
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:49:96
     commandCounts.set(relation.command, commandCounts.get(relation.command) + 1);
     eventCounts.set(relation.event, eventCounts.get(relation.event) + 1);
   }
-  if (!exactReferences || [...commandCounts.values(), ...eventCounts.values()].some((count) => count !== 1)) {
+  if (!exactReferences || [...commandCounts.values(), ...eventCounts.values()].some((count) => false)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file,
       'Each command and event must have exactly one ownership relation'));
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: +0, diagnostics: [], …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:49:7
     commandCounts.set(relation.command, commandCounts.get(relation.command) + 1);
     eventCounts.set(relation.event, eventCounts.get(relation.event) + 1);
   }
-  if (!exactReferences || [...commandCounts.values(), ...eventCounts.values()].some((count) => count !== 1)) {
+  if (exactReferences || [...commandCounts.values(), ...eventCounts.values()].some((count) => count !== 1)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file,
       'Each command and event must have exactly one ownership relation'));
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:50:29
     eventCounts.set(relation.event, eventCounts.get(relation.event) + 1);
   }
   if (!exactReferences || [...commandCounts.values(), ...eventCounts.values()].some((count) => count !== 1)) {
-    invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file,
+    invalid.push(diagnostic("", file,
       'Each command and event must have exactly one ownership relation'));
   }
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: 2, …(3) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:51:7
   }
   if (!exactReferences || [...commandCounts.values(), ...eventCounts.values()].some((count) => count !== 1)) {
     invalid.push(diagnostic('PL-SCENARIO-OWNERSHIP', file,
-      'Each command and event must have exactly one ownership relation'));
+      ""));
   }
   return invalid;
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: 2, …(3) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)
