[Killed] BlockStatement
src/scripts/gen-scenarios.mjs:56:77
   return invalid;
 }
 
-export function compileScenarios(input, { file = 'exploration.json' } = {}) {
-  const model = modelFrom(input);
-  const diagnostics = validate(model, file);
-  if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: false };
-  const output = model.ownership_relations_v1.map(({ command, aggregate, event }) => [
-    `#### Scenario: ${command} on ${aggregate}`,
-    '- **GIVEN** <FILL: precondition>',
-    `- **WHEN** ${command}`,
-    `- **THEN** <FILL: assert ${event}>`,
-  ].join('\n')).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : '');
-  return { exitCode: 0, diagnostics: [], output, coverageChecked: false };
-}
+export function compileScenarios(input, { file = 'exploration.json' } = {}) {}
 
 export function checkEventCoverage(input, scenarioText, { file = 'exploration.json' } = {}) {
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: Cannot read properties of undefined (reading 'exitCode')

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:56:50
   return invalid;
 }
 
-export function compileScenarios(input, { file = 'exploration.json' } = {}) {
+export function compileScenarios(input, { file = "" } = {}) {
   const model = modelFrom(input);
   const diagnostics = validate(model, file);
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: 2, …(3) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:59:7
 export function compileScenarios(input, { file = 'exploration.json' } = {}) {
   const model = modelFrom(input);
   const diagnostics = validate(model, file);
-  if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: false };
+  if (true) return { exitCode: 2, diagnostics, output: '', coverageChecked: false };
   const output = model.ownership_relations_v1.map(({ command, aggregate, event }) => [
     `#### Scenario: ${command} on ${aggregate}`,
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:59:7
 export function compileScenarios(input, { file = 'exploration.json' } = {}) {
   const model = modelFrom(input);
   const diagnostics = validate(model, file);
-  if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: false };
+  if (false) return { exitCode: 2, diagnostics, output: '', coverageChecked: false };
   const output = model.ownership_relations_v1.map(({ command, aggregate, event }) => [
     `#### Scenario: ${command} on ${aggregate}`,
killedBy: scenario generation matches the duplicate-ownership golden diagnostic
statusReason: expected { exitCode: +0, diagnostics: [], …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:60:51
   const model = modelFrom(input);
   const diagnostics = validate(model, file);
   if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: false };
-  const output = model.ownership_relations_v1.map(({ command, aggregate, event }) => [
-    `#### Scenario: ${command} on ${aggregate}`,
-    '- **GIVEN** <FILL: precondition>',
-    `- **WHEN** ${command}`,
-    `- **THEN** <FILL: assert ${event}>`,
-  ].join('\n')).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : '');
+  const output = model.ownership_relations_v1.map(() => undefined).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : '');
   return { exitCode: 0, diagnostics: [], output, coverageChecked: false };
 }
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: Target cannot be null or undefined.

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:61:5
   const diagnostics = validate(model, file);
   if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: false };
   const output = model.ownership_relations_v1.map(({ command, aggregate, event }) => [
-    `#### Scenario: ${command} on ${aggregate}`,
+    ``,
     '- **GIVEN** <FILL: precondition>',
     `- **WHEN** ${command}`,
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: Target cannot be null or undefined.

[Survived] StringLiteral
src/scripts/gen-scenarios.mjs:64:5
     `#### Scenario: ${command} on ${aggregate}`,
     '- **GIVEN** <FILL: precondition>',
     `- **WHEN** ${command}`,
-    `- **THEN** <FILL: assert ${event}>`,
+    ``,
   ].join('\n')).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : '');
   return { exitCode: 0, diagnostics: [], output, coverageChecked: false };

[Killed] StringLiteral
src/scripts/gen-scenarios.mjs:65:22
     '- **GIVEN** <FILL: precondition>',
     `- **WHEN** ${command}`,
     `- **THEN** <FILL: assert ${event}>`,
-  ].join('\n')).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : '');
+  ].join('\n')).join("") + (model.ownership_relations_v1.length ? '\n' : '');
   return { exitCode: 0, diagnostics: [], output, coverageChecked: false };
 }
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected [ '#### Scenario:' ] to have a length of 10 but got 1

[NoCoverage] StringLiteral
src/scripts/gen-scenarios.mjs:65:78
     '- **GIVEN** <FILL: precondition>',
     `- **WHEN** ${command}`,
     `- **THEN** <FILL: assert ${event}>`,
-  ].join('\n')).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : '');
+  ].join('\n')).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : "Stryker was here!");
   return { exitCode: 0, diagnostics: [], output, coverageChecked: false };
 }

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:66:67
     `- **WHEN** ${command}`,
     `- **THEN** <FILL: assert ${event}>`,
   ].join('\n')).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : '');
-  return { exitCode: 0, diagnostics: [], output, coverageChecked: false };
+  return { exitCode: 0, diagnostics: [], output, coverageChecked: true };
 }
 
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/scripts/gen-scenarios.mjs:66:10
     `- **WHEN** ${command}`,
     `- **THEN** <FILL: assert ${event}>`,
   ].join('\n')).join('\n\n') + (model.ownership_relations_v1.length ? '\n' : '');
-  return { exitCode: 0, diagnostics: [], output, coverageChecked: false };
+  return {};
 }
 
killedBy: scenario generation emits ten deterministic skeletons without mutating legacy arrays
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/scripts/gen-scenarios.mjs:69:93
   return { exitCode: 0, diagnostics: [], output, coverageChecked: false };
 }
 
-export function checkEventCoverage(input, scenarioText, { file = 'exploration.json' } = {}) {
-  const model = modelFrom(input);
-  const diagnostics = validate(model, file);
-  if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
-  const thenClauses = scenarioText.split(/\r?\n/)
-    .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
-    .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
-    .filter((line) => !line.includes('<FILL:'));
-  const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
-  const violations = missing.map((event) => diagnostic('PL-SCENARIO-MISSING-EVENT', file,
-    `Domain event ${event} appears in no completed scenario THEN clause`));
-  return { exitCode: violations.length ? 1 : 0, diagnostics: violations, output: '', coverageChecked: true };
-}
+export function checkEventCoverage(input, scenarioText, { file = 'exploration.json' } = {}) {}
 
 function parseArgs(args) {
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected undefined to match object { exitCode: 1, …(2) }

[Survived] StringLiteral
src/scripts/gen-scenarios.mjs:69:66
   return { exitCode: 0, diagnostics: [], output, coverageChecked: false };
 }
 
-export function checkEventCoverage(input, scenarioText, { file = 'exploration.json' } = {}) {
+export function checkEventCoverage(input, scenarioText, { file = "" } = {}) {
   const model = modelFrom(input);
   const diagnostics = validate(model, file);

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:72:91
 export function checkEventCoverage(input, scenarioText, { file = 'exploration.json' } = {}) {
   const model = modelFrom(input);
   const diagnostics = validate(model, file);
-  if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
+  if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: false };
   const thenClauses = scenarioText.split(/\r?\n/)
     .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
killedBy: completed scenario coverage returns diagnostics unchecked when the model itself is invalid
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:72:7
 export function checkEventCoverage(input, scenarioText, { file = 'exploration.json' } = {}) {
   const model = modelFrom(input);
   const diagnostics = validate(model, file);
-  if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
+  if (true) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
   const thenClauses = scenarioText.split(/\r?\n/)
     .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected { exitCode: 2, diagnostics: [], …(2) } to match object { exitCode: 1, …(2) }
(1 matching property omitted from actual)

[Survived] MethodExpression
src/scripts/gen-scenarios.mjs:73:23
   const model = modelFrom(input);
   const diagnostics = validate(model, file);
   if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
-  const thenClauses = scenarioText.split(/\r?\n/)
-    .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
-    .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
-    .filter((line) => !line.includes('<FILL:'));
+  const thenClauses = scenarioText.split(/\r?\n/).filter(line => /^\s*-\s+\*\*THEN\*\*/.test(line)).map(line => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim());
   const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
   const violations = missing.map((event) => diagnostic('PL-SCENARIO-MISSING-EVENT', file,

[Survived] MethodExpression
src/scripts/gen-scenarios.mjs:73:23
   const model = modelFrom(input);
   const diagnostics = validate(model, file);
   if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
-  const thenClauses = scenarioText.split(/\r?\n/)
-    .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
+  const thenClauses = scenarioText.split(/\r?\n/)
     .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
     .filter((line) => !line.includes('<FILL:'));

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:74:13
   const diagnostics = validate(model, file);
   if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
   const thenClauses = scenarioText.split(/\r?\n/)
-    .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
+    .filter(() => undefined)
     .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
     .filter((line) => !line.includes('<FILL:'));
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected { exitCode: 1, …(3) } to match object { exitCode: 1, …(2) }
(1 matching property omitted from actual)

[Killed] Regex
src/scripts/gen-scenarios.mjs:74:23
   const diagnostics = validate(model, file);
   if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
   const thenClauses = scenarioText.split(/\r?\n/)
-    .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
+    .filter((line) => /^\s*-\s\*\*THEN\*\*/.test(line))
     .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
     .filter((line) => !line.includes('<FILL:'));
killedBy: completed scenario coverage recognizes a THEN clause with more than one space after the dash
statusReason: expected { exitCode: 1, …(3) } to deeply equal { exitCode: +0, diagnostics: [], …(2) }

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:75:10
   if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
   const thenClauses = scenarioText.split(/\r?\n/)
     .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
-    .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
+    .map(() => undefined)
     .filter((line) => !line.includes('<FILL:'));
   const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: Cannot read properties of undefined (reading 'includes')

[Survived] MethodExpression
src/scripts/gen-scenarios.mjs:75:20
   if (diagnostics.length) return { exitCode: 2, diagnostics, output: '', coverageChecked: true };
   const thenClauses = scenarioText.split(/\r?\n/)
     .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
-    .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
+    .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, ''))
     .filter((line) => !line.includes('<FILL:'));
   const missing = model.domain_events.filter((event) => !thenClauses.includes(event));

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:76:13
   const thenClauses = scenarioText.split(/\r?\n/)
     .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
     .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
-    .filter((line) => !line.includes('<FILL:'));
+    .filter(() => undefined);
   const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
   const violations = missing.map((event) => diagnostic('PL-SCENARIO-MISSING-EVENT', file,
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected { exitCode: 1, …(3) } to match object { exitCode: 1, …(2) }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:76:23
   const thenClauses = scenarioText.split(/\r?\n/)
     .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
     .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
-    .filter((line) => !line.includes('<FILL:'));
+    .filter((line) => line.includes('<FILL:'));
   const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
   const violations = missing.map((event) => diagnostic('PL-SCENARIO-MISSING-EVENT', file,
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected { exitCode: 1, …(3) } to match object { exitCode: 1, …(2) }
(1 matching property omitted from actual)

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:77:46
     .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
     .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
     .filter((line) => !line.includes('<FILL:'));
-  const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
+  const missing = model.domain_events.filter(() => undefined);
   const violations = missing.map((event) => diagnostic('PL-SCENARIO-MISSING-EVENT', file,
     `Domain event ${event} appears in no completed scenario THEN clause`));
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected { exitCode: +0, diagnostics: [], …(2) } to match object { exitCode: 1, …(2) }
(1 matching property omitted from actual)

[Killed] MethodExpression
src/scripts/gen-scenarios.mjs:77:19
     .filter((line) => /^\s*-\s+\*\*THEN\*\*/.test(line))
     .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
     .filter((line) => !line.includes('<FILL:'));
-  const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
+  const missing = model.domain_events;
   const violations = missing.map((event) => diagnostic('PL-SCENARIO-MISSING-EVENT', file,
     `Domain event ${event} appears in no completed scenario THEN clause`));
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected { exitCode: 1, …(3) } to match object { exitCode: 1, …(2) }
(1 matching property omitted from actual)

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:78:34
     .map((line) => line.replace(/^\s*-\s+\*\*THEN\*\*\s*/, '').trim())
     .filter((line) => !line.includes('<FILL:'));
   const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
-  const violations = missing.map((event) => diagnostic('PL-SCENARIO-MISSING-EVENT', file,
-    `Domain event ${event} appears in no completed scenario THEN clause`));
+  const violations = missing.map(() => undefined);
   return { exitCode: violations.length ? 1 : 0, diagnostics: violations, output: '', coverageChecked: true };
 }
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected { exitCode: 1, …(3) } to match object { exitCode: 1, …(2) }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:80:103
   const missing = model.domain_events.filter((event) => !thenClauses.includes(event));
   const violations = missing.map((event) => diagnostic('PL-SCENARIO-MISSING-EVENT', file,
     `Domain event ${event} appears in no completed scenario THEN clause`));
-  return { exitCode: violations.length ? 1 : 0, diagnostics: violations, output: '', coverageChecked: true };
+  return { exitCode: violations.length ? 1 : 0, diagnostics: violations, output: '', coverageChecked: false };
 }
 
killedBy: completed scenario coverage reports each event missing from completed THEN clauses
statusReason: expected { exitCode: 1, …(3) } to match object { exitCode: 1, …(2) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/scripts/gen-scenarios.mjs:83:26
   return { exitCode: violations.length ? 1 : 0, diagnostics: violations, output: '', coverageChecked: true };
 }
 
-function parseArgs(args) {
-  const options = { input: null, scenarios: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
-    if (args[index] === '--input') options.input = resolve(args[++index]);
-    else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
-    else if (args[index] === '--format') options.format = args[++index];
-    else throw new Error(`Unknown argument: ${args[index]}`);
-  }
-  if (!options.input) throw new Error('--input is required');
-  return options;
-}
+function parseArgs(args) {}
 
 if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:85:23
 
 function parseArgs(args) {
   const options = { input: null, scenarios: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
+  for (let index = 0; index >= args.length; index += 1) {
     if (args[index] === '--input') options.input = resolve(args[++index]);
     else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:85:23
 
 function parseArgs(args) {
   const options = { input: null, scenarios: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
+  for (let index = 0; false; index += 1) {
     if (args[index] === '--input') options.input = resolve(args[++index]);
     else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected 2 to be +0 // Object.is equality

[Killed] UpdateOperator
src/scripts/gen-scenarios.mjs:86:65
 function parseArgs(args) {
   const options = { input: null, scenarios: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
-    if (args[index] === '--input') options.input = resolve(args[++index]);
+    if (args[index] === '--input') options.input = resolve(args[--index]);
     else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
     else if (args[index] === '--format') options.format = args[++index];
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:86:9
 function parseArgs(args) {
   const options = { input: null, scenarios: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
-    if (args[index] === '--input') options.input = resolve(args[++index]);
+    if (false) options.input = resolve(args[++index]);
     else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
     else if (args[index] === '--format') options.format = args[++index];
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:87:14
   const options = { input: null, scenarios: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--input') options.input = resolve(args[++index]);
-    else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
+    else if (args[index] !== '--scenarios') options.scenarios = resolve(args[++index]);
     else if (args[index] === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
killedBy: gen-scenarios CLI entrypoint guard (in-process) parses --input, --scenarios, and --format together and reports missing-event JSON diagnostics
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:87:14
   const options = { input: null, scenarios: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--input') options.input = resolve(args[++index]);
-    else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
+    else if (false) options.scenarios = resolve(args[++index]);
     else if (args[index] === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
killedBy: gen-scenarios CLI entrypoint guard (in-process) parses --input, --scenarios, and --format together and reports missing-event JSON diagnostics
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:88:14
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--input') options.input = resolve(args[++index]);
     else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
-    else if (args[index] === '--format') options.format = args[++index];
+    else if (false) options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
   }
killedBy: gen-scenarios CLI entrypoint guard (in-process) parses --input, --scenarios, and --format together and reports missing-event JSON diagnostics
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:88:14
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--input') options.input = resolve(args[++index]);
     else if (args[index] === '--scenarios') options.scenarios = resolve(args[++index]);
-    else if (args[index] === '--format') options.format = args[++index];
+    else if (args[index] !== '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
   }
killedBy: gen-scenarios CLI entrypoint guard (in-process) parses --input, --scenarios, and --format together and reports missing-event JSON diagnostics
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/scripts/gen-scenarios.mjs:91:7
     else if (args[index] === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
   }
-  if (!options.input) throw new Error('--input is required');
+  if (options.input) throw new Error('--input is required');
   return options;
 }
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:91:7
     else if (args[index] === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
   }
-  if (!options.input) throw new Error('--input is required');
+  if (true) throw new Error('--input is required');
   return options;
 }
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:95:5
   return options;
 }
 
-if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
+if (false) {
   try {
     const options = parseArgs(process.argv.slice(2));
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected undefined to be +0 // Object.is equality

[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:95:24
   return options;
 }
 
-if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
+if (process.argv[1] && import.meta.url !== pathToFileURL(process.argv[1]).href) {
   try {
     const options = parseArgs(process.argv.slice(2));
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/scripts/gen-scenarios.mjs:96:7
 }
 
 if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
-  try {
-    const options = parseArgs(process.argv.slice(2));
-    const input = JSON.parse(readFileSync(options.input, 'utf8'));
-    const context = { file: basename(options.input) };
-    const result = options.scenarios
-      ? checkEventCoverage(input, readFileSync(options.scenarios, 'utf8'), context)
-      : compileScenarios(input, context);
-    if (!options.scenarios && options.format !== 'json' && result.exitCode === 0) process.stdout.write(result.output);
-    else process.stdout.write(options.format === 'json'
-      ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
-      : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
-    process.exitCode = result.exitCode;
-  } catch (error) {
+  try {} catch (error) {
     process.stderr.write(`${error.message}\n`);
     process.exitCode = 2;
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected undefined to be +0 // Object.is equality

[Killed] MethodExpression
src/scripts/gen-scenarios.mjs:97:31
 
 if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
   try {
-    const options = parseArgs(process.argv.slice(2));
+    const options = parseArgs(process.argv);
     const input = JSON.parse(readFileSync(options.input, 'utf8'));
     const context = { file: basename(options.input) };
killedBy: gen-scenarios CLI entrypoint guard (in-process) runs the CLI block when argv[1] resolves to this module
statusReason: expected 2 to be +0 // Object.is equality

[Survived] ObjectLiteral
src/scripts/gen-scenarios.mjs:99:21
   try {
     const options = parseArgs(process.argv.slice(2));
     const input = JSON.parse(readFileSync(options.input, 'utf8'));
-    const context = { file: basename(options.input) };
+    const context = {};
     const result = options.scenarios
       ? checkEventCoverage(input, readFileSync(options.scenarios, 'utf8'), context)
