[Killed] EqualityOperator
src/scripts/gen-scenarios.mjs:103:60
     const result = options.scenarios
       ? checkEventCoverage(input, readFileSync(options.scenarios, 'utf8'), context)
       : compileScenarios(input, context);
-    if (!options.scenarios && options.format !== 'json' && result.exitCode === 0) process.stdout.write(result.output);
+    if (!options.scenarios && options.format !== 'json' && result.exitCode !== 0) process.stdout.write(result.output);
     else process.stdout.write(options.format === 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
killedBy: gen-scenarios CLI entrypoint guard (in-process) writes invalid-model diagnostics as plain text with exit 2 when format is not json
statusReason: expected '' to contain 'PL-SCENARIO-OWNERSHIP'

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:103:60
     const result = options.scenarios
       ? checkEventCoverage(input, readFileSync(options.scenarios, 'utf8'), context)
       : compileScenarios(input, context);
-    if (!options.scenarios && options.format !== 'json' && result.exitCode === 0) process.stdout.write(result.output);
+    if (!options.scenarios && options.format !== 'json' && true) process.stdout.write(result.output);
     else process.stdout.write(options.format === 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
killedBy: gen-scenarios CLI entrypoint guard (in-process) writes invalid-model diagnostics as plain text with exit 2 when format is not json
statusReason: expected '' to contain 'PL-SCENARIO-OWNERSHIP'

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:104:31
       ? checkEventCoverage(input, readFileSync(options.scenarios, 'utf8'), context)
       : compileScenarios(input, context);
     if (!options.scenarios && options.format !== 'json' && result.exitCode === 0) process.stdout.write(result.output);
-    else process.stdout.write(options.format === 'json'
+    else process.stdout.write(true
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
killedBy: gen-scenarios CLI entrypoint guard (in-process) writes invalid-model diagnostics as plain text with exit 2 when format is not json
statusReason: expected '[\n  {\n    "version": "1",\n    "rul…' not to contain '{'

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:104:31
       ? checkEventCoverage(input, readFileSync(options.scenarios, 'utf8'), context)
       : compileScenarios(input, context);
     if (!options.scenarios && options.format !== 'json' && result.exitCode === 0) process.stdout.write(result.output);
-    else process.stdout.write(options.format === 'json'
+    else process.stdout.write(false
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
killedBy: gen-scenarios CLI entrypoint guard (in-process) parses --input, --scenarios, and --format together and reports missing-event JSON diagnostics
statusReason: Unexpected token 'P', "PL-SCENARI"... is not valid JSON

[Killed] ArrowFunction
src/scripts/gen-scenarios.mjs:106:32
     if (!options.scenarios && options.format !== 'json' && result.exitCode === 0) process.stdout.write(result.output);
     else process.stdout.write(options.format === 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
-      : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
+      : result.diagnostics.map(() => undefined).join('\n') + (result.diagnostics.length ? '\n' : ''));
     process.exitCode = result.exitCode;
   } catch (error) {
killedBy: gen-scenarios CLI entrypoint guard (in-process) writes invalid-model diagnostics as plain text with exit 2 when format is not json
statusReason: expected '\n\n\n\n' to contain 'PL-SCENARIO-OWNERSHIP'

[Killed] ArithmeticOperator
src/scripts/gen-scenarios.mjs:106:9
     if (!options.scenarios && options.format !== 'json' && result.exitCode === 0) process.stdout.write(result.output);
     else process.stdout.write(options.format === 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
-      : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
+      : result.diagnostics.map(item => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') - (result.diagnostics.length ? '\n' : ''));
     process.exitCode = result.exitCode;
   } catch (error) {
killedBy: gen-scenarios CLI entrypoint guard (in-process) writes invalid-model diagnostics as plain text with exit 2 when format is not json
statusReason: expected 'NaN' to contain 'PL-SCENARIO-OWNERSHIP'

[Killed] BlockStatement
src/scripts/gen-scenarios.mjs:108:19
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
     process.exitCode = result.exitCode;
-  } catch (error) {
-    process.stderr.write(`${error.message}\n`);
-    process.exitCode = 2;
-  }
+  } catch (error) {}
 }
 
killedBy: gen-scenarios CLI entrypoint guard (in-process) reports an unknown CLI argument via the catch block with exit 2
statusReason: expected undefined to be 2 // Object.is equality
