[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:20:66
 } from 'node:path';
 import { pathToFileURL } from 'node:url';
 
-const SOURCE_EXTENSIONS = ['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs'];
+const SOURCE_EXTENSIONS = ['.ts', '.tsx', '.js', '.jsx', '.mts', "", '.mjs', '.cjs'];
 
 const slash = (value) => value.replaceAll('\\', '/');
killedBy: fail-closed import scanner discovers a cts file as the sole source file, not silently skipping it
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArrayDeclaration
src/scripts/pl-arch-check.mjs:20:27
 } from 'node:path';
 import { pathToFileURL } from 'node:url';
 
-const SOURCE_EXTENSIONS = ['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs'];
+const SOURCE_EXTENSIONS = [];
 
 const slash = (value) => value.replaceAll('\\', '/');
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:22:15
 
 const SOURCE_EXTENSIONS = ['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs'];
 
-const slash = (value) => value.replaceAll('\\', '/');
+const slash = () => undefined;
 const projectPath = (root, value) => slash(relative(root, value));
 const inside = (root, value) => {
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":[],"external":{"allow":true}}
statusReason: expected 'Cannot read properties of undefined (…' to contain 'aliases must map'

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:23:21
 const SOURCE_EXTENSIONS = ['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs'];
 
 const slash = (value) => value.replaceAll('\\', '/');
-const projectPath = (root, value) => slash(relative(root, value));
+const projectPath = () => undefined;
 const inside = (root, value) => {
   const rel = relative(root, value);
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:24:33
 
 const slash = (value) => value.replaceAll('\\', '/');
 const projectPath = (root, value) => slash(relative(root, value));
-const inside = (root, value) => {
-  const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
-};
+const inside = (root, value) => {};
 const diagnostic = (rule_id, file, dependency, message) => ({
   version: '1', rule_id, severity: 'error', file, dependency, message,
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:26:10
 const projectPath = (root, value) => slash(relative(root, value));
 const inside = (root, value) => {
   const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
+  return rel === '' && !rel.startsWith('..') && !isAbsolute(rel);
 };
 const diagnostic = (rule_id, file, dependency, message) => ({
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:26:50
 const projectPath = (root, value) => slash(relative(root, value));
 const inside = (root, value) => {
   const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
+  return rel === '' || (!rel.startsWith('..') && isAbsolute(rel));
 };
 const diagnostic = (rule_id, file, dependency, message) => ({
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:28:20
   const rel = relative(root, value);
   return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
 };
-const diagnostic = (rule_id, file, dependency, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency, message,
-});
+const diagnostic = () => undefined;
 
 function compileGlob(glob) {
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'rule_id')

[Killed] ObjectLiteral
src/scripts/pl-arch-check.mjs:28:61
   const rel = relative(root, value);
   return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
 };
-const diagnostic = (rule_id, file, dependency, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency, message,
-});
+const diagnostic = (rule_id, file, dependency, message) => ({});
 
 function compileGlob(glob) {
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected undefined to be 'PL-ARCH-MANIFEST-VERSION' // Object.is equality

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:29:12
   return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
 };
 const diagnostic = (rule_id, file, dependency, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency, message,
+  version: "", rule_id, severity: 'error', file, dependency, message,
 });
 
killedBy: bounded resolution and deterministic diagnostics matches the golden forbidden-import output byte-for-byte across runs
statusReason: expected { exitCode: 1, …(2) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:29:36
   return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
 };
 const diagnostic = (rule_id, file, dependency, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency, message,
+  version: '1', rule_id, severity: "", file, dependency, message,
 });
 
killedBy: bounded resolution and deterministic diagnostics matches the golden forbidden-import output byte-for-byte across runs
statusReason: expected { exitCode: 1, …(2) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:32:28
   version: '1', rule_id, severity: 'error', file, dependency, message,
 });
 
-function compileGlob(glob) {
-  const normalized = slash(glob);
-  const segments = normalized.split('/');
-  if (!normalized || /[?\[\]{}!]/.test(normalized)
-    || segments.some((part) => part.includes('**') && part !== '**')) {
-    throw new Error(`Unsupported glob: ${glob}`);
-  }
-  let pattern = '';
-  segments.forEach((part, index) => {
-    const isLast = index === segments.length - 1;
-    if (part === '**') {
-      // Mid-path '**' already expands to a group ending in '/', which itself
-      // supplies the separator before the next segment — appending another
-      // '/' here would require an extra directory level that never exists.
-      pattern += isLast ? '.*' : '(?:[^/]+/)*';
-    } else {
-      pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
-      if (!isLast) pattern += '/';
-    }
-  });
-  return new RegExp(`^${pattern}$`);
-}
+function compileGlob(glob) {}
 
 function validateManifest(raw) {
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'test')

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:35:7
 function compileGlob(glob) {
   const normalized = slash(glob);
   const segments = normalized.split('/');
-  if (!normalized || /[?\[\]{}!]/.test(normalized)
+  if (normalized || /[?\[\]{}!]/.test(normalized)
     || segments.some((part) => part.includes('**') && part !== '**')) {
     throw new Error(`Unsupported glob: ${glob}`);
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":[],"external":{"allow":true}}
statusReason: expected 'Unsupported glob: src/**' to contain 'aliases must map'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:35:7
 function compileGlob(glob) {
   const normalized = slash(glob);
   const segments = normalized.split('/');
-  if (!normalized || /[?\[\]{}!]/.test(normalized)
-    || segments.some((part) => part.includes('**') && part !== '**')) {
+  if (false) {
     throw new Error(`Unsupported glob: ${glob}`);
   }
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-UNMATCHED-LAYER' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] MethodExpression
src/scripts/pl-arch-check.mjs:36:8
   const normalized = slash(glob);
   const segments = normalized.split('/');
   if (!normalized || /[?\[\]{}!]/.test(normalized)
-    || segments.some((part) => part.includes('**') && part !== '**')) {
+    || segments.every(part => part.includes('**') && part !== '**')) {
     throw new Error(`Unsupported glob: ${glob}`);
   }
killedBy: glob compilation rejects a ** segment combined with other characters in the same path segment
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(6 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:36:32
   const normalized = slash(glob);
   const segments = normalized.split('/');
   if (!normalized || /[?\[\]{}!]/.test(normalized)
-    || segments.some((part) => part.includes('**') && part !== '**')) {
+    || segments.some((part) => part.includes('**') || part !== '**')) {
     throw new Error(`Unsupported glob: ${glob}`);
   }
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":[],"external":{"allow":true}}
statusReason: expected 'Unsupported glob: src/**' to contain 'aliases must map'

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:40:37
     throw new Error(`Unsupported glob: ${glob}`);
   }
   let pattern = '';
-  segments.forEach((part, index) => {
-    const isLast = index === segments.length - 1;
-    if (part === '**') {
-      // Mid-path '**' already expands to a group ending in '/', which itself
-      // supplies the separator before the next segment — appending another
-      // '/' here would require an extra directory level that never exists.
-      pattern += isLast ? '.*' : '(?:[^/]+/)*';
-    } else {
-      pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
-      if (!isLast) pattern += '/';
-    }
-  });
+  segments.forEach((part, index) => {});
   return new RegExp(`^${pattern}$`);
 }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:41:20
   }
   let pattern = '';
   segments.forEach((part, index) => {
-    const isLast = index === segments.length - 1;
+    const isLast = index !== segments.length - 1;
     if (part === '**') {
       // Mid-path '**' already expands to a group ending in '/', which itself
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:41:20
   }
   let pattern = '';
   segments.forEach((part, index) => {
-    const isLast = index === segments.length - 1;
+    const isLast = true;
     if (part === '**') {
       // Mid-path '**' already expands to a group ending in '/', which itself
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:42:9
   let pattern = '';
   segments.forEach((part, index) => {
     const isLast = index === segments.length - 1;
-    if (part === '**') {
+    if (true) {
       // Mid-path '**' already expands to a group ending in '/', which itself
       // supplies the separator before the next segment — appending another
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:42:9
   let pattern = '';
   segments.forEach((part, index) => {
     const isLast = index === segments.length - 1;
-    if (part === '**') {
+    if (false) {
       // Mid-path '**' already expands to a group ending in '/', which itself
       // supplies the separator before the next segment — appending another
killedBy: glob compilation matches a mid-path ** against zero directory segments
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:46:7
       // Mid-path '**' already expands to a group ending in '/', which itself
       // supplies the separator before the next segment — appending another
       // '/' here would require an extra directory level that never exists.
-      pattern += isLast ? '.*' : '(?:[^/]+/)*';
+      pattern -= isLast ? '.*' : '(?:[^/]+/)*';
     } else {
       pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:46:34
       // Mid-path '**' already expands to a group ending in '/', which itself
       // supplies the separator before the next segment — appending another
       // '/' here would require an extra directory level that never exists.
-      pattern += isLast ? '.*' : '(?:[^/]+/)*';
+      pattern += isLast ? '.*' : "";
     } else {
       pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
killedBy: glob compilation matches a mid-path ** against one or more nested directory segments
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:47:12
       // supplies the separator before the next segment — appending another
       // '/' here would require an extra directory level that never exists.
       pattern += isLast ? '.*' : '(?:[^/]+/)*';
-    } else {
-      pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
-      if (!isLast) pattern += '/';
-    }
+    } else {}
   });
   return new RegExp(`^${pattern}$`);
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:48:7
       // '/' here would require an extra directory level that never exists.
       pattern += isLast ? '.*' : '(?:[^/]+/)*';
     } else {
-      pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
+      pattern -= part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
       if (!isLast) pattern += '/';
     }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:48:66
       // '/' here would require an extra directory level that never exists.
       pattern += isLast ? '.*' : '(?:[^/]+/)*';
     } else {
-      pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
+      pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll("", '[^/]*');
       if (!isLast) pattern += '/';
     }
killedBy: layer manifest validation rejects unmatched and overlapping file ownership
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:49:11
       pattern += isLast ? '.*' : '(?:[^/]+/)*';
     } else {
       pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
-      if (!isLast) pattern += '/';
+      if (true) pattern += '/';
     }
   });
killedBy: layer manifest validation rejects unmatched and overlapping file ownership
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:49:11
       pattern += isLast ? '.*' : '(?:[^/]+/)*';
     } else {
       pattern += part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
-      if (!isLast) pattern += '/';
+      if (false) pattern += '/';
     }
   });
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:55:32
   return new RegExp(`^${pattern}$`);
 }
 
-function validateManifest(raw) {
-  if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
-  if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
-  const names = new Set(raw.layers.map((layer) => layer?.name));
-  if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
-  const layers = raw.layers.map((layer) => {
-    if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
-    if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
-    let globs;
-    try { globs = layer.globs.map(compileGlob); }
-    catch (error) { throw Object.assign(error, { rule: 'PL-ARCH-UNSUPPORTED-GLOB' }); }
-    return { ...layer, patterns: layer.globs, globs };
-  });
-  const aliases = raw.aliases ?? {};
-  if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
-    || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
-    throw new Error('Manifest aliases must map non-empty keys to paths');
-  }
-  if (typeof raw.external?.allow !== 'boolean') throw new Error('Manifest external.allow must be boolean');
-  return { layers, aliases, external: raw.external };
-}
+function validateManifest(raw) {}
 
 function walkSources(root) {
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'layers')

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:56:7
 }
 
 function validateManifest(raw) {
-  if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
+  if (true) throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
   if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-MANIFEST-VERSION' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:56:7
 }
 
 function validateManifest(raw) {
-  if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
+  if (raw?.version === '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
   if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:57:37
 
 function validateManifest(raw) {
   if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
-  if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
+  if (!Array.isArray(raw.layers) || false) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[],"aliases":{},"external":{"allow":true}}
statusReason: expected 'No layer owns src/main.ts' to contain 'must be non-empty'

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:57:7
 
 function validateManifest(raw) {
   if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
-  if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
+  if (!Array.isArray(raw.layers) && raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[],"aliases":{},"external":{"allow":true}}
statusReason: expected 'No layer owns src/main.ts' to contain 'must be non-empty'

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:58:40
 function validateManifest(raw) {
   if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
   if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
-  const names = new Set(raw.layers.map((layer) => layer?.name));
+  const names = new Set(raw.layers.map(() => undefined));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-INVALID-MANIFEST' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] OptionalChaining
src/scripts/pl-arch-check.mjs:58:51
 function validateManifest(raw) {
   if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
   if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
-  const names = new Set(raw.layers.map((layer) => layer?.name));
+  const names = new Set(raw.layers.map((layer) => layer.name));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
killedBy: layer manifest validation does not crash when a layer entry in the array is null
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(6 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:59:7
   if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
   if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
-  if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
+  if (names.size === raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
     if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-INVALID-MANIFEST' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:59:7
   if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
   if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
-  if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
+  if (false) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
     if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"a","globs":["src/**"],"may_import":[]},{"name":"a","globs":["lib/**"],"may_import":[]}],"aliases":{},"ext
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:60:44
   if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
-  const layers = raw.layers.map((layer) => {
-    if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
-    if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
-    let globs;
-    try { globs = layer.globs.map(compileGlob); }
-    catch (error) { throw Object.assign(error, { rule: 'PL-ARCH-UNSUPPORTED-GLOB' }); }
-    return { ...layer, patterns: layer.globs, globs };
-  });
+  const layers = raw.layers.map((layer) => {});
   const aliases = raw.aliases ?? {};
   if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'patterns')

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:61:9
   const names = new Set(raw.layers.map((layer) => layer?.name));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
-    if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
+    if (true) throw new Error(`Invalid layer ${layer.name}`);
     if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-INVALID-MANIFEST' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:61:40
   const names = new Set(raw.layers.map((layer) => layer?.name));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
-    if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
+    if (!Array.isArray(layer.globs) || Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
     if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-INVALID-MANIFEST' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality
