[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:62:9
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
     if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
-    if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
+    if (true) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
     try { globs = layer.globs.map(compileGlob); }
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-INVALID-MANIFEST' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:62:41
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
     if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
-    if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
+    if (layer.may_import.some((name) => names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
     try { globs = layer.globs.map(compileGlob); }
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"a","globs":["src/**"],"may_import":["unknown-layer"]}],"aliases":{},"external":{"allow":true}}
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:64:9
     if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
     if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
-    try { globs = layer.globs.map(compileGlob); }
+    try {}
     catch (error) { throw Object.assign(error, { rule: 'PL-ARCH-UNSUPPORTED-GLOB' }); }
     return { ...layer, patterns: layer.globs, globs };
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:65:19
     if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
     try { globs = layer.globs.map(compileGlob); }
-    catch (error) { throw Object.assign(error, { rule: 'PL-ARCH-UNSUPPORTED-GLOB' }); }
+    catch (error) {}
     return { ...layer, patterns: layer.globs, globs };
   });
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:65:56
     if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
     try { globs = layer.globs.map(compileGlob); }
-    catch (error) { throw Object.assign(error, { rule: 'PL-ARCH-UNSUPPORTED-GLOB' }); }
+    catch (error) { throw Object.assign(error, { rule: "" }); }
     return { ...layer, patterns: layer.globs, globs };
   });
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected '' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] ObjectLiteral
src/scripts/pl-arch-check.mjs:66:12
     let globs;
     try { globs = layer.globs.map(compileGlob); }
     catch (error) { throw Object.assign(error, { rule: 'PL-ARCH-UNSUPPORTED-GLOB' }); }
-    return { ...layer, patterns: layer.globs, globs };
+    return {};
   });
   const aliases = raw.aliases ?? {};
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: layer.patterns is not iterable

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:68:19
     catch (error) { throw Object.assign(error, { rule: 'PL-ARCH-UNSUPPORTED-GLOB' }); }
     return { ...layer, patterns: layer.globs, globs };
   });
-  const aliases = raw.aliases ?? {};
+  const aliases = raw.aliases && {};
   if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
     || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":[],"external":{"allow":true}}
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:69:7
     return { ...layer, patterns: layer.globs, globs };
   });
   const aliases = raw.aliases ?? {};
-  if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
+  if (aliases || Array.isArray(aliases) || typeof aliases !== 'object'
     || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
     throw new Error('Manifest aliases must map non-empty keys to paths');
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":{},"external":{}}
statusReason: expected 'Manifest aliases must map non-empty k…' to contain 'external.allow must be boolean'

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:69:7
     return { ...layer, patterns: layer.globs, globs };
   });
   const aliases = raw.aliases ?? {};
-  if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
+  if (!aliases && Array.isArray(aliases) || typeof aliases !== 'object'
     || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
     throw new Error('Manifest aliases must map non-empty keys to paths');
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":[],"external":{"allow":true}}
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:70:91
   });
   const aliases = raw.aliases ?? {};
   if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
-    || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
-    throw new Error('Manifest aliases must map non-empty keys to paths');
-  }
+    || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {}
   if (typeof raw.external?.allow !== 'boolean') throw new Error('Manifest external.allow must be boolean');
   return { layers, aliases, external: raw.external };
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":[],"external":{"allow":true}}
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:70:55
   });
   const aliases = raw.aliases ?? {};
   if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
-    || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
+    || Object.entries(aliases).some(([key, value]) => true)) {
     throw new Error('Manifest aliases must map non-empty keys to paths');
   }
killedBy: bounded resolution and deterministic diagnostics resolves configured aliases inside root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:71:21
   const aliases = raw.aliases ?? {};
   if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
     || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
-    throw new Error('Manifest aliases must map non-empty keys to paths');
+    throw new Error("");
   }
   if (typeof raw.external?.allow !== 'boolean') throw new Error('Manifest external.allow must be boolean');
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":[],"external":{"allow":true}}
statusReason: expected '' to contain 'aliases must map'

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:73:7
     || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
     throw new Error('Manifest aliases must map non-empty keys to paths');
   }
-  if (typeof raw.external?.allow !== 'boolean') throw new Error('Manifest external.allow must be boolean');
+  if (typeof raw.external?.allow === 'boolean') throw new Error('Manifest external.allow must be boolean');
   return { layers, aliases, external: raw.external };
 }
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":{},"external":{}}
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:73:7
     || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
     throw new Error('Manifest aliases must map non-empty keys to paths');
   }
-  if (typeof raw.external?.allow !== 'boolean') throw new Error('Manifest external.allow must be boolean');
+  if (true) throw new Error('Manifest external.allow must be boolean');
   return { layers, aliases, external: raw.external };
 }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:77:28
   return { layers, aliases, external: raw.external };
 }
 
-function walkSources(root) {
-  const files = [];
-  const walk = (dir) => {
-    for (const entry of readdirSync(dir, { withFileTypes: true })) {
-      const path = join(dir, entry.name);
-      if (entry.isDirectory()) walk(path);
-      else if (entry.isFile() && SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
-    }
-  };
-  walk(root);
-  return files.sort((a, b) => slash(a).localeCompare(slash(b)));
-}
+function walkSources(root) {}
 
 function configuredSourceRoots(root, layers) {
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: The "to" argument must be of type string. Received undefined

[Killed] ArrayDeclaration
src/scripts/pl-arch-check.mjs:78:17
 }
 
 function walkSources(root) {
-  const files = [];
+  const files = ["Stryker was here"];
   const walk = (dir) => {
     for (const entry of readdirSync(dir, { withFileTypes: true })) {
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:79:25
 
 function walkSources(root) {
   const files = [];
-  const walk = (dir) => {
-    for (const entry of readdirSync(dir, { withFileTypes: true })) {
-      const path = join(dir, entry.name);
-      if (entry.isDirectory()) walk(path);
-      else if (entry.isFile() && SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
-    }
-  };
+  const walk = (dir) => {};
   walk(root);
   return files.sort((a, b) => slash(a).localeCompare(slash(b)));
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:80:59
 function walkSources(root) {
   const files = [];
   const walk = (dir) => {
-    for (const entry of readdirSync(dir, { withFileTypes: true })) {
+    for (const entry of readdirSync(dir, { withFileTypes: false })) {
       const path = join(dir, entry.name);
       if (entry.isDirectory()) walk(path);
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:80:68
 function walkSources(root) {
   const files = [];
   const walk = (dir) => {
-    for (const entry of readdirSync(dir, { withFileTypes: true })) {
-      const path = join(dir, entry.name);
-      if (entry.isDirectory()) walk(path);
-      else if (entry.isFile() && SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
-    }
+    for (const entry of readdirSync(dir, { withFileTypes: true })) {}
   };
   walk(root);
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:82:11
   const walk = (dir) => {
     for (const entry of readdirSync(dir, { withFileTypes: true })) {
       const path = join(dir, entry.name);
-      if (entry.isDirectory()) walk(path);
+      if (false) walk(path);
       else if (entry.isFile() && SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
     }
killedBy: glob compilation matches a mid-path ** against one or more nested directory segments
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:82:11
   const walk = (dir) => {
     for (const entry of readdirSync(dir, { withFileTypes: true })) {
       const path = join(dir, entry.name);
-      if (entry.isDirectory()) walk(path);
+      if (true) walk(path);
       else if (entry.isFile() && SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
     }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: ENOTDIR: not a directory, scandir '/private/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-arch-dFcdwy/src/main.ts'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:83:16
     for (const entry of readdirSync(dir, { withFileTypes: true })) {
       const path = join(dir, entry.name);
       if (entry.isDirectory()) walk(path);
-      else if (entry.isFile() && SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
+      else if (false) files.push(path);
     }
   };
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:83:16
     for (const entry of readdirSync(dir, { withFileTypes: true })) {
       const path = join(dir, entry.name);
       if (entry.isDirectory()) walk(path);
-      else if (entry.isFile() && SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
+      else if (true) files.push(path);
     }
   };
killedBy: source root discovery and file walking treats a wildcard-prefixed glob with no directory component as rooted at the project root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Survived] MethodExpression
src/scripts/pl-arch-check.mjs:87:10
     }
   };
   walk(root);
-  return files.sort((a, b) => slash(a).localeCompare(slash(b)));
+  return files;
 }
 

[Survived] ArrowFunction
src/scripts/pl-arch-check.mjs:87:21
     }
   };
   walk(root);
-  return files.sort((a, b) => slash(a).localeCompare(slash(b)));
+  return files.sort(() => undefined);
 }
 

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:90:46
   return files.sort((a, b) => slash(a).localeCompare(slash(b)));
 }
 
-function configuredSourceRoots(root, layers) {
-  const roots = new Set();
-  const conventional = join(root, 'src');
-  if (existsSync(conventional)) roots.add(realpathSync(conventional));
-  for (const layer of layers) {
-    for (const pattern of layer.patterns) {
-      const normalized = slash(pattern);
-      const wildcard = normalized.search(/[*?\[]/);
-      let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
-      prefix = prefix.replace(/\/+$/, '');
-      const candidate = resolve(root, prefix || '.');
-      if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
-    }
-  }
-  return [...roots].sort((a, b) => slash(a).localeCompare(slash(b)));
-}
+function configuredSourceRoots(root, layers) {}
 
 export function lexSource(source) {
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: Cannot read properties of undefined (reading 'flatMap')

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:93:7
 function configuredSourceRoots(root, layers) {
   const roots = new Set();
   const conventional = join(root, 'src');
-  if (existsSync(conventional)) roots.add(realpathSync(conventional));
+  if (false) roots.add(realpathSync(conventional));
   for (const layer of layers) {
     for (const pattern of layer.patterns) {
killedBy: layer manifest validation rejects unmatched and overlapping file ownership
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:93:7
 function configuredSourceRoots(root, layers) {
   const roots = new Set();
   const conventional = join(root, 'src');
-  if (existsSync(conventional)) roots.add(realpathSync(conventional));
+  if (true) roots.add(realpathSync(conventional));
   for (const layer of layers) {
     for (const pattern of layer.patterns) {
killedBy: source root discovery and file walking discovers additional source roots from wildcard layer globs outside src/
statusReason: ENOENT: no such file or directory, lstat '/private/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-arch-3T8W7o/src'

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:94:31
   const roots = new Set();
   const conventional = join(root, 'src');
   if (existsSync(conventional)) roots.add(realpathSync(conventional));
-  for (const layer of layers) {
-    for (const pattern of layer.patterns) {
-      const normalized = slash(pattern);
-      const wildcard = normalized.search(/[*?\[]/);
-      let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
-      prefix = prefix.replace(/\/+$/, '');
-      const candidate = resolve(root, prefix || '.');
-      if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
-    }
-  }
+  for (const layer of layers) {}
   return [...roots].sort((a, b) => slash(a).localeCompare(slash(b)));
 }
killedBy: source root discovery and file walking discovers additional source roots from wildcard layer globs outside src/
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:95:43
   const conventional = join(root, 'src');
   if (existsSync(conventional)) roots.add(realpathSync(conventional));
   for (const layer of layers) {
-    for (const pattern of layer.patterns) {
-      const normalized = slash(pattern);
-      const wildcard = normalized.search(/[*?\[]/);
-      let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
-      prefix = prefix.replace(/\/+$/, '');
-      const candidate = resolve(root, prefix || '.');
-      if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
-    }
+    for (const pattern of layer.patterns) {}
   }
   return [...roots].sort((a, b) => slash(a).localeCompare(slash(b)));
killedBy: source root discovery and file walking discovers additional source roots from wildcard layer globs outside src/
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] UnaryOperator
src/scripts/pl-arch-check.mjs:98:34
     for (const pattern of layer.patterns) {
       const normalized = slash(pattern);
       const wildcard = normalized.search(/[*?\[]/);
-      let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
+      let prefix = (wildcard === +1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
       const candidate = resolve(root, prefix || '.');
killedBy: source root discovery and file walking extracts the full directory for a glob with no wildcard character at all
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:98:21
     for (const pattern of layer.patterns) {
       const normalized = slash(pattern);
       const wildcard = normalized.search(/[*?\[]/);
-      let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
+      let prefix = (wildcard !== -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
       const candidate = resolve(root, prefix || '.');
killedBy: source root discovery and file walking treats a wildcard-prefixed glob with no directory component as rooted at the project root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:99:39
       const normalized = slash(pattern);
       const wildcard = normalized.search(/[*?\[]/);
       let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
-      prefix = prefix.replace(/\/+$/, '');
+      prefix = prefix.replace(/\/+$/, "Stryker was here!");
       const candidate = resolve(root, prefix || '.');
       if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
killedBy: source root discovery and file walking discovers additional source roots from wildcard layer globs outside src/
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:100:39
       const wildcard = normalized.search(/[*?\[]/);
       let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
-      const candidate = resolve(root, prefix || '.');
+      const candidate = resolve(root, false);
       if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
     }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: The "paths[1]" argument must be of type string. Received type boolean (false)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:100:39
       const wildcard = normalized.search(/[*?\[]/);
       let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
-      const candidate = resolve(root, prefix || '.');
+      const candidate = resolve(root, true);
       if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
     }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: The "paths[1]" argument must be of type string. Received type boolean (true)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:101:11
       let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
       const candidate = resolve(root, prefix || '.');
-      if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
+      if (true) roots.add(realpathSync(candidate));
     }
   }
killedBy: layer manifest validation rejects unmatched and overlapping file ownership
statusReason: ENOENT: no such file or directory, lstat '/private/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-arch-vf9VrW/lib'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:101:11
       let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
       const candidate = resolve(root, prefix || '.');
-      if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
+      if (false) roots.add(realpathSync(candidate));
     }
   }
killedBy: source root discovery and file walking discovers additional source roots from wildcard layer globs outside src/
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Survived] ArrowFunction
src/scripts/pl-arch-check.mjs:104:26
       if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
     }
   }
-  return [...roots].sort((a, b) => slash(a).localeCompare(slash(b)));
+  return [...roots].sort(() => undefined);
 }
 

[Survived] MethodExpression
src/scripts/pl-arch-check.mjs:104:10
       if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
     }
   }
-  return [...roots].sort((a, b) => slash(a).localeCompare(slash(b)));
+  return [...roots];
 }
 

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:109:23
 
 export function lexSource(source) {
   const tokens = [];
-  for (let index = 0; index < source.length;) {
+  for (let index = 0; false;) {
     const char = source[index];
     if (/\s/.test(char)) { index += 1; continue; }
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:109:23
 
 export function lexSource(source) {
   const tokens = [];
-  for (let index = 0; index < source.length;) {
+  for (let index = 0; index >= source.length;) {
     const char = source[index];
     if (/\s/.test(char)) { index += 1; continue; }
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:111:9
   const tokens = [];
   for (let index = 0; index < source.length;) {
     const char = source[index];
-    if (/\s/.test(char)) { index += 1; continue; }
+    if (false) { index += 1; continue; }
     if (char === '/' && source[index + 1] === '/') {
       index = source.indexOf('\n', index + 2);
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:111:26
   const tokens = [];
   for (let index = 0; index < source.length;) {
     const char = source[index];
-    if (/\s/.test(char)) { index += 1; continue; }
+    if (/\s/.test(char)) {}
     if (char === '/' && source[index + 1] === '/') {
       index = source.indexOf('\n', index + 2);
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:112:25
   for (let index = 0; index < source.length;) {
     const char = source[index];
     if (/\s/.test(char)) { index += 1; continue; }
-    if (char === '/' && source[index + 1] === '/') {
+    if (char === '/' && source[index + 1] !== '/') {
       index = source.indexOf('\n', index + 2);
       if (index < 0) break;
killedBy: fail-closed import scanner throws on an unterminated block comment
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:112:9
   for (let index = 0; index < source.length;) {
     const char = source[index];
     if (/\s/.test(char)) { index += 1; continue; }
-    if (char === '/' && source[index + 1] === '/') {
+    if (false) {
       index = source.indexOf('\n', index + 2);
       if (index < 0) break;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './ignored-comment', …(5) ] to deeply equal [ './static', './setup', …(3) ]

[Survived] ArithmeticOperator
src/scripts/pl-arch-check.mjs:113:36
     const char = source[index];
     if (/\s/.test(char)) { index += 1; continue; }
     if (char === '/' && source[index + 1] === '/') {
-      index = source.indexOf('\n', index + 2);
+      index = source.indexOf('\n', index - 2);
       if (index < 0) break;
       continue;
