[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:114:11
     if (/\s/.test(char)) { index += 1; continue; }
     if (char === '/' && source[index + 1] === '/') {
       index = source.indexOf('\n', index + 2);
-      if (index < 0) break;
+      if (true) break;
       continue;
     }
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:114:11
     if (/\s/.test(char)) { index += 1; continue; }
     if (char === '/' && source[index + 1] === '/') {
       index = source.indexOf('\n', index + 2);
-      if (index < 0) break;
+      if (index >= 0) break;
       continue;
     }
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: 2, diagnostics: [ …(1) ] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:117:9
       if (index < 0) break;
       continue;
     }
-    if (char === '/' && source[index + 1] === '*') {
+    if (false) {
       const end = source.indexOf('*/', index + 2);
       if (end < 0) throw new Error('Unterminated block comment');
killedBy: fail-closed import scanner skips block comments including ones that would otherwise contain an import
statusReason: expected [ './ignored-block-comment', …(2) ] to deeply equal [ './real' ]

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:117:25
       if (index < 0) break;
       continue;
     }
-    if (char === '/' && source[index + 1] === '*') {
+    if (char === '/' && source[index + 1] !== '*') {
       const end = source.indexOf('*/', index + 2);
       if (end < 0) throw new Error('Unterminated block comment');
killedBy: fail-closed import scanner skips block comments including ones that would otherwise contain an import
statusReason: Unterminated block comment

[Survived] ArithmeticOperator
src/scripts/pl-arch-check.mjs:118:40
       continue;
     }
     if (char === '/' && source[index + 1] === '*') {
-      const end = source.indexOf('*/', index + 2);
+      const end = source.indexOf('*/', index - 2);
       if (end < 0) throw new Error('Unterminated block comment');
       index = end + 2;

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:119:11
     }
     if (char === '/' && source[index + 1] === '*') {
       const end = source.indexOf('*/', index + 2);
-      if (end < 0) throw new Error('Unterminated block comment');
+      if (true) throw new Error('Unterminated block comment');
       index = end + 2;
       continue;
killedBy: fail-closed import scanner skips block comments including ones that would otherwise contain an import
statusReason: Unterminated block comment

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:119:11
     }
     if (char === '/' && source[index + 1] === '*') {
       const end = source.indexOf('*/', index + 2);
-      if (end < 0) throw new Error('Unterminated block comment');
+      if (end >= 0) throw new Error('Unterminated block comment');
       index = end + 2;
       continue;
killedBy: fail-closed import scanner skips block comments including ones that would otherwise contain an import
statusReason: Unterminated block comment

[Survived] ArithmeticOperator
src/scripts/pl-arch-check.mjs:120:15
     if (char === '/' && source[index + 1] === '*') {
       const end = source.indexOf('*/', index + 2);
       if (end < 0) throw new Error('Unterminated block comment');
-      index = end + 2;
+      index = end - 2;
       continue;
     }

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:123:9
       index = end + 2;
       continue;
     }
-    if (char === '"' || char === "'") {
+    if (false) {
       const quote = char;
       let value = '';
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:123:9
       index = end + 2;
       continue;
     }
-    if (char === '"' || char === "'") {
+    if (false || char === "'") {
       const quote = char;
       let value = '';
killedBy: contract identity checker reports orphan test ids and ignores comments and ordinary strings
statusReason: expected { exitCode: 1, diagnostics: [ …(2) ] } to match object { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:126:20
     if (char === '"' || char === "'") {
       const quote = char;
       let value = '';
-      let closed = false;
+      let closed = true;
       let escaped = false;
       index += 1;
killedBy: fail-closed import scanner throws on an unterminated string literal
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:127:21
       const quote = char;
       let value = '';
       let closed = false;
-      let escaped = false;
+      let escaped = true;
       index += 1;
       while (index < source.length) {
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:128:7
       let value = '';
       let closed = false;
       let escaped = false;
-      index += 1;
+      index -= 1;
       while (index < source.length) {
         if (source[index] === '\\') {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:129:14
       let closed = false;
       let escaped = false;
       index += 1;
-      while (index < source.length) {
+      while (false) {
         if (source[index] === '\\') {
           if (index + 1 >= source.length) break;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:129:14
       let closed = false;
       let escaped = false;
       index += 1;
-      while (index < source.length) {
+      while (index >= source.length) {
         if (source[index] === '\\') {
           if (index + 1 >= source.length) break;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:130:13
       let escaped = false;
       index += 1;
       while (index < source.length) {
-        if (source[index] === '\\') {
+        if (source[index] !== '\\') {
           if (index + 1 >= source.length) break;
           escaped = true;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:130:13
       let escaped = false;
       index += 1;
       while (index < source.length) {
-        if (source[index] === '\\') {
+        if (true) {
           if (index + 1 >= source.length) break;
           escaped = true;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:131:15
       index += 1;
       while (index < source.length) {
         if (source[index] === '\\') {
-          if (index + 1 >= source.length) break;
+          if (true) break;
           escaped = true;
           value += source[index + 1];
killedBy: fail-closed import scanner rejects escaped module specifiers instead of misclassifying them
statusReason: expected [Function] to throw error including 'escaped module specifier' but got 'Unterminated string'

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:131:15
       index += 1;
       while (index < source.length) {
         if (source[index] === '\\') {
-          if (index + 1 >= source.length) break;
+          if (index + 1 < source.length) break;
           escaped = true;
           value += source[index + 1];
killedBy: fail-closed import scanner rejects escaped module specifiers instead of misclassifying them
statusReason: expected [Function] to throw error including 'escaped module specifier' but got 'Unterminated string'

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:132:21
       while (index < source.length) {
         if (source[index] === '\\') {
           if (index + 1 >= source.length) break;
-          escaped = true;
+          escaped = false;
           value += source[index + 1];
           index += 2;
killedBy: fail-closed import scanner rejects escaped module specifiers instead of misclassifying them
statusReason: expected [Function] to throw an error

[Survived] AssignmentOperator
src/scripts/pl-arch-check.mjs:133:11
         if (source[index] === '\\') {
           if (index + 1 >= source.length) break;
           escaped = true;
-          value += source[index + 1];
+          value -= source[index + 1];
           index += 2;
         } else if (source[index] === quote) {

[Survived] ArithmeticOperator
src/scripts/pl-arch-check.mjs:133:27
         if (source[index] === '\\') {
           if (index + 1 >= source.length) break;
           escaped = true;
-          value += source[index + 1];
+          value += source[index - 1];
           index += 2;
         } else if (source[index] === quote) {

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:134:11
           if (index + 1 >= source.length) break;
           escaped = true;
           value += source[index + 1];
-          index += 2;
+          index -= 2;
         } else if (source[index] === quote) {
           index += 1;
killedBy: fail-closed import scanner rejects escaped module specifiers instead of misclassifying them
statusReason: expected [Function] to throw error including 'escaped module specifier' but got 'Unterminated string'

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:135:20
           escaped = true;
           value += source[index + 1];
           index += 2;
-        } else if (source[index] === quote) {
+        } else if (source[index] !== quote) {
           index += 1;
           closed = true;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:135:20
           escaped = true;
           value += source[index + 1];
           index += 2;
-        } else if (source[index] === quote) {
+        } else if (false) {
           index += 1;
           closed = true;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:136:11
           value += source[index + 1];
           index += 2;
         } else if (source[index] === quote) {
-          index += 1;
+          index -= 1;
           closed = true;
           break;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:137:20
           index += 2;
         } else if (source[index] === quote) {
           index += 1;
-          closed = true;
+          closed = false;
           break;
         } else {
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Timeout] BlockStatement
src/scripts/pl-arch-check.mjs:139:16
           index += 1;
           closed = true;
           break;
-        } else {
-          value += source[index++];
-        }
+        } else {}
       }
       if (!closed) throw new Error('Unterminated string');

[Killed] UpdateOperator
src/scripts/pl-arch-check.mjs:140:27
           closed = true;
           break;
         } else {
-          value += source[index++];
+          value += source[index--];
         }
       }
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:140:11
           closed = true;
           break;
         } else {
-          value += source[index++];
+          value -= source[index++];
         }
       }
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: specifier.startsWith is not a function

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:143:11
           value += source[index++];
         }
       }
-      if (!closed) throw new Error('Unterminated string');
+      if (true) throw new Error('Unterminated string');
       tokens.push({ type: 'string', value, escaped });
       continue;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:143:11
           value += source[index++];
         }
       }
-      if (!closed) throw new Error('Unterminated string');
+      if (false) throw new Error('Unterminated string');
       tokens.push({ type: 'string', value, escaped });
       continue;
killedBy: fail-closed import scanner throws on an unterminated string literal
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:147:9
       tokens.push({ type: 'string', value, escaped });
       continue;
     }
-    if (char === '`') {
+    if (false) {
       let closed = false;
       index += 1;
killedBy: fail-closed import scanner throws on an unterminated template literal
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:147:9
       tokens.push({ type: 'string', value, escaped });
       continue;
     }
-    if (char === '`') {
+    if (char !== '`') {
       let closed = false;
       index += 1;
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:148:20
       continue;
     }
     if (char === '`') {
-      let closed = false;
+      let closed = true;
       index += 1;
       while (index < source.length) {
killedBy: fail-closed import scanner throws on an unterminated template literal
statusReason: expected [Function] to throw an error

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:149:7
     }
     if (char === '`') {
       let closed = false;
-      index += 1;
+      index -= 1;
       while (index < source.length) {
         if (source[index] === '\\') index += 2;
killedBy: fail-closed import scanner throws on an unterminated template literal
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:151:13
       let closed = false;
       index += 1;
       while (index < source.length) {
-        if (source[index] === '\\') index += 2;
+        if (false) index += 2;
         else if (source[index] === '`') { index += 1; closed = true; break; }
         else index += 1;
killedBy: fail-closed import scanner treats a backslash-escaped backtick inside a template literal as part of the template
statusReason: Unterminated template

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:151:13
       let closed = false;
       index += 1;
       while (index < source.length) {
-        if (source[index] === '\\') index += 2;
+        if (true) index += 2;
         else if (source[index] === '`') { index += 1; closed = true; break; }
         else index += 1;
killedBy: fail-closed import scanner skips an escaped backslash inside a template literal without ending it early
statusReason: Unterminated template

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:152:18
       index += 1;
       while (index < source.length) {
         if (source[index] === '\\') index += 2;
-        else if (source[index] === '`') { index += 1; closed = true; break; }
+        else if (source[index] !== '`') { index += 1; closed = true; break; }
         else index += 1;
       }
killedBy: fail-closed import scanner throws on an unterminated template literal
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:152:64
       index += 1;
       while (index < source.length) {
         if (source[index] === '\\') index += 2;
-        else if (source[index] === '`') { index += 1; closed = true; break; }
+        else if (source[index] === '`') { index += 1; closed = false; break; }
         else index += 1;
       }
killedBy: fail-closed import scanner skips an escaped backslash inside a template literal without ending it early
statusReason: Unterminated template

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:153:14
       while (index < source.length) {
         if (source[index] === '\\') index += 2;
         else if (source[index] === '`') { index += 1; closed = true; break; }
-        else index += 1;
+        else index -= 1;
       }
       if (!closed) throw new Error('Unterminated template');
killedBy: fail-closed import scanner throws on an unterminated template literal
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:155:11
         else if (source[index] === '`') { index += 1; closed = true; break; }
         else index += 1;
       }
-      if (!closed) throw new Error('Unterminated template');
+      if (closed) throw new Error('Unterminated template');
       tokens.push({ type: 'template', value: '' });
       continue;
killedBy: fail-closed import scanner throws on an unterminated template literal
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:155:11
         else if (source[index] === '`') { index += 1; closed = true; break; }
         else index += 1;
       }
-      if (!closed) throw new Error('Unterminated template');
+      if (true) throw new Error('Unterminated template');
       tokens.push({ type: 'template', value: '' });
       continue;
killedBy: fail-closed import scanner skips an escaped backslash inside a template literal without ending it early
statusReason: Unterminated template

[Survived] ObjectLiteral
src/scripts/pl-arch-check.mjs:156:19
         else index += 1;
       }
       if (!closed) throw new Error('Unterminated template');
-      tokens.push({ type: 'template', value: '' });
+      tokens.push({});
       continue;
     }

[Survived] StringLiteral
src/scripts/pl-arch-check.mjs:156:46
         else index += 1;
       }
       if (!closed) throw new Error('Unterminated template');
-      tokens.push({ type: 'template', value: '' });
+      tokens.push({ type: 'template', value: "Stryker was here!" });
       continue;
     }

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:159:9
       tokens.push({ type: 'template', value: '' });
       continue;
     }
-    if (/[A-Za-z_$]/.test(char)) {
+    if (false) {
       let end = index + 1;
       while (end < source.length && /[\w$]/.test(source[end])) end += 1;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:159:9
       tokens.push({ type: 'template', value: '' });
       continue;
     }
-    if (/[A-Za-z_$]/.test(char)) {
+    if (true) {
       let end = index + 1;
       while (end < source.length && /[\w$]/.test(source[end])) end += 1;
killedBy: fail-closed import scanner rejects non-literal require(prefix + name)
statusReason: expected [Function] to throw error including 'string literal' but got 'Direct require(...) calls are required'

[Timeout] ArithmeticOperator
src/scripts/pl-arch-check.mjs:160:17
       continue;
     }
     if (/[A-Za-z_$]/.test(char)) {
-      let end = index + 1;
+      let end = index - 1;
       while (end < source.length && /[\w$]/.test(source[end])) end += 1;
       tokens.push({ type: 'identifier', value: source.slice(index, end) });

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:161:14
     }
     if (/[A-Za-z_$]/.test(char)) {
       let end = index + 1;
-      while (end < source.length && /[\w$]/.test(source[end])) end += 1;
+      while (end >= source.length && /[\w$]/.test(source[end])) end += 1;
       tokens.push({ type: 'identifier', value: source.slice(index, end) });
       index = end;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:161:14
     }
     if (/[A-Za-z_$]/.test(char)) {
       let end = index + 1;
-      while (end < source.length && /[\w$]/.test(source[end])) end += 1;
+      while (false) end += 1;
       tokens.push({ type: 'identifier', value: source.slice(index, end) });
       index = end;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] MethodExpression
src/scripts/pl-arch-check.mjs:162:48
     if (/[A-Za-z_$]/.test(char)) {
       let end = index + 1;
       while (end < source.length && /[\w$]/.test(source[end])) end += 1;
-      tokens.push({ type: 'identifier', value: source.slice(index, end) });
+      tokens.push({ type: 'identifier', value: source });
       index = end;
       continue;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] ObjectLiteral
src/scripts/pl-arch-check.mjs:162:19
     if (/[A-Za-z_$]/.test(char)) {
       let end = index + 1;
       while (end < source.length && /[\w$]/.test(source[end])) end += 1;
-      tokens.push({ type: 'identifier', value: source.slice(index, end) });
+      tokens.push({});
       index = end;
       continue;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] ObjectLiteral
src/scripts/pl-arch-check.mjs:166:17
       index = end;
       continue;
     }
-    tokens.push({ type: 'punctuation', value: char });
+    tokens.push({});
     index += 1;
   }
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Timeout] AssignmentOperator
src/scripts/pl-arch-check.mjs:167:5
       continue;
     }
     tokens.push({ type: 'punctuation', value: char });
-    index += 1;
+    index -= 1;
   }
   return tokens;

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:175:23
 export function scanImports(source) {
   const tokens = lexSource(source);
   const dependencies = [];
-  const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
+  const unsupported = () => undefined;
   const moduleSpecifier = (token) => {
     if (token?.type !== 'string') throw unsupported();
killedBy: fail-closed import scanner rejects non-literal import(moduleName)
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:175:53
 export function scanImports(source) {
   const tokens = lexSource(source);
   const dependencies = [];
-  const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
+  const unsupported = () => Object.assign(new Error(""), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
   const moduleSpecifier = (token) => {
     if (token?.type !== 'string') throw unsupported();
killedBy: fail-closed import scanner rejects non-literal import(moduleName)
statusReason: expected [Function] to throw error including 'string literal' but got ''

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:176:38
   const tokens = lexSource(source);
   const dependencies = [];
   const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
-  const moduleSpecifier = (token) => {
-    if (token?.type !== 'string') throw unsupported();
-    if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
-    return token.value;
-  };
+  const moduleSpecifier = (token) => {};
   for (let index = 0; index < tokens.length; index += 1) {
     const token = tokens[index];
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:177:9
   const dependencies = [];
   const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
   const moduleSpecifier = (token) => {
-    if (token?.type !== 'string') throw unsupported();
+    if (true) throw unsupported();
     if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     return token.value;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:177:9
   const dependencies = [];
   const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
   const moduleSpecifier = (token) => {
-    if (token?.type !== 'string') throw unsupported();
+    if (token?.type === 'string') throw unsupported();
     if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     return token.value;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:178:9
   const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
   const moduleSpecifier = (token) => {
     if (token?.type !== 'string') throw unsupported();
-    if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
+    if (true) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     return token.value;
   };
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:178:9
   const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
   const moduleSpecifier = (token) => {
     if (token?.type !== 'string') throw unsupported();
-    if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
+    if (false) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     return token.value;
   };
killedBy: fail-closed import scanner rejects escaped module specifiers instead of misclassifying them
statusReason: expected [Function] to throw an error
