[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:181:23
     if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     return token.value;
   };
-  for (let index = 0; index < tokens.length; index += 1) {
+  for (let index = 0; index >= tokens.length; index += 1) {
     const token = tokens[index];
     if (token.type !== 'identifier') continue;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:181:46
     if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     return token.value;
   };
-  for (let index = 0; index < tokens.length; index += 1) {
+  for (let index = 0; index < tokens.length; index -= 1) {
     const token = tokens[index];
     if (token.type !== 'identifier') continue;
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:183:9
   };
   for (let index = 0; index < tokens.length; index += 1) {
     const token = tokens[index];
-    if (token.type !== 'identifier') continue;
+    if (true) continue;
     if (token.value === 'import') {
       const next = tokens[index + 1];
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:183:9
   };
   for (let index = 0; index < tokens.length; index += 1) {
     const token = tokens[index];
-    if (token.type !== 'identifier') continue;
+    if (token.type === 'identifier') continue;
     if (token.value === 'import') {
       const next = tokens[index + 1];
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:184:35
   for (let index = 0; index < tokens.length; index += 1) {
     const token = tokens[index];
     if (token.type !== 'identifier') continue;
-    if (token.value === 'import') {
-      const next = tokens[index + 1];
-      if (next?.value === '.') continue;
-      if (next?.value === '(') {
-        if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
-        dependencies.push(moduleSpecifier(tokens[index + 2]));
-        index += 3;
-      } else if (next?.type === 'string') {
-        dependencies.push(moduleSpecifier(next));
-        index += 1;
-      } else {
-        let cursor = index + 1;
-        while (cursor < tokens.length && tokens[cursor].value !== ';'
-          && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
-          if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
-            dependencies.push(moduleSpecifier(tokens[cursor + 1]));
-            index = cursor + 1;
-            break;
-          }
-          cursor += 1;
-        }
-        if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
-      }
-    } else if (token.value === 'export') {
+    if (token.value === 'import') {} else if (token.value === 'export') {
       let cursor = index + 1;
       while (cursor < tokens.length && tokens[cursor].value !== ';'
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './re-export', './common' ] to deeply equal [ './static', './setup', …(3) ]

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:184:9
   for (let index = 0; index < tokens.length; index += 1) {
     const token = tokens[index];
     if (token.type !== 'identifier') continue;
-    if (token.value === 'import') {
+    if (true) {
       const next = tokens[index + 1];
       if (next?.value === '.') continue;
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:185:27
     const token = tokens[index];
     if (token.type !== 'identifier') continue;
     if (token.value === 'import') {
-      const next = tokens[index + 1];
+      const next = tokens[index - 1];
       if (next?.value === '.') continue;
       if (next?.value === '(') {
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:186:11
     if (token.type !== 'identifier') continue;
     if (token.value === 'import') {
       const next = tokens[index + 1];
-      if (next?.value === '.') continue;
+      if (true) continue;
       if (next?.value === '(') {
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './re-export', './common' ] to deeply equal [ './static', './setup', …(3) ]

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:186:11
     if (token.type !== 'identifier') continue;
     if (token.value === 'import') {
       const next = tokens[index + 1];
-      if (next?.value === '.') continue;
+      if (false) continue;
       if (next?.value === '(') {
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
killedBy: fail-closed import scanner treats "import." (import.meta) as not an import statement
statusReason: Dynamic import/require must use a string literal

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:187:11
     if (token.value === 'import') {
       const next = tokens[index + 1];
       if (next?.value === '.') continue;
-      if (next?.value === '(') {
+      if (next?.value !== '(') {
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:187:11
     if (token.value === 'import') {
       const next = tokens[index + 1];
       if (next?.value === '.') continue;
-      if (next?.value === '(') {
+      if (true) {
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:188:13
       const next = tokens[index + 1];
       if (next?.value === '.') continue;
       if (next?.value === '(') {
-        if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
+        if (true) throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
         index += 3;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:188:53
       const next = tokens[index + 1];
       if (next?.value === '.') continue;
       if (next?.value === '(') {
-        if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
+        if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value === ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
         index += 3;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:189:50
       if (next?.value === '.') continue;
       if (next?.value === '(') {
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
-        dependencies.push(moduleSpecifier(tokens[index + 2]));
+        dependencies.push(moduleSpecifier(tokens[index - 2]));
         index += 3;
       } else if (next?.type === 'string') {
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Timeout] AssignmentOperator
src/scripts/pl-arch-check.mjs:190:9
       if (next?.value === '(') {
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
-        index += 3;
+        index -= 3;
       } else if (next?.type === 'string') {
         dependencies.push(moduleSpecifier(next));

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:191:18
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
         index += 3;
-      } else if (next?.type === 'string') {
+      } else if (true) {
         dependencies.push(moduleSpecifier(next));
         index += 1;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:191:18
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
         index += 3;
-      } else if (next?.type === 'string') {
+      } else if (false) {
         dependencies.push(moduleSpecifier(next));
         index += 1;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Timeout] AssignmentOperator
src/scripts/pl-arch-check.mjs:193:9
         index += 3;
       } else if (next?.type === 'string') {
         dependencies.push(moduleSpecifier(next));
-        index += 1;
+        index -= 1;
       } else {
         let cursor = index + 1;

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:194:14
       } else if (next?.type === 'string') {
         dependencies.push(moduleSpecifier(next));
         index += 1;
-      } else {
-        let cursor = index + 1;
-        while (cursor < tokens.length && tokens[cursor].value !== ';'
-          && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
-          if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
-            dependencies.push(moduleSpecifier(tokens[cursor + 1]));
-            index = cursor + 1;
-            break;
-          }
-          cursor += 1;
-        }
-        if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
-      }
+      } else {}
     } else if (token.value === 'export') {
       let cursor = index + 1;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './setup', './re-export', …(2) ] to deeply equal [ './static', './setup', …(3) ]

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:195:22
         dependencies.push(moduleSpecifier(next));
         index += 1;
       } else {
-        let cursor = index + 1;
+        let cursor = index - 1;
         while (cursor < tokens.length && tokens[cursor].value !== ';'
           && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:196:16
         index += 1;
       } else {
         let cursor = index + 1;
-        while (cursor < tokens.length && tokens[cursor].value !== ';'
-          && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
+        while (cursor < tokens.length && tokens[cursor].value !== ';' || tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
           if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
             dependencies.push(moduleSpecifier(tokens[cursor + 1]));
killedBy: fail-closed import scanner stops scanning a bare-import from-search when another "import" keyword interrupts it first
statusReason: expected [Function] to throw error including 'string literal' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:196:16
         index += 1;
       } else {
         let cursor = index + 1;
-        while (cursor < tokens.length && tokens[cursor].value !== ';'
-          && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
+        while (false) {
           if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
             dependencies.push(moduleSpecifier(tokens[cursor + 1]));
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:197:51
       } else {
         let cursor = index + 1;
         while (cursor < tokens.length && tokens[cursor].value !== ';'
-          && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
+          && tokens[cursor].value !== 'import' && tokens[cursor].value === 'export') {
           if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
             dependencies.push(moduleSpecifier(tokens[cursor + 1]));
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:197:14
       } else {
         let cursor = index + 1;
         while (cursor < tokens.length && tokens[cursor].value !== ';'
-          && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
+          && tokens[cursor].value === 'import' && tokens[cursor].value !== 'export') {
           if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
             dependencies.push(moduleSpecifier(tokens[cursor + 1]));
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:198:57
         let cursor = index + 1;
         while (cursor < tokens.length && tokens[cursor].value !== ';'
           && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
-          if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
+          if (tokens[cursor].value === 'from' && tokens[cursor - 1]?.type === 'string') {
             dependencies.push(moduleSpecifier(tokens[cursor + 1]));
             index = cursor + 1;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:198:89
         let cursor = index + 1;
         while (cursor < tokens.length && tokens[cursor].value !== ';'
           && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
-          if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
-            dependencies.push(moduleSpecifier(tokens[cursor + 1]));
-            index = cursor + 1;
-            break;
-          }
+          if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {}
           cursor += 1;
         }
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:199:54
         while (cursor < tokens.length && tokens[cursor].value !== ';'
           && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
           if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
-            dependencies.push(moduleSpecifier(tokens[cursor + 1]));
+            dependencies.push(moduleSpecifier(tokens[cursor - 1]));
             index = cursor + 1;
             break;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Survived] ArithmeticOperator
src/scripts/pl-arch-check.mjs:200:21
           && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
           if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
             dependencies.push(moduleSpecifier(tokens[cursor + 1]));
-            index = cursor + 1;
+            index = cursor - 1;
             break;
           }

[Killed] AssignmentOperator
src/scripts/pl-arch-check.mjs:203:11
             index = cursor + 1;
             break;
           }
-          cursor += 1;
+          cursor -= 1;
         }
         if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:205:13
           }
           cursor += 1;
         }
-        if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
+        if (cursor < tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
       }
     } else if (token.value === 'export') {
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:205:13
           }
           cursor += 1;
         }
-        if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
+        if (cursor >= tokens.length && tokens[cursor]?.value !== 'from') throw unsupported();
       }
     } else if (token.value === 'export') {
killedBy: fail-closed import scanner stops scanning a bare-import from-search when an "export" keyword interrupts it first
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:207:16
         }
         if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
       }
-    } else if (token.value === 'export') {
+    } else if (true) {
       let cursor = index + 1;
       while (cursor < tokens.length && tokens[cursor].value !== ';'
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './static', './setup', …(2) ] to deeply equal [ './static', './setup', …(3) ]

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:207:16
         }
         if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
       }
-    } else if (token.value === 'export') {
+    } else if (token.value !== 'export') {
       let cursor = index + 1;
       while (cursor < tokens.length && tokens[cursor].value !== ';'
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './static', './setup', …(2) ] to deeply equal [ './static', './setup', …(3) ]

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:208:20
         if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
       }
     } else if (token.value === 'export') {
-      let cursor = index + 1;
+      let cursor = index - 1;
       while (cursor < tokens.length && tokens[cursor].value !== ';'
         && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:209:14
       }
     } else if (token.value === 'export') {
       let cursor = index + 1;
-      while (cursor < tokens.length && tokens[cursor].value !== ';'
-        && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
+      while (true && tokens[cursor].value !== 'export') {
         if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
           dependencies.push(moduleSpecifier(tokens[cursor + 1]));
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:211:13
       let cursor = index + 1;
       while (cursor < tokens.length && tokens[cursor].value !== ';'
         && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
-        if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
+        if (true) {
           dependencies.push(moduleSpecifier(tokens[cursor + 1]));
           index = cursor + 1;
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:218:52
         }
         cursor += 1;
       }
-    } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
+    } else if (token.value === 'require' && tokens[index + 1]?.value !== '.') {
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
killedBy: fail-closed import scanner rejects indirect CommonJS loading: module.require('../infra/SqlOrder')
statusReason: expected [Function] to throw an error

[Killed] OptionalChaining
src/scripts/pl-arch-check.mjs:218:45
         }
         cursor += 1;
       }
-    } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
+    } else if (token.value === 'require' && tokens[index - 1].value !== '.') {
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
killedBy: fail-closed import scanner rejects non-literal require(prefix + name)
statusReason: expected [Function] to throw error including 'string literal' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:219:11
         cursor += 1;
       }
     } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
-      if (tokens[index + 1]?.value !== '(') {
+      if (false) {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
       }
killedBy: fail-closed import scanner rejects indirect CommonJS loading: const load = require; load('../infra/SqlOrder')
statusReason: expected [Function] to throw error including 'Direct require' but got 'Dynamic import/require must use a str…'

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:219:45
         cursor += 1;
       }
     } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
-      if (tokens[index + 1]?.value !== '(') {
-        throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
-      }
+      if (tokens[index + 1]?.value !== '(') {}
       if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
       dependencies.push(moduleSpecifier(tokens[index + 2]));
killedBy: fail-closed import scanner rejects indirect CommonJS loading: const load = require; load('../infra/SqlOrder')
statusReason: expected [Function] to throw error including 'Direct require' but got 'Dynamic import/require must use a str…'

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:220:39
       }
     } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
       if (tokens[index + 1]?.value !== '(') {
-        throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
+        throw Object.assign(new Error(""), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
       }
       if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
killedBy: fail-closed import scanner rejects indirect CommonJS loading: const load = require; load('../infra/SqlOrder')
statusReason: expected [Function] to throw error including 'Direct require' but got ''

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:222:51
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
       }
-      if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
+      if (tokens[index + 2]?.type !== 'string' || false) throw unsupported();
       dependencies.push(moduleSpecifier(tokens[index + 2]));
       index += 3;
killedBy: fail-closed import scanner rejects a require(...) with a trailing token after the string before the closing paren
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:222:11
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
       }
-      if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
+      if (tokens[index + 2]?.type !== 'string' && tokens[index + 3]?.value !== ')') throw unsupported();
       dependencies.push(moduleSpecifier(tokens[index + 2]));
       index += 3;
killedBy: fail-closed import scanner rejects a require(...) with a trailing token after the string before the closing paren
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:225:16
       if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
       dependencies.push(moduleSpecifier(tokens[index + 2]));
       index += 3;
-    } else if (token.value === 'require' && tokens[index - 1]?.value === '.' && tokens[index + 1]?.value === '(') {
+    } else if (token.value === 'require' || tokens[index - 1]?.value === '.' && tokens[index + 1]?.value === '(') {
       throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     }
killedBy: fail-closed import scanner does not treat an arbitrary dot-preceded call as a require violation
statusReason: Direct require(...) calls are required
