[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:225:16
       if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
       dependencies.push(moduleSpecifier(tokens[index + 2]));
       index += 3;
-    } else if (token.value === 'require' && tokens[index - 1]?.value === '.' && tokens[index + 1]?.value === '(') {
+    } else if (token.value !== 'require' && tokens[index - 1]?.value === '.' && tokens[index + 1]?.value === '(') {
       throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     }
killedBy: fail-closed import scanner rejects indirect CommonJS loading: module.require('../infra/SqlOrder')
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:232:33
   return dependencies;
 }
 
-function resolveFile(candidate) {
-  const choices = [candidate, ...SOURCE_EXTENSIONS.map((extension) => candidate + extension),
-    ...SOURCE_EXTENSIONS.map((extension) => join(candidate, `index${extension}`))];
-  return choices.find((path) => existsSync(path) && statSync(path).isFile()) ?? null;
-}
+function resolveFile(candidate) {}
 
 function resolveImport(root, sourceFile, specifier, aliases) {
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:233:71
 }
 
 function resolveFile(candidate) {
-  const choices = [candidate, ...SOURCE_EXTENSIONS.map((extension) => candidate + extension),
+  const choices = [candidate, ...SOURCE_EXTENSIONS.map((extension) => candidate - extension),
     ...SOURCE_EXTENSIONS.map((extension) => join(candidate, `index${extension}`))];
   return choices.find((path) => existsSync(path) && statSync(path).isFile()) ?? null;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:233:56
 }
 
 function resolveFile(candidate) {
-  const choices = [candidate, ...SOURCE_EXTENSIONS.map((extension) => candidate + extension),
+  const choices = [candidate, ...SOURCE_EXTENSIONS.map(() => undefined),
     ...SOURCE_EXTENSIONS.map((extension) => join(candidate, `index${extension}`))];
   return choices.find((path) => existsSync(path) && statSync(path).isFile()) ?? null;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:234:30
 
 function resolveFile(candidate) {
   const choices = [candidate, ...SOURCE_EXTENSIONS.map((extension) => candidate + extension),
-    ...SOURCE_EXTENSIONS.map((extension) => join(candidate, `index${extension}`))];
+    ...SOURCE_EXTENSIONS.map(() => undefined)];
   return choices.find((path) => existsSync(path) && statSync(path).isFile()) ?? null;
 }
killedBy: bounded resolution and deterministic diagnostics resolves an extensionless import to an index file inside a directory
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:235:23
 function resolveFile(candidate) {
   const choices = [candidate, ...SOURCE_EXTENSIONS.map((extension) => candidate + extension),
     ...SOURCE_EXTENSIONS.map((extension) => join(candidate, `index${extension}`))];
-  return choices.find((path) => existsSync(path) && statSync(path).isFile()) ?? null;
+  return choices.find(() => undefined) ?? null;
 }
 
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:235:10
 function resolveFile(candidate) {
   const choices = [candidate, ...SOURCE_EXTENSIONS.map((extension) => candidate + extension),
     ...SOURCE_EXTENSIONS.map((extension) => join(candidate, `index${extension}`))];
-  return choices.find((path) => existsSync(path) && statSync(path).isFile()) ?? null;
+  return choices.find(path => existsSync(path) && statSync(path).isFile()) && null;
 }
 
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:238:62
   return choices.find((path) => existsSync(path) && statSync(path).isFile()) ?? null;
 }
 
-function resolveImport(root, sourceFile, specifier, aliases) {
-  let candidate;
-  let internal = false;
-  let alias = false;
-  if (specifier.startsWith('.')) {
-    candidate = resolve(dirname(sourceFile), specifier);
-    internal = true;
-  } else {
-    const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
-      .find((name) => specifier === name || specifier.startsWith(name));
-    if (!key) return { external: true };
-    candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
-    internal = true;
-    alias = true;
-  }
-  if (internal && !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
-  const file = resolveFile(candidate);
-  if (!file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
-  const canonical = realpathSync(file);
-  if (!inside(root, canonical)) return { error: 'PL-ARCH-PATH-ESCAPE' };
-  return { file: canonical };
-}
+function resolveImport(root, sourceFile, specifier, aliases) {}
 
 export function checkArchitecture({ root, manifest = join(root, 'layers.map.json') }) {
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: Cannot read properties of undefined (reading 'external')

[Survived] BooleanLiteral
src/scripts/pl-arch-check.mjs:240:18
 
 function resolveImport(root, sourceFile, specifier, aliases) {
   let candidate;
-  let internal = false;
+  let internal = true;
   let alias = false;
   if (specifier.startsWith('.')) {

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:241:15
 function resolveImport(root, sourceFile, specifier, aliases) {
   let candidate;
   let internal = false;
-  let alias = false;
+  let alias = true;
   if (specifier.startsWith('.')) {
     candidate = resolve(dirname(sourceFile), specifier);
killedBy: bounded resolution and deterministic diagnostics reports an unresolved alias distinctly from an unresolved relative import
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] MethodExpression
src/scripts/pl-arch-check.mjs:242:7
   let candidate;
   let internal = false;
   let alias = false;
-  if (specifier.startsWith('.')) {
+  if (specifier.endsWith('.')) {
     candidate = resolve(dirname(sourceFile), specifier);
     internal = true;
killedBy: bounded resolution and deterministic diagnostics enforces layers rooted outside src when imported
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:242:34
   let candidate;
   let internal = false;
   let alias = false;
-  if (specifier.startsWith('.')) {
-    candidate = resolve(dirname(sourceFile), specifier);
-    internal = true;
-  } else {
+  if (specifier.startsWith('.')) {} else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
       .find((name) => specifier === name || specifier.startsWith(name));
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:244:16
   let alias = false;
   if (specifier.startsWith('.')) {
     candidate = resolve(dirname(sourceFile), specifier);
-    internal = true;
+    internal = false;
   } else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
killedBy: bounded resolution and deterministic diagnostics rejects traversal and symlink escape
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:245:10
   if (specifier.startsWith('.')) {
     candidate = resolve(dirname(sourceFile), specifier);
     internal = true;
-  } else {
-    const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
-      .find((name) => specifier === name || specifier.startsWith(name));
-    if (!key) return { external: true };
-    candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
-    internal = true;
-    alias = true;
-  }
+  } else {}
   if (internal && !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
   const file = resolveFile(candidate);
killedBy: bounded resolution and deterministic diagnostics resolves configured aliases inside root
statusReason: The "path" argument must be of type string. Received undefined

[Survived] MethodExpression
src/scripts/pl-arch-check.mjs:246:17
     candidate = resolve(dirname(sourceFile), specifier);
     internal = true;
   } else {
-    const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
+    const key = Object.keys(aliases)
       .find((name) => specifier === name || specifier.startsWith(name));
     if (!key) return { external: true };

[Survived] ArrowFunction
src/scripts/pl-arch-check.mjs:246:43
     candidate = resolve(dirname(sourceFile), specifier);
     internal = true;
   } else {
-    const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
+    const key = Object.keys(aliases).sort(() => undefined)
       .find((name) => specifier === name || specifier.startsWith(name));
     if (!key) return { external: true };

[Killed] MethodExpression
src/scripts/pl-arch-check.mjs:247:45
     internal = true;
   } else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
-      .find((name) => specifier === name || specifier.startsWith(name));
+      .find((name) => specifier === name || specifier.endsWith(name));
     if (!key) return { external: true };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
killedBy: bounded resolution and deterministic diagnostics reports an unresolved alias distinctly from an unresolved relative import
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:247:13
     internal = true;
   } else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
-      .find((name) => specifier === name || specifier.startsWith(name));
+      .find(() => undefined);
     if (!key) return { external: true };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
killedBy: bounded resolution and deterministic diagnostics reports an unresolved alias distinctly from an unresolved relative import
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:248:9
   } else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
       .find((name) => specifier === name || specifier.startsWith(name));
-    if (!key) return { external: true };
+    if (true) return { external: true };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
     internal = true;
killedBy: bounded resolution and deterministic diagnostics reports an unresolved alias distinctly from an unresolved relative import
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:248:34
   } else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
       .find((name) => specifier === name || specifier.startsWith(name));
-    if (!key) return { external: true };
+    if (!key) return { external: false };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
     internal = true;
killedBy: bounded resolution and deterministic diagnostics leaves an unrecognized bare specifier as an external dependency
statusReason: The "to" argument must be of type string. Received undefined

[Killed] MethodExpression
src/scripts/pl-arch-check.mjs:249:45
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
       .find((name) => specifier === name || specifier.startsWith(name));
     if (!key) return { external: true };
-    candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
+    candidate = resolve(root, aliases[key], specifier.replace(/^[/\\]/, ''));
     internal = true;
     alias = true;
killedBy: bounded resolution and deterministic diagnostics resolves configured aliases inside root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Survived] StringLiteral
src/scripts/pl-arch-check.mjs:249:91
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
       .find((name) => specifier === name || specifier.startsWith(name));
     if (!key) return { external: true };
-    candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
+    candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, "Stryker was here!"));
     internal = true;
     alias = true;

[Survived] BooleanLiteral
src/scripts/pl-arch-check.mjs:250:16
       .find((name) => specifier === name || specifier.startsWith(name));
     if (!key) return { external: true };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
-    internal = true;
+    internal = false;
     alias = true;
   }

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:251:13
     if (!key) return { external: true };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
     internal = true;
-    alias = true;
+    alias = false;
   }
   if (internal && !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
killedBy: bounded resolution and deterministic diagnostics reports an unresolved alias distinctly from an unresolved relative import
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:253:7
     internal = true;
     alias = true;
   }
-  if (internal && !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
+  if (true) return { error: 'PL-ARCH-PATH-ESCAPE' };
   const file = resolveFile(candidate);
   if (!file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:253:7
     internal = true;
     alias = true;
   }
-  if (internal && !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
+  if (internal || !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
   const file = resolveFile(candidate);
   if (!file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:255:7
   }
   if (internal && !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
   const file = resolveFile(candidate);
-  if (!file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
+  if (file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
   const canonical = realpathSync(file);
   if (!inside(root, canonical)) return { error: 'PL-ARCH-PATH-ESCAPE' };
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:255:7
   }
   if (internal && !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
   const file = resolveFile(candidate);
-  if (!file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
+  if (false) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
   const canonical = realpathSync(file);
   if (!inside(root, canonical)) return { error: 'PL-ARCH-PATH-ESCAPE' };
killedBy: bounded resolution and deterministic diagnostics sorts the dependencies list by file then specifier
statusReason: ENOENT: no such file or directory, lstat '/Users/ctony/work/workspace/agenticToolset-pldd-enforcement-kernel/.stryker-tmp/sandbox-AevA0S/null'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:257:7
   const file = resolveFile(candidate);
   if (!file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
   const canonical = realpathSync(file);
-  if (!inside(root, canonical)) return { error: 'PL-ARCH-PATH-ESCAPE' };
+  if (true) return { error: 'PL-ARCH-PATH-ESCAPE' };
   return { file: canonical };
 }
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:257:7
   const file = resolveFile(candidate);
   if (!file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
   const canonical = realpathSync(file);
-  if (!inside(root, canonical)) return { error: 'PL-ARCH-PATH-ESCAPE' };
+  if (false) return { error: 'PL-ARCH-PATH-ESCAPE' };
   return { file: canonical };
 }
killedBy: bounded resolution and deterministic diagnostics rejects traversal and symlink escape
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:267:7
   const dependencies = [];
   const canonicalRoot = realpathSync(root);
   let config;
-  try {
-    config = validateManifest(JSON.parse(readFileSync(manifest, 'utf8')));
-  } catch (error) {
+  try {} catch (error) {
     invalid.push(diagnostic(error.rule ?? 'PL-ARCH-INVALID-MANIFEST', projectPath(canonicalRoot, manifest), '', error.message));
     return { exitCode: 2, diagnostics: invalid, dependencies };
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'layers')

[Survived] StringLiteral
src/scripts/pl-arch-check.mjs:268:65
   const canonicalRoot = realpathSync(root);
   let config;
   try {
-    config = validateManifest(JSON.parse(readFileSync(manifest, 'utf8')));
+    config = validateManifest(JSON.parse(readFileSync(manifest, "")));
   } catch (error) {
     invalid.push(diagnostic(error.rule ?? 'PL-ARCH-INVALID-MANIFEST', projectPath(canonicalRoot, manifest), '', error.message));

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:269:19
   let config;
   try {
     config = validateManifest(JSON.parse(readFileSync(manifest, 'utf8')));
-  } catch (error) {
-    invalid.push(diagnostic(error.rule ?? 'PL-ARCH-INVALID-MANIFEST', projectPath(canonicalRoot, manifest), '', error.message));
-    return { exitCode: 2, diagnostics: invalid, dependencies };
-  }
+  } catch (error) {}
 
   const files = [...new Set(configuredSourceRoots(canonicalRoot, config.layers).flatMap(walkSources))];
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'layers')

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:270:29
   try {
     config = validateManifest(JSON.parse(readFileSync(manifest, 'utf8')));
   } catch (error) {
-    invalid.push(diagnostic(error.rule ?? 'PL-ARCH-INVALID-MANIFEST', projectPath(canonicalRoot, manifest), '', error.message));
+    invalid.push(diagnostic(error.rule && 'PL-ARCH-INVALID-MANIFEST', projectPath(canonicalRoot, manifest), '', error.message));
     return { exitCode: 2, diagnostics: invalid, dependencies };
   }
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-INVALID-MANIFEST' to be 'PL-ARCH-MANIFEST-VERSION' // Object.is equality

[Survived] StringLiteral
src/scripts/pl-arch-check.mjs:270:109
   try {
     config = validateManifest(JSON.parse(readFileSync(manifest, 'utf8')));
   } catch (error) {
-    invalid.push(diagnostic(error.rule ?? 'PL-ARCH-INVALID-MANIFEST', projectPath(canonicalRoot, manifest), '', error.message));
+    invalid.push(diagnostic(error.rule ?? 'PL-ARCH-INVALID-MANIFEST', projectPath(canonicalRoot, manifest), "Stryker was here!", error.message));
     return { exitCode: 2, diagnostics: invalid, dependencies };
   }

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:275:7
   }
 
   const files = [...new Set(configuredSourceRoots(canonicalRoot, config.layers).flatMap(walkSources))];
-  if (files.length === 0) {
+  if (true) {
     invalid.push(diagnostic('PL-ARCH-NO-SOURCES', '', '', 'Configured layer roots contain no source files'));
   }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:275:27
   }
 
   const files = [...new Set(configuredSourceRoots(canonicalRoot, config.layers).flatMap(walkSources))];
-  if (files.length === 0) {
-    invalid.push(diagnostic('PL-ARCH-NO-SOURCES', '', '', 'Configured layer roots contain no source files'));
-  }
+  if (files.length === 0) {}
   const ownership = new Map();
   for (const file of files) {
killedBy: source root discovery and file walking does not add a source root for a non-existent wildcard prefix directory
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:276:51
 
   const files = [...new Set(configuredSourceRoots(canonicalRoot, config.layers).flatMap(walkSources))];
   if (files.length === 0) {
-    invalid.push(diagnostic('PL-ARCH-NO-SOURCES', '', '', 'Configured layer roots contain no source files'));
+    invalid.push(diagnostic('PL-ARCH-NO-SOURCES', "Stryker was here!", '', 'Configured layer roots contain no source files'));
   }
   const ownership = new Map();
killedBy: bounded resolution and deterministic diagnostics fails closed when configured layer roots contain no source files
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(3 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:276:29
 
   const files = [...new Set(configuredSourceRoots(canonicalRoot, config.layers).flatMap(walkSources))];
   if (files.length === 0) {
-    invalid.push(diagnostic('PL-ARCH-NO-SOURCES', '', '', 'Configured layer roots contain no source files'));
+    invalid.push(diagnostic("", '', '', 'Configured layer roots contain no source files'));
   }
   const ownership = new Map();
killedBy: source root discovery and file walking does not add a source root for a non-existent wildcard prefix directory
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:279:29
     invalid.push(diagnostic('PL-ARCH-NO-SOURCES', '', '', 'Configured layer roots contain no source files'));
   }
   const ownership = new Map();
-  for (const file of files) {
-    const rel = projectPath(canonicalRoot, file);
-    const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
-    if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
-    else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
-    else ownership.set(file, matches[0]);
-  }
+  for (const file of files) {}
 
   for (const file of files) {
killedBy: layer manifest validation rejects unmatched and overlapping file ownership
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:281:70
   const ownership = new Map();
   for (const file of files) {
     const rel = projectPath(canonicalRoot, file);
-    const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
+    const matches = config.layers.filter((layer) => layer.globs.some(() => undefined));
     if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
     else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] MethodExpression
src/scripts/pl-arch-check.mjs:281:21
   const ownership = new Map();
   for (const file of files) {
     const rel = projectPath(canonicalRoot, file);
-    const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
+    const matches = config.layers;
     if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
     else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:282:9
   for (const file of files) {
     const rel = projectPath(canonicalRoot, file);
     const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
-    if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
+    if (true) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
     else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
     else ownership.set(file, matches[0]);
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:282:9
   for (const file of files) {
     const rel = projectPath(canonicalRoot, file);
     const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
-    if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
+    if (false) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
     else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
     else ownership.set(file, matches[0]);
killedBy: layer manifest validation rejects unmatched and overlapping file ownership
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)
