[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:283:14
     const rel = projectPath(canonicalRoot, file);
     const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
     if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
-    else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
+    else if (matches.length <= 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
     else ownership.set(file, matches[0]);
   }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:283:14
     const rel = projectPath(canonicalRoot, file);
     const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
     if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
-    else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
+    else if (true) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
     else ownership.set(file, matches[0]);
   }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:289:9
 
   for (const file of files) {
     const fromLayer = ownership.get(file);
-    if (!fromLayer) continue;
+    if (true) continue;
     const rel = projectPath(canonicalRoot, file);
     let imports;
killedBy: bounded resolution and deterministic diagnostics falls back to a default rule_id when a source-scan error has no .rule (unterminated string)
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:289:9
 
   for (const file of files) {
     const fromLayer = ownership.get(file);
-    if (!fromLayer) continue;
+    if (fromLayer) continue;
     const rel = projectPath(canonicalRoot, file);
     let imports;
killedBy: bounded resolution and deterministic diagnostics falls back to a default rule_id when a source-scan error has no .rule (unterminated string)
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:292:9
     if (!fromLayer) continue;
     const rel = projectPath(canonicalRoot, file);
     let imports;
-    try { imports = scanImports(readFileSync(file, 'utf8')); }
+    try {}
     catch (error) {
       invalid.push(diagnostic(error.rule ?? 'PL-ARCH-UNSUPPORTED-SYNTAX', rel, '', error.message));
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: imports is not iterable

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:293:19
     const rel = projectPath(canonicalRoot, file);
     let imports;
     try { imports = scanImports(readFileSync(file, 'utf8')); }
-    catch (error) {
-      invalid.push(diagnostic(error.rule ?? 'PL-ARCH-UNSUPPORTED-SYNTAX', rel, '', error.message));
-      continue;
-    }
+    catch (error) {}
     for (const specifier of imports) {
       const resolved = resolveImport(canonicalRoot, file, specifier, config.aliases);
killedBy: bounded resolution and deterministic diagnostics falls back to a default rule_id when a source-scan error has no .rule (unterminated string)
statusReason: imports is not iterable

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:294:31
     let imports;
     try { imports = scanImports(readFileSync(file, 'utf8')); }
     catch (error) {
-      invalid.push(diagnostic(error.rule ?? 'PL-ARCH-UNSUPPORTED-SYNTAX', rel, '', error.message));
+      invalid.push(diagnostic(error.rule && 'PL-ARCH-UNSUPPORTED-SYNTAX', rel, '', error.message));
       continue;
     }
killedBy: bounded resolution and deterministic diagnostics falls back to a default rule_id when a source-scan error has no .rule (unterminated string)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:297:38
       invalid.push(diagnostic(error.rule ?? 'PL-ARCH-UNSUPPORTED-SYNTAX', rel, '', error.message));
       continue;
     }
-    for (const specifier of imports) {
-      const resolved = resolveImport(canonicalRoot, file, specifier, config.aliases);
-      if (resolved.external) {
-        dependencies.push({ file: rel, specifier, dependency: specifier });
-        if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
-        continue;
-      }
-      if (resolved.error) {
-        invalid.push(diagnostic(resolved.error, rel, specifier,
-          resolved.error === 'PL-ARCH-PATH-ESCAPE' ? 'Resolved path escapes project root' : `Cannot resolve internal import ${specifier}`));
-        continue;
-      }
-      const dependency = projectPath(canonicalRoot, resolved.file);
-      dependencies.push({ file: rel, specifier, dependency });
-      const toLayer = ownership.get(resolved.file);
-      if (!toLayer) continue;
-      if (!fromLayer.may_import.includes(toLayer.name)) {
-        violations.push(diagnostic('PL-ARCH-FORBIDDEN-IMPORT', rel, dependency,
-          `Layer ${fromLayer.name} may not import ${toLayer.name}`));
-      }
-    }
+    for (const specifier of imports) {}
   }
 
killedBy: bounded resolution and deterministic diagnostics sorts the dependencies list by file then specifier
statusReason: expected 0 to be greater than 1

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:299:11
     }
     for (const specifier of imports) {
       const resolved = resolveImport(canonicalRoot, file, specifier, config.aliases);
-      if (resolved.external) {
+      if (false) {
         dependencies.push({ file: rel, specifier, dependency: specifier });
         if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
killedBy: bounded resolution and deterministic diagnostics leaves an unrecognized bare specifier as an external dependency
statusReason: The "to" argument must be of type string. Received undefined

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:299:11
     }
     for (const specifier of imports) {
       const resolved = resolveImport(canonicalRoot, file, specifier, config.aliases);
-      if (resolved.external) {
+      if (true) {
         dependencies.push({ file: rel, specifier, dependency: specifier });
         if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
killedBy: bounded resolution and deterministic diagnostics enforces layers rooted outside src when imported
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ObjectLiteral
src/scripts/pl-arch-check.mjs:300:27
     for (const specifier of imports) {
       const resolved = resolveImport(canonicalRoot, file, specifier, config.aliases);
       if (resolved.external) {
-        dependencies.push({ file: rel, specifier, dependency: specifier });
+        dependencies.push({});
         if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
         continue;
killedBy: bounded resolution and deterministic diagnostics leaves an unrecognized bare specifier as an external dependency
statusReason: expected [ {} ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:301:13
       const resolved = resolveImport(canonicalRoot, file, specifier, config.aliases);
       if (resolved.external) {
         dependencies.push({ file: rel, specifier, dependency: specifier });
-        if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
+        if (true) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
         continue;
       }
killedBy: bounded resolution and deterministic diagnostics leaves an unrecognized bare specifier as an external dependency
statusReason: expected { exitCode: 1, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:301:13
       const resolved = resolveImport(canonicalRoot, file, specifier, config.aliases);
       if (resolved.external) {
         dependencies.push({ file: rel, specifier, dependency: specifier });
-        if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
+        if (config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
         continue;
       }
killedBy: bounded resolution and deterministic diagnostics leaves an unrecognized bare specifier as an external dependency
statusReason: expected { exitCode: 1, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:304:27
         if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
         continue;
       }
-      if (resolved.error) {
-        invalid.push(diagnostic(resolved.error, rel, specifier,
-          resolved.error === 'PL-ARCH-PATH-ESCAPE' ? 'Resolved path escapes project root' : `Cannot resolve internal import ${specifier}`));
-        continue;
-      }
+      if (resolved.error) {}
       const dependency = projectPath(canonicalRoot, resolved.file);
       dependencies.push({ file: rel, specifier, dependency });
killedBy: bounded resolution and deterministic diagnostics sorts the dependencies list by file then specifier
statusReason: The "to" argument must be of type string. Received undefined

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:304:11
         if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
         continue;
       }
-      if (resolved.error) {
+      if (false) {
         invalid.push(diagnostic(resolved.error, rel, specifier,
           resolved.error === 'PL-ARCH-PATH-ESCAPE' ? 'Resolved path escapes project root' : `Cannot resolve internal import ${specifier}`));
killedBy: bounded resolution and deterministic diagnostics sorts the dependencies list by file then specifier
statusReason: The "to" argument must be of type string. Received undefined

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:306:11
       }
       if (resolved.error) {
         invalid.push(diagnostic(resolved.error, rel, specifier,
-          resolved.error === 'PL-ARCH-PATH-ESCAPE' ? 'Resolved path escapes project root' : `Cannot resolve internal import ${specifier}`));
+          false ? 'Resolved path escapes project root' : `Cannot resolve internal import ${specifier}`));
         continue;
       }
killedBy: bounded resolution and deterministic diagnostics rejects traversal and symlink escape
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:306:11
       }
       if (resolved.error) {
         invalid.push(diagnostic(resolved.error, rel, specifier,
-          resolved.error === 'PL-ARCH-PATH-ESCAPE' ? 'Resolved path escapes project root' : `Cannot resolve internal import ${specifier}`));
+          true ? 'Resolved path escapes project root' : `Cannot resolve internal import ${specifier}`));
         continue;
       }
killedBy: bounded resolution and deterministic diagnostics reports an unresolved alias distinctly from an unresolved relative import
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Survived] ObjectLiteral
src/scripts/pl-arch-check.mjs:310:25
         continue;
       }
       const dependency = projectPath(canonicalRoot, resolved.file);
-      dependencies.push({ file: rel, specifier, dependency });
+      dependencies.push({});
       const toLayer = ownership.get(resolved.file);
       if (!toLayer) continue;

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:312:11
       const dependency = projectPath(canonicalRoot, resolved.file);
       dependencies.push({ file: rel, specifier, dependency });
       const toLayer = ownership.get(resolved.file);
-      if (!toLayer) continue;
+      if (toLayer) continue;
       if (!fromLayer.may_import.includes(toLayer.name)) {
         violations.push(diagnostic('PL-ARCH-FORBIDDEN-IMPORT', rel, dependency,
killedBy: bounded resolution and deterministic diagnostics enforces layers rooted outside src when imported
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:312:11
       const dependency = projectPath(canonicalRoot, resolved.file);
       dependencies.push({ file: rel, specifier, dependency });
       const toLayer = ownership.get(resolved.file);
-      if (!toLayer) continue;
+      if (true) continue;
       if (!fromLayer.may_import.includes(toLayer.name)) {
         violations.push(diagnostic('PL-ARCH-FORBIDDEN-IMPORT', rel, dependency,
killedBy: bounded resolution and deterministic diagnostics enforces layers rooted outside src when imported
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:313:57
       dependencies.push({ file: rel, specifier, dependency });
       const toLayer = ownership.get(resolved.file);
       if (!toLayer) continue;
-      if (!fromLayer.may_import.includes(toLayer.name)) {
-        violations.push(diagnostic('PL-ARCH-FORBIDDEN-IMPORT', rel, dependency,
-          `Layer ${fromLayer.name} may not import ${toLayer.name}`));
-      }
+      if (!fromLayer.may_import.includes(toLayer.name)) {}
     }
   }
killedBy: bounded resolution and deterministic diagnostics enforces layers rooted outside src when imported
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:313:11
       dependencies.push({ file: rel, specifier, dependency });
       const toLayer = ownership.get(resolved.file);
       if (!toLayer) continue;
-      if (!fromLayer.may_import.includes(toLayer.name)) {
+      if (false) {
         violations.push(diagnostic('PL-ARCH-FORBIDDEN-IMPORT', rel, dependency,
           `Layer ${fromLayer.name} may not import ${toLayer.name}`));
killedBy: bounded resolution and deterministic diagnostics enforces layers rooted outside src when imported
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:314:36
       const toLayer = ownership.get(resolved.file);
       if (!toLayer) continue;
       if (!fromLayer.may_import.includes(toLayer.name)) {
-        violations.push(diagnostic('PL-ARCH-FORBIDDEN-IMPORT', rel, dependency,
+        violations.push(diagnostic("", rel, dependency,
           `Layer ${fromLayer.name} may not import ${toLayer.name}`));
       }
killedBy: bounded resolution and deterministic diagnostics enforces layers rooted outside src when imported
statusReason: expected { exitCode: 1, …(2) } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(6 matching properties omitted from actual)

[Survived] ArrowFunction
src/scripts/pl-arch-check.mjs:320:56
     }
   }
 
-  const diagnostics = [...invalid, ...violations].sort((a, b) =>
-    `${a.file}\0${a.rule_id}\0${a.dependency}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.dependency}`));
+  const diagnostics = [...invalid, ...violations].sort(() => undefined);
   dependencies.sort((a, b) => `${a.file}\0${a.specifier}`.localeCompare(`${b.file}\0${b.specifier}`));
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics, dependencies };

[Survived] MethodExpression
src/scripts/pl-arch-check.mjs:320:23
     }
   }
 
-  const diagnostics = [...invalid, ...violations].sort((a, b) =>
-    `${a.file}\0${a.rule_id}\0${a.dependency}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.dependency}`));
+  const diagnostics = [...invalid, ...violations];
   dependencies.sort((a, b) => `${a.file}\0${a.specifier}`.localeCompare(`${b.file}\0${b.specifier}`));
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics, dependencies };

[NoCoverage] StringLiteral
src/scripts/pl-arch-check.mjs:321:5
   }
 
   const diagnostics = [...invalid, ...violations].sort((a, b) =>
-    `${a.file}\0${a.rule_id}\0${a.dependency}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.dependency}`));
+    ``.localeCompare(`${b.file}\0${b.rule_id}\0${b.dependency}`));
   dependencies.sort((a, b) => `${a.file}\0${a.specifier}`.localeCompare(`${b.file}\0${b.specifier}`));
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics, dependencies };

[Survived] ArrowFunction
src/scripts/pl-arch-check.mjs:322:21
 
   const diagnostics = [...invalid, ...violations].sort((a, b) =>
     `${a.file}\0${a.rule_id}\0${a.dependency}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.dependency}`));
-  dependencies.sort((a, b) => `${a.file}\0${a.specifier}`.localeCompare(`${b.file}\0${b.specifier}`));
+  dependencies.sort(() => undefined);
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics, dependencies };
 }

[Survived] MethodExpression
src/scripts/pl-arch-check.mjs:322:3
 
   const diagnostics = [...invalid, ...violations].sort((a, b) =>
     `${a.file}\0${a.rule_id}\0${a.dependency}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.dependency}`));
-  dependencies.sort((a, b) => `${a.file}\0${a.specifier}`.localeCompare(`${b.file}\0${b.specifier}`));
+  dependencies;
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics, dependencies };
 }

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:326:26
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics, dependencies };
 }
 
-function parseArgs(args) {
-  const options = { root: process.cwd(), manifest: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
-    const key = args[index];
-    if (key === '--root') options.root = resolve(args[++index]);
-    else if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
-    else throw new Error(`Unknown argument: ${key}`);
-  }
-  return options;
-}
+function parseArgs(args) {}
 
 if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '' to contain 'PL-ARCH-NO-SOURCES'

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:328:23
 
 function parseArgs(args) {
   const options = { root: process.cwd(), manifest: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
+  for (let index = 0; index <= args.length; index += 1) {
     const key = args[index];
     if (key === '--root') options.root = resolve(args[++index]);
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '' to contain 'PL-ARCH-NO-SOURCES'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:328:23
 
 function parseArgs(args) {
   const options = { root: process.cwd(), manifest: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
+  for (let index = 0; false; index += 1) {
     const key = args[index];
     if (key === '--root') options.root = resolve(args[++index]);
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 'PL-ARCH-INVALID-MANIFEST layers.map.j…' to contain 'PL-ARCH-NO-SOURCES'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:330:9
   const options = { root: process.cwd(), manifest: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
-    if (key === '--root') options.root = resolve(args[++index]);
+    if (false) options.root = resolve(args[++index]);
     else if (key === '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '' to contain 'PL-ARCH-NO-SOURCES'

[Killed] UpdateOperator
src/scripts/pl-arch-check.mjs:330:55
   const options = { root: process.cwd(), manifest: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
-    if (key === '--root') options.root = resolve(args[++index]);
+    if (key === '--root') options.root = resolve(args[--index]);
     else if (key === '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '' to contain 'PL-ARCH-NO-SOURCES'

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:331:14
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
     if (key === '--root') options.root = resolve(args[++index]);
-    else if (key === '--manifest') options.manifest = resolve(args[++index]);
+    else if (key !== '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
killedBy: pl-arch-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: Unexpected token 'P', "PL-ARCH-IN"... is not valid JSON

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:331:14
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
     if (key === '--root') options.root = resolve(args[++index]);
-    else if (key === '--manifest') options.manifest = resolve(args[++index]);
+    else if (false) options.manifest = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
killedBy: pl-arch-check CLI entrypoint guard (in-process) honors an explicit --manifest path instead of the default layers.map.json
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:332:14
     const key = args[index];
     if (key === '--root') options.root = resolve(args[++index]);
     else if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
+    else if (true) options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
   }
killedBy: pl-arch-check CLI entrypoint guard (in-process) reports an unknown CLI argument via the catch block with exit 2
statusReason: expected '' to be 'Unknown argument: --bogus\n' // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:332:14
     const key = args[index];
     if (key === '--root') options.root = resolve(args[++index]);
     else if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
+    else if (key !== '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
   }
killedBy: pl-arch-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: Unexpected end of JSON input

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:338:5
   return options;
 }
 
-if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
+if (true) {
   try {
     const options = parseArgs(process.argv.slice(2));
killedBy: pl-arch-check CLI entrypoint guard (in-process) does not run the CLI block when argv[1] is empty
statusReason: expected 2 to be undefined

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:338:24
   return options;
 }
 
-if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
+if (process.argv[1] && true) {
   try {
     const options = parseArgs(process.argv.slice(2));
killedBy: pl-arch-check CLI entrypoint guard (in-process) does not run the CLI block when argv[1] resolves to a different module
statusReason: expected 2 to be undefined

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:339:7
 }
 
 if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
-  try {
-    const options = parseArgs(process.argv.slice(2));
-    const result = checkArchitecture({ root: options.root, manifest: options.manifest ?? join(options.root, 'layers.map.json') });
-    const output = options.format === 'json'
-      ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
-      : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : '');
-    process.stdout.write(output);
-    process.exitCode = result.exitCode;
-  } catch (error) {
+  try {} catch (error) {
     process.stderr.write(`${error.message}\n`);
     process.exitCode = 2;
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected undefined to be 2 // Object.is equality

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:341:70
 if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
   try {
     const options = parseArgs(process.argv.slice(2));
-    const result = checkArchitecture({ root: options.root, manifest: options.manifest ?? join(options.root, 'layers.map.json') });
+    const result = checkArchitecture({ root: options.root, manifest: options.manifest && join(options.root, 'layers.map.json') });
     const output = options.format === 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '' to contain 'PL-ARCH-NO-SOURCES'

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:342:20
   try {
     const options = parseArgs(process.argv.slice(2));
     const result = checkArchitecture({ root: options.root, manifest: options.manifest ?? join(options.root, 'layers.map.json') });
-    const output = options.format === 'json'
+    const output = options.format !== 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : '');
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '[\n  {\n    "version": "1",\n    "rul…' not to contain '{'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:342:20
   try {
     const options = parseArgs(process.argv.slice(2));
     const result = checkArchitecture({ root: options.root, manifest: options.manifest ?? join(options.root, 'layers.map.json') });
-    const output = options.format === 'json'
+    const output = true
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : '');
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '[\n  {\n    "version": "1",\n    "rul…' not to contain '{'
