[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:344:9
     const result = checkArchitecture({ root: options.root, manifest: options.manifest ?? join(options.root, 'layers.map.json') });
     const output = options.format === 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
-      : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : '');
+      : result.diagnostics.map(item => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') - (result.diagnostics.length ? '\n' : '');
     process.stdout.write(output);
     process.exitCode = result.exitCode;
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 'NaN' to contain 'PL-ARCH-NO-SOURCES'

[Killed] ArrowFunction
src/scripts/pl-arch-check.mjs:344:32
     const result = checkArchitecture({ root: options.root, manifest: options.manifest ?? join(options.root, 'layers.map.json') });
     const output = options.format === 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
-      : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : '');
+      : result.diagnostics.map(() => undefined).join('\n') + (result.diagnostics.length ? '\n' : '');
     process.stdout.write(output);
     process.exitCode = result.exitCode;
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '\n' to contain 'PL-ARCH-NO-SOURCES'

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:348:26
     process.stdout.write(output);
     process.exitCode = result.exitCode;
   } catch (error) {
-    process.stderr.write(`${error.message}\n`);
+    process.stderr.write(``);
     process.exitCode = 2;
   }
killedBy: pl-arch-check CLI entrypoint guard (in-process) reports an unknown CLI argument via the catch block with exit 2
statusReason: expected '' to be 'Unknown argument: --bogus\n' // Object.is equality
