[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:9:75
 
 import { lexSource } from './pl-arch-check.mjs';
 
-const EXTENSIONS = new Set(['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs']);
+const EXTENSIONS = new Set(['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', "", '.cjs']);
 const CONTRACTS = new Set(['requires', 'ensures', 'invariant']);
 const TESTS = new Set(['it', 'test']);
killedBy: source/test file expansion recognizes every supported extension and excludes unsupported ones
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:9:44
 
 import { lexSource } from './pl-arch-check.mjs';
 
-const EXTENSIONS = new Set(['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs']);
+const EXTENSIONS = new Set(['.ts', '.tsx', "", '.jsx', '.mts', '.cts', '.mjs', '.cjs']);
 const CONTRACTS = new Set(['requires', 'ensures', 'invariant']);
 const TESTS = new Set(['it', 'test']);
killedBy: source/test file expansion recognizes every supported extension and excludes unsupported ones
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:10:51
 import { lexSource } from './pl-arch-check.mjs';
 
 const EXTENSIONS = new Set(['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs']);
-const CONTRACTS = new Set(['requires', 'ensures', 'invariant']);
+const CONTRACTS = new Set(['requires', 'ensures', ""]);
 const TESTS = new Set(['it', 'test']);
 const ID = /\b[A-Z][A-Z0-9]+(?:-[A-Z0-9]+)+\b/g;
killedBy: contract identity checker recognizes invariant() as a contract declaration on its own
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArrayDeclaration
src/scripts/pl-contract-check.mjs:11:23
 
 const EXTENSIONS = new Set(['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs']);
 const CONTRACTS = new Set(['requires', 'ensures', 'invariant']);
-const TESTS = new Set(['it', 'test']);
+const TESTS = new Set([]);
 const ID = /\b[A-Z][A-Z0-9]+(?:-[A-Z0-9]+)+\b/g;
 const slash = (value) => value.replaceAll('\\', '/');
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] Regex
src/scripts/pl-contract-check.mjs:12:12
 const EXTENSIONS = new Set(['.ts', '.tsx', '.js', '.jsx', '.mts', '.cts', '.mjs', '.cjs']);
 const CONTRACTS = new Set(['requires', 'ensures', 'invariant']);
 const TESTS = new Set(['it', 'test']);
-const ID = /\b[A-Z][A-Z0-9]+(?:-[A-Z0-9]+)+\b/g;
+const ID = /\b[A-Z][A-Z0-9]+(?:-[A-Z0-9]+)\b/g;
 const slash = (value) => value.replaceAll('\\', '/');
 const diagnostic = (rule_id, file, message) => ({
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArrowFunction
src/scripts/pl-contract-check.mjs:13:15
 const CONTRACTS = new Set(['requires', 'ensures', 'invariant']);
 const TESTS = new Set(['it', 'test']);
 const ID = /\b[A-Z][A-Z0-9]+(?:-[A-Z0-9]+)+\b/g;
-const slash = (value) => value.replaceAll('\\', '/');
+const slash = () => undefined;
 const diagnostic = (rule_id, file, message) => ({
   version: '1', rule_id, severity: 'error', file, dependency: '', message,
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ArrowFunction
src/scripts/pl-contract-check.mjs:14:20
 const TESTS = new Set(['it', 'test']);
 const ID = /\b[A-Z][A-Z0-9]+(?:-[A-Z0-9]+)+\b/g;
 const slash = (value) => value.replaceAll('\\', '/');
-const diagnostic = (rule_id, file, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency: '', message,
-});
+const diagnostic = () => undefined;
 
 const inside = (root, value) => {
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:15:63
 const ID = /\b[A-Z][A-Z0-9]+(?:-[A-Z0-9]+)+\b/g;
 const slash = (value) => value.replaceAll('\\', '/');
 const diagnostic = (rule_id, file, message) => ({
-  version: '1', rule_id, severity: 'error', file, dependency: '', message,
+  version: '1', rule_id, severity: 'error', file, dependency: "Stryker was here!", message,
 });
 
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:18:33
   version: '1', rule_id, severity: 'error', file, dependency: '', message,
 });
 
-const inside = (root, value) => {
-  const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
-};
+const inside = (root, value) => {};
 
 function expand(paths, root) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] BooleanLiteral
src/scripts/pl-contract-check.mjs:20:25
 
 const inside = (root, value) => {
   const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
+  return rel === '' || (rel.startsWith('..') && !isAbsolute(rel));
 };
 
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:20:10
 
 const inside = (root, value) => {
   const rel = relative(root, value);
-  return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
+  return rel !== '' || (!rel.startsWith('..') && !isAbsolute(rel));
 };
 
killedBy: contract identity checker rejects contract evidence outside project root
statusReason: expected { exitCode: +0, diagnostics: [] } to match object { exitCode: 2, diagnostics: [ …(1) ] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:23:30
   return rel === '' || (!rel.startsWith('..') && !isAbsolute(rel));
 };
 
-function expand(paths, root) {
-  const files = [];
-  const escaped = [];
-  const visited = new Set();
-  const walk = (path) => {
-    const canonical = realpathSync(path);
-    if (!inside(root, canonical)) {
-      escaped.push(canonical);
-      return;
-    }
-    if (visited.has(canonical)) return;
-    visited.add(canonical);
-    const stat = statSync(canonical);
-    if (stat.isDirectory()) {
-      for (const entry of readdirSync(canonical).sort()) walk(join(canonical, entry));
-    } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
-  };
-  for (const path of paths) walk(path);
-  return { files: [...new Set(files)].sort((a, b) => slash(a).localeCompare(slash(b))), escaped };
-}
+function expand(paths, root) {}
 
 function secondArgumentString(tokens, start) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: Cannot read properties of undefined (reading 'escaped')

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:27:26
   const files = [];
   const escaped = [];
   const visited = new Set();
-  const walk = (path) => {
-    const canonical = realpathSync(path);
-    if (!inside(root, canonical)) {
-      escaped.push(canonical);
-      return;
-    }
-    if (visited.has(canonical)) return;
-    visited.add(canonical);
-    const stat = statSync(canonical);
-    if (stat.isDirectory()) {
-      for (const entry of readdirSync(canonical).sort()) walk(join(canonical, entry));
-    } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
-  };
+  const walk = (path) => {};
   for (const path of paths) walk(path);
   return { files: [...new Set(files)].sort((a, b) => slash(a).localeCompare(slash(b))), escaped };
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:29:9
   const visited = new Set();
   const walk = (path) => {
     const canonical = realpathSync(path);
-    if (!inside(root, canonical)) {
+    if (true) {
       escaped.push(canonical);
       return;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:29:9
   const visited = new Set();
   const walk = (path) => {
     const canonical = realpathSync(path);
-    if (!inside(root, canonical)) {
+    if (false) {
       escaped.push(canonical);
       return;
killedBy: contract identity checker rejects contract evidence outside project root
statusReason: expected { exitCode: +0, diagnostics: [] } to match object { exitCode: 2, diagnostics: [ …(1) ] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:33:9
       escaped.push(canonical);
       return;
     }
-    if (visited.has(canonical)) return;
+    if (true) return;
     visited.add(canonical);
     const stat = statSync(canonical);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Survived] ConditionalExpression
src/scripts/pl-contract-check.mjs:33:9
       escaped.push(canonical);
       return;
     }
-    if (visited.has(canonical)) return;
+    if (false) return;
     visited.add(canonical);
     const stat = statSync(canonical);

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:36:9
     if (visited.has(canonical)) return;
     visited.add(canonical);
     const stat = statSync(canonical);
-    if (stat.isDirectory()) {
+    if (false) {
       for (const entry of readdirSync(canonical).sort()) walk(join(canonical, entry));
     } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: 2, diagnostics: [ …(1) ] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:36:9
     if (visited.has(canonical)) return;
     visited.add(canonical);
     const stat = statSync(canonical);
-    if (stat.isDirectory()) {
+    if (true) {
       for (const entry of readdirSync(canonical).sort()) walk(join(canonical, entry));
     } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: ENOTDIR: not a directory, scandir '/private/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-contract-JhBLC6/src/order.ts'

[Survived] MethodExpression
src/scripts/pl-contract-check.mjs:37:27
     visited.add(canonical);
     const stat = statSync(canonical);
     if (stat.isDirectory()) {
-      for (const entry of readdirSync(canonical).sort()) walk(join(canonical, entry));
+      for (const entry of readdirSync(canonical)) walk(join(canonical, entry));
     } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
   };

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:38:16
     const stat = statSync(canonical);
     if (stat.isDirectory()) {
       for (const entry of readdirSync(canonical).sort()) walk(join(canonical, entry));
-    } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
+    } else if (true) files.push(canonical);
   };
   for (const path of paths) walk(path);
killedBy: source/test file expansion recognizes every supported extension and excludes unsupported ones
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:38:16
     const stat = statSync(canonical);
     if (stat.isDirectory()) {
       for (const entry of readdirSync(canonical).sort()) walk(join(canonical, entry));
-    } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
+    } else if (false) files.push(canonical);
   };
   for (const path of paths) walk(path);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Survived] ArrowFunction
src/scripts/pl-contract-check.mjs:41:44
     } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
   };
   for (const path of paths) walk(path);
-  return { files: [...new Set(files)].sort((a, b) => slash(a).localeCompare(slash(b))), escaped };
+  return { files: [...new Set(files)].sort(() => undefined), escaped };
 }
 

[Survived] MethodExpression
src/scripts/pl-contract-check.mjs:41:19
     } else if (EXTENSIONS.has(extname(canonical))) files.push(canonical);
   };
   for (const path of paths) walk(path);
-  return { files: [...new Set(files)].sort((a, b) => slash(a).localeCompare(slash(b))), escaped };
+  return { files: [...new Set(files)], escaped };
 }
 

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:44:46
   return { files: [...new Set(files)].sort((a, b) => slash(a).localeCompare(slash(b))), escaped };
 }
 
-function secondArgumentString(tokens, start) {
-  if (tokens[start + 1]?.value !== '(') return null;
-  let depth = 0;
-  let commas = 0;
-  for (let index = start + 1; index < tokens.length; index += 1) {
-    const token = tokens[index];
-    if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
-    else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
-    else if (token.value === ',' && depth === 1) commas += 1;
-    else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
-    if (depth === 0) break;
-  }
-  return null;
-}
+function secondArgumentString(tokens, start) {}
 
 function findCallEnd(tokens, openIndex) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:45:7
 }
 
 function secondArgumentString(tokens, start) {
-  if (tokens[start + 1]?.value !== '(') return null;
+  if (tokens[start + 1]?.value === '(') return null;
   let depth = 0;
   let commas = 0;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:45:7
 }
 
 function secondArgumentString(tokens, start) {
-  if (tokens[start + 1]?.value !== '(') return null;
+  if (true) return null;
   let depth = 0;
   let commas = 0;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] AssignmentOperator
src/scripts/pl-contract-check.mjs:48:54
   if (tokens[start + 1]?.value !== '(') return null;
   let depth = 0;
   let commas = 0;
-  for (let index = start + 1; index < tokens.length; index += 1) {
+  for (let index = start + 1; index < tokens.length; index -= 1) {
     const token = tokens[index];
     if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:48:31
   if (tokens[start + 1]?.value !== '(') return null;
   let depth = 0;
   let commas = 0;
-  for (let index = start + 1; index < tokens.length; index += 1) {
+  for (let index = start + 1; false; index += 1) {
     const token = tokens[index];
     if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] AssignmentOperator
src/scripts/pl-contract-check.mjs:50:76
   let commas = 0;
   for (let index = start + 1; index < tokens.length; index += 1) {
     const token = tokens[index];
-    if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
+    if (token.value === '(' || token.value === '[' || token.value === '{') depth -= 1;
     else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
     else if (token.value === ',' && depth === 1) commas += 1;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:50:9
   let commas = 0;
   for (let index = start + 1; index < tokens.length; index += 1) {
     const token = tokens[index];
-    if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
+    if ((token.value === '(' || token.value === '[') && token.value === '{') depth += 1;
     else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
     else if (token.value === ',' && depth === 1) commas += 1;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:51:37
   for (let index = start + 1; index < tokens.length; index += 1) {
     const token = tokens[index];
     if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
-    else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
+    else if (token.value === ')' || false || token.value === '}') depth -= 1;
     else if (token.value === ',' && depth === 1) commas += 1;
     else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
killedBy: call-argument scanning edge cases does not count a comma nested inside array/object literal first arguments
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:51:60
   for (let index = start + 1; index < tokens.length; index += 1) {
     const token = tokens[index];
     if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
-    else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
+    else if (token.value === ')' || token.value === ']' || token.value !== '}') depth -= 1;
     else if (token.value === ',' && depth === 1) commas += 1;
     else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:52:14
     const token = tokens[index];
     if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
     else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
-    else if (token.value === ',' && depth === 1) commas += 1;
+    else if (token.value === ',' || depth === 1) commas += 1;
     else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
     if (depth === 0) break;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:52:14
     const token = tokens[index];
     if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
     else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
-    else if (token.value === ',' && depth === 1) commas += 1;
+    else if (token.value !== ',' && depth === 1) commas += 1;
     else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
     if (depth === 0) break;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:53:14
     if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
     else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
     else if (token.value === ',' && depth === 1) commas += 1;
-    else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
+    else if (false) return token.type === 'string' ? token.value : null;
     if (depth === 0) break;
   }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:53:14
     if (token.value === '(' || token.value === '[' || token.value === '{') depth += 1;
     else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
     else if (token.value === ',' && depth === 1) commas += 1;
-    else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
+    else if (commas === 1 || depth === 1) return token.type === 'string' ? token.value : null;
     if (depth === 0) break;
   }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:54:9
     else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
     else if (token.value === ',' && depth === 1) commas += 1;
     else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
-    if (depth === 0) break;
+    if (true) break;
   }
   return null;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:54:9
     else if (token.value === ')' || token.value === ']' || token.value === '}') depth -= 1;
     else if (token.value === ',' && depth === 1) commas += 1;
     else if (commas === 1 && depth === 1) return token.type === 'string' ? token.value : null;
-    if (depth === 0) break;
+    if (depth !== 0) break;
   }
   return null;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Survived] BlockStatement
src/scripts/pl-contract-check.mjs:59:41
   return null;
 }
 
-function findCallEnd(tokens, openIndex) {
-  let depth = 0;
-  for (let index = openIndex; index < tokens.length; index += 1) {
-    if (tokens[index].value === '(') depth += 1;
-    else if (tokens[index].value === ')' && --depth === 0) return index;
-  }
-  return null;
-}
+function findCallEnd(tokens, openIndex) {}
 
 export function checkContracts({ root, sourceFiles, testFiles }) {

[Killed] AssignmentOperator
src/scripts/pl-contract-check.mjs:61:54
 
 function findCallEnd(tokens, openIndex) {
   let depth = 0;
-  for (let index = openIndex; index < tokens.length; index += 1) {
+  for (let index = openIndex; index < tokens.length; index -= 1) {
     if (tokens[index].value === '(') depth += 1;
     else if (tokens[index].value === ')' && --depth === 0) return index;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: Cannot read properties of undefined (reading 'value')

[Survived] ConditionalExpression
src/scripts/pl-contract-check.mjs:61:31
 
 function findCallEnd(tokens, openIndex) {
   let depth = 0;
-  for (let index = openIndex; index < tokens.length; index += 1) {
+  for (let index = openIndex; false; index += 1) {
     if (tokens[index].value === '(') depth += 1;
     else if (tokens[index].value === ')' && --depth === 0) return index;

[Survived] AssignmentOperator
src/scripts/pl-contract-check.mjs:62:38
 function findCallEnd(tokens, openIndex) {
   let depth = 0;
   for (let index = openIndex; index < tokens.length; index += 1) {
-    if (tokens[index].value === '(') depth += 1;
+    if (tokens[index].value === '(') depth -= 1;
     else if (tokens[index].value === ')' && --depth === 0) return index;
   }

[Survived] ConditionalExpression
src/scripts/pl-contract-check.mjs:62:9
 function findCallEnd(tokens, openIndex) {
   let depth = 0;
   for (let index = openIndex; index < tokens.length; index += 1) {
-    if (tokens[index].value === '(') depth += 1;
+    if (false) depth += 1;
     else if (tokens[index].value === ')' && --depth === 0) return index;
   }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:63:14
   let depth = 0;
   for (let index = openIndex; index < tokens.length; index += 1) {
     if (tokens[index].value === '(') depth += 1;
-    else if (tokens[index].value === ')' && --depth === 0) return index;
+    else if (tokens[index].value === ')' || --depth === 0) return index;
   }
   return null;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:63:45
   let depth = 0;
   for (let index = openIndex; index < tokens.length; index += 1) {
     if (tokens[index].value === '(') depth += 1;
-    else if (tokens[index].value === ')' && --depth === 0) return index;
+    else if (tokens[index].value === ')' && --depth !== 0) return index;
   }
   return null;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArrayDeclaration
src/scripts/pl-contract-check.mjs:73:30
   const declarations = [];
   const tests = [];
   const invalid = [];
-  const evidenceViolations = [];
+  const evidenceViolations = ["Stryker was here"];
   const sources = expand(sourceFiles.map((path) => resolve(path)), canonicalRoot);
   const testInputs = expand(testFiles.map((path) => resolve(path)), canonicalRoot);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, …(1) } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArrowFunction
src/scripts/pl-contract-check.mjs:74:42
   const tests = [];
   const invalid = [];
   const evidenceViolations = [];
-  const sources = expand(sourceFiles.map((path) => resolve(path)), canonicalRoot);
+  const sources = expand(sourceFiles.map(() => undefined), canonicalRoot);
   const testInputs = expand(testFiles.map((path) => resolve(path)), canonicalRoot);
   for (const path of [...sources.escaped, ...testInputs.escaped]) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: ENOENT: no such file or directory, lstat '/Users/ctony/work/workspace/agenticToolset-pldd-enforcement-kernel/.stryker-tmp/sandbox-AevA0S/undefined'

[Killed] ArrowFunction
src/scripts/pl-contract-check.mjs:75:43
   const invalid = [];
   const evidenceViolations = [];
   const sources = expand(sourceFiles.map((path) => resolve(path)), canonicalRoot);
-  const testInputs = expand(testFiles.map((path) => resolve(path)), canonicalRoot);
+  const testInputs = expand(testFiles.map(() => undefined), canonicalRoot);
   for (const path of [...sources.escaped, ...testInputs.escaped]) {
     invalid.push(diagnostic('PL-CONTRACT-PATH-ESCAPE', slash(relative(canonicalRoot, path)), 'Contract evidence must stay inside project root'));
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: ENOENT: no such file or directory, lstat '/Users/ctony/work/workspace/agenticToolset-pldd-enforcement-kernel/.stryker-tmp/sandbox-AevA0S/undefined'
