[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:76:67
   const evidenceViolations = [];
   const sources = expand(sourceFiles.map((path) => resolve(path)), canonicalRoot);
   const testInputs = expand(testFiles.map((path) => resolve(path)), canonicalRoot);
-  for (const path of [...sources.escaped, ...testInputs.escaped]) {
-    invalid.push(diagnostic('PL-CONTRACT-PATH-ESCAPE', slash(relative(canonicalRoot, path)), 'Contract evidence must stay inside project root'));
-  }
+  for (const path of [...sources.escaped, ...testInputs.escaped]) {}
   if (invalid.length) return { exitCode: 2, diagnostics: invalid };
 
killedBy: contract identity checker rejects contract evidence outside project root
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] ArrayDeclaration
src/scripts/pl-contract-check.mjs:76:22
   const evidenceViolations = [];
   const sources = expand(sourceFiles.map((path) => resolve(path)), canonicalRoot);
   const testInputs = expand(testFiles.map((path) => resolve(path)), canonicalRoot);
-  for (const path of [...sources.escaped, ...testInputs.escaped]) {
+  for (const path of []) {
     invalid.push(diagnostic('PL-CONTRACT-PATH-ESCAPE', slash(relative(canonicalRoot, path)), 'Contract evidence must stay inside project root'));
   }
killedBy: contract identity checker rejects contract evidence outside project root
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:79:7
   for (const path of [...sources.escaped, ...testInputs.escaped]) {
     invalid.push(diagnostic('PL-CONTRACT-PATH-ESCAPE', slash(relative(canonicalRoot, path)), 'Contract evidence must stay inside project root'));
   }
-  if (invalid.length) return { exitCode: 2, diagnostics: invalid };
+  if (true) return { exitCode: 2, diagnostics: invalid };
 
   for (const file of sources.files) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:79:7
   for (const path of [...sources.escaped, ...testInputs.escaped]) {
     invalid.push(diagnostic('PL-CONTRACT-PATH-ESCAPE', slash(relative(canonicalRoot, path)), 'Contract evidence must stay inside project root'));
   }
-  if (invalid.length) return { exitCode: 2, diagnostics: invalid };
+  if (false) return { exitCode: 2, diagnostics: invalid };
 
   for (const file of sources.files) {
killedBy: contract identity checker rejects contract evidence outside project root
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to match object { exitCode: 2, diagnostics: [ …(1) ] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:81:37
   }
   if (invalid.length) return { exitCode: 2, diagnostics: invalid };
 
-  for (const file of sources.files) {
-    const rel = slash(relative(canonicalRoot, file));
-    const tokens = lexSource(readFileSync(file, 'utf8'));
-    const aliases = new Set(CONTRACTS);
-    for (let index = 0; index < tokens.length - 2; index += 1) {
-      if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
-        && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
-      if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
-        && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
-    }
-    for (let index = 0; index < tokens.length; index += 1) {
-      if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(') continue;
-      const id = secondArgumentString(tokens, index);
-      if (!id) invalid.push(diagnostic('PL-CONTRACT-UNSUPPORTED-SYNTAX', rel, 'Contract id must be a string literal'));
-      else declarations.push({ id, file: rel });
-    }
-  }
+  for (const file of sources.files) {}
 
   for (const file of testInputs.files) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:83:49
 
   for (const file of sources.files) {
     const rel = slash(relative(canonicalRoot, file));
-    const tokens = lexSource(readFileSync(file, 'utf8'));
+    const tokens = lexSource(readFileSync(file, ""));
     const aliases = new Set(CONTRACTS);
     for (let index = 0; index < tokens.length - 2; index += 1) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:85:25
     const rel = slash(relative(canonicalRoot, file));
     const tokens = lexSource(readFileSync(file, 'utf8'));
     const aliases = new Set(CONTRACTS);
-    for (let index = 0; index < tokens.length - 2; index += 1) {
+    for (let index = 0; index >= tokens.length - 2; index += 1) {
       if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
         && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
killedBy: contract identity checker accepts imported contract aliases without losing identity proof
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] AssignmentOperator
src/scripts/pl-contract-check.mjs:85:52
     const rel = slash(relative(canonicalRoot, file));
     const tokens = lexSource(readFileSync(file, 'utf8'));
     const aliases = new Set(CONTRACTS);
-    for (let index = 0; index < tokens.length - 2; index += 1) {
+    for (let index = 0; index < tokens.length - 2; index -= 1) {
       if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
         && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:86:49
     const tokens = lexSource(readFileSync(file, 'utf8'));
     const aliases = new Set(CONTRACTS);
     for (let index = 0; index < tokens.length - 2; index += 1) {
-      if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
+      if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value !== 'as'
         && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
       if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
killedBy: contract identity checker accepts imported contract aliases without losing identity proof
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:86:56
     const tokens = lexSource(readFileSync(file, 'utf8'));
     const aliases = new Set(CONTRACTS);
     for (let index = 0; index < tokens.length - 2; index += 1) {
-      if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
+      if (CONTRACTS.has(tokens[index].value) && tokens[index - 1]?.value === 'as'
         && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
       if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
killedBy: contract identity checker accepts imported contract aliases without losing identity proof
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:87:12
     const aliases = new Set(CONTRACTS);
     for (let index = 0; index < tokens.length - 2; index += 1) {
       if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
-        && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
+        && tokens[index + 2]?.type !== 'identifier') aliases.add(tokens[index + 2].value);
       if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
         && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
killedBy: contract identity checker accepts imported contract aliases without losing identity proof
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:87:73
     const aliases = new Set(CONTRACTS);
     for (let index = 0; index < tokens.length - 2; index += 1) {
       if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
-        && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
+        && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index - 2].value);
       if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
         && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
killedBy: contract identity checker accepts imported contract aliases without losing identity proof
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:88:11
     for (let index = 0; index < tokens.length - 2; index += 1) {
       if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
         && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
-      if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
-        && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
+      if (false) aliases.add(tokens[index].value);
     }
     for (let index = 0; index < tokens.length; index += 1) {
killedBy: alias tracking follows a chained assignment alias, not just a direct one
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:88:11
     for (let index = 0; index < tokens.length - 2; index += 1) {
       if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
         && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
-      if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
-        && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
+      if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '=' || aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
     }
     for (let index = 0; index < tokens.length; index += 1) {
killedBy: alias tracking does not treat an assignment to an unrelated value as a contract alias
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:89:31
       if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
         && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
       if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
-        && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
+        && aliases.has(tokens[index - 2]?.value)) aliases.add(tokens[index].value);
     }
     for (let index = 0; index < tokens.length; index += 1) {
killedBy: alias tracking follows a chained assignment alias, not just a direct one
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Survived] OptionalChaining
src/scripts/pl-contract-check.mjs:89:24
       if (CONTRACTS.has(tokens[index].value) && tokens[index + 1]?.value === 'as'
         && tokens[index + 2]?.type === 'identifier') aliases.add(tokens[index + 2].value);
       if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
-        && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
+        && aliases.has(tokens[index + 2].value)) aliases.add(tokens[index].value);
     }
     for (let index = 0; index < tokens.length; index += 1) {

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:91:25
       if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
         && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
     }
-    for (let index = 0; index < tokens.length; index += 1) {
+    for (let index = 0; index >= tokens.length; index += 1) {
       if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(') continue;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] AssignmentOperator
src/scripts/pl-contract-check.mjs:91:48
       if (tokens[index].type === 'identifier' && tokens[index + 1]?.value === '='
         && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
     }
-    for (let index = 0; index < tokens.length; index += 1) {
+    for (let index = 0; index < tokens.length; index -= 1) {
       if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(') continue;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:92:11
         && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
     }
     for (let index = 0; index < tokens.length; index += 1) {
-      if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
+      if (tokens[index].type !== 'identifier' && !aliases.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(') continue;
       const id = secondArgumentString(tokens, index);
killedBy: call-argument scanning edge cases does not count a comma nested inside a parenthesized/bracketed/braced first argument
statusReason: expected { exitCode: 2, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:92:11
         && aliases.has(tokens[index + 2]?.value)) aliases.add(tokens[index].value);
     }
     for (let index = 0; index < tokens.length; index += 1) {
-      if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(') continue;
+      if ((tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)) && tokens[index + 1]?.value !== '(') continue;
       const id = secondArgumentString(tokens, index);
       if (!id) invalid.push(diagnostic('PL-CONTRACT-UNSUPPORTED-SYNTAX', rel, 'Contract id must be a string literal'));
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:93:12
     }
     for (let index = 0; index < tokens.length; index += 1) {
       if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(') continue;
+        || false) continue;
       const id = secondArgumentString(tokens, index);
       if (!id) invalid.push(diagnostic('PL-CONTRACT-UNSUPPORTED-SYNTAX', rel, 'Contract id must be a string literal'));
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:93:19
     }
     for (let index = 0; index < tokens.length; index += 1) {
       if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(') continue;
+        || tokens[index - 1]?.value !== '(') continue;
       const id = secondArgumentString(tokens, index);
       if (!id) invalid.push(diagnostic('PL-CONTRACT-UNSUPPORTED-SYNTAX', rel, 'Contract id must be a string literal'));
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:95:11
       if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(') continue;
       const id = secondArgumentString(tokens, index);
-      if (!id) invalid.push(diagnostic('PL-CONTRACT-UNSUPPORTED-SYNTAX', rel, 'Contract id must be a string literal'));
+      if (false) invalid.push(diagnostic('PL-CONTRACT-UNSUPPORTED-SYNTAX', rel, 'Contract id must be a string literal'));
       else declarations.push({ id, file: rel });
     }
killedBy: call-argument scanning edge cases treats a non-string second argument as an unsupported-syntax violation
statusReason: expected [ { version: '1', …(5) }, …(1) ] to deep equally contain ObjectContaining{…}

[Killed] BooleanLiteral
src/scripts/pl-contract-check.mjs:95:11
       if (tokens[index].type !== 'identifier' || !aliases.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(') continue;
       const id = secondArgumentString(tokens, index);
-      if (!id) invalid.push(diagnostic('PL-CONTRACT-UNSUPPORTED-SYNTAX', rel, 'Contract id must be a string literal'));
+      if (id) invalid.push(diagnostic('PL-CONTRACT-UNSUPPORTED-SYNTAX', rel, 'Contract id must be a string literal'));
       else declarations.push({ id, file: rel });
     }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 2, diagnostics: [ …(2) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:100:40
     }
   }
 
-  for (const file of testInputs.files) {
-    const rel = slash(relative(canonicalRoot, file));
-    const tokens = lexSource(readFileSync(file, 'utf8'));
-    for (let index = 0; index < tokens.length; index += 1) {
-      if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
-      const ids = tokens[index + 2].value.match(ID) ?? [];
-      const callEnd = findCallEnd(tokens, index + 1);
-      const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
-      const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
-      for (const id of ids) tests.push({ id, file: rel });
-      if (ids.length && !hasEvidence) {
-        evidenceViolations.push(diagnostic('PL-CONTRACT-EMPTY-TEST', rel, `Violation test ${ids.join(', ')} has an empty callback`));
-      }
-    }
-  }
+  for (const file of testInputs.files) {}
 
   if (declarations.length === 0 && tests.length === 0) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:103:60
   for (const file of testInputs.files) {
     const rel = slash(relative(canonicalRoot, file));
     const tokens = lexSource(readFileSync(file, 'utf8'));
-    for (let index = 0; index < tokens.length; index += 1) {
-      if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
-      const ids = tokens[index + 2].value.match(ID) ?? [];
-      const callEnd = findCallEnd(tokens, index + 1);
-      const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
-      const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
-      for (const id of ids) tests.push({ id, file: rel });
-      if (ids.length && !hasEvidence) {
-        evidenceViolations.push(diagnostic('PL-CONTRACT-EMPTY-TEST', rel, `Violation test ${ids.join(', ')} has an empty callback`));
-      }
-    }
+    for (let index = 0; index < tokens.length; index += 1) {}
   }
 
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:103:25
   for (const file of testInputs.files) {
     const rel = slash(relative(canonicalRoot, file));
     const tokens = lexSource(readFileSync(file, 'utf8'));
-    for (let index = 0; index < tokens.length; index += 1) {
+    for (let index = 0; false; index += 1) {
       if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:104:11
     const rel = slash(relative(canonicalRoot, file));
     const tokens = lexSource(readFileSync(file, 'utf8'));
     for (let index = 0; index < tokens.length; index += 1) {
-      if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
+      if ((tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)) && tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
       const ids = tokens[index + 2].value.match(ID) ?? [];
       const callEnd = findCallEnd(tokens, index + 1);
killedBy: violation-test evidence detection ignores a call whose name is not it/test even if it looks similar
statusReason: expected [] to deep equally contain ObjectContaining{…}

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:104:11
     const rel = slash(relative(canonicalRoot, file));
     const tokens = lexSource(readFileSync(file, 'utf8'));
     for (let index = 0; index < tokens.length; index += 1) {
-      if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
+      if (tokens[index].type !== 'identifier' && !TESTS.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
       const ids = tokens[index + 2].value.match(ID) ?? [];
killedBy: violation-test evidence detection ignores a call whose name is not it/test even if it looks similar
statusReason: expected [] to deep equally contain ObjectContaining{…}

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:105:12
     const tokens = lexSource(readFileSync(file, 'utf8'));
     for (let index = 0; index < tokens.length; index += 1) {
       if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
+        || tokens[index + 1]?.value === '(' || tokens[index + 2]?.type !== 'string') continue;
       const ids = tokens[index + 2].value.match(ID) ?? [];
       const callEnd = findCallEnd(tokens, index + 1);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:105:55
     const tokens = lexSource(readFileSync(file, 'utf8'));
     for (let index = 0; index < tokens.length; index += 1) {
       if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
-        || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
+        || tokens[index + 1]?.value !== '(' || tokens[index - 2]?.type !== 'string') continue;
       const ids = tokens[index + 2].value.match(ID) ?? [];
       const callEnd = findCallEnd(tokens, index + 1);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:106:19
     for (let index = 0; index < tokens.length; index += 1) {
       if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
-      const ids = tokens[index + 2].value.match(ID) ?? [];
+      const ids = tokens[index + 2].value.match(ID) && [];
       const callEnd = findCallEnd(tokens, index + 1);
       const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:106:26
     for (let index = 0; index < tokens.length; index += 1) {
       if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
-      const ids = tokens[index + 2].value.match(ID) ?? [];
+      const ids = tokens[index - 2].value.match(ID) ?? [];
       const callEnd = findCallEnd(tokens, index + 1);
       const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:107:43
       if (tokens[index].type !== 'identifier' || !TESTS.has(tokens[index].value)
         || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
       const ids = tokens[index + 2].value.match(ID) ?? [];
-      const callEnd = findCallEnd(tokens, index + 1);
+      const callEnd = findCallEnd(tokens, index - 1);
       const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
       const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] MethodExpression
src/scripts/pl-contract-check.mjs:108:26
         || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
       const ids = tokens[index + 2].value.match(ID) ?? [];
       const callEnd = findCallEnd(tokens, index + 1);
-      const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
+      const bodyTokens = tokens;
       const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
       for (const id of ids) tests.push({ id, file: rel });
killedBy: contract identity checker rejects an empty callback as violation-test evidence
statusReason: expected { exitCode: +0, diagnostics: [] } to match object { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:108:39
         || tokens[index + 1]?.value !== '(' || tokens[index + 2]?.type !== 'string') continue;
       const ids = tokens[index + 2].value.match(ID) ?? [];
       const callEnd = findCallEnd(tokens, index + 1);
-      const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
+      const bodyTokens = tokens.slice(index - 3, callEnd ?? tokens.length);
       const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
       for (const id of ids) tests.push({ id, file: rel });
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:109:54
       const ids = tokens[index + 2].value.match(ID) ?? [];
       const callEnd = findCallEnd(tokens, index + 1);
       const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
-      const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
+      const hasEvidence = bodyTokens.some((token) => false);
       for (const id of ids) tests.push({ id, file: rel });
       if (ids.length && !hasEvidence) {
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }
