[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:109:54
       const ids = tokens[index + 2].value.match(ID) ?? [];
       const callEnd = findCallEnd(tokens, index + 1);
       const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
-      const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
+      const hasEvidence = bodyTokens.some((token) => token.type !== 'identifier' && token.value !== 'async');
       for (const id of ids) tests.push({ id, file: rel });
       if (ids.length && !hasEvidence) {
killedBy: contract identity checker rejects an empty callback as violation-test evidence
statusReason: expected { exitCode: +0, diagnostics: [] } to match object { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] BooleanLiteral
src/scripts/pl-contract-check.mjs:111:25
       const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
       const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
       for (const id of ids) tests.push({ id, file: rel });
-      if (ids.length && !hasEvidence) {
+      if (ids.length && hasEvidence) {
         evidenceViolations.push(diagnostic('PL-CONTRACT-EMPTY-TEST', rel, `Violation test ${ids.join(', ')} has an empty callback`));
       }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:111:39
       const bodyTokens = tokens.slice(index + 3, callEnd ?? tokens.length);
       const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
       for (const id of ids) tests.push({ id, file: rel });
-      if (ids.length && !hasEvidence) {
-        evidenceViolations.push(diagnostic('PL-CONTRACT-EMPTY-TEST', rel, `Violation test ${ids.join(', ')} has an empty callback`));
-      }
+      if (ids.length && !hasEvidence) {}
     }
   }
killedBy: contract identity checker rejects an empty callback as violation-test evidence
statusReason: expected { exitCode: +0, diagnostics: [] } to match object { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:112:44
       const hasEvidence = bodyTokens.some((token) => token.type === 'identifier' && token.value !== 'async');
       for (const id of ids) tests.push({ id, file: rel });
       if (ids.length && !hasEvidence) {
-        evidenceViolations.push(diagnostic('PL-CONTRACT-EMPTY-TEST', rel, `Violation test ${ids.join(', ')} has an empty callback`));
+        evidenceViolations.push(diagnostic("", rel, `Violation test ${ids.join(', ')} has an empty callback`));
       }
     }
killedBy: contract identity checker rejects an empty callback as violation-test evidence
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to match object { exitCode: 1, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:117:7
     }
   }
 
-  if (declarations.length === 0 && tests.length === 0) {
+  if (declarations.length === 0 || tests.length === 0) {
     return {
       exitCode: 2,
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: 2, diagnostics: [ …(1) ] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:117:7
     }
   }
 
-  if (declarations.length === 0 && tests.length === 0) {
+  if (false) {
     return {
       exitCode: 2,
killedBy: contract identity checker rejects an empty source/test selection instead of claiming parity
statusReason: expected { exitCode: +0, diagnostics: [] } to match object { exitCode: 2, diagnostics: [ …(1) ] }

[Killed] ObjectLiteral
src/scripts/pl-contract-check.mjs:118:12
   }
 
   if (declarations.length === 0 && tests.length === 0) {
-    return {
-      exitCode: 2,
-      diagnostics: [diagnostic('PL-CONTRACT-NO-EVIDENCE', '', 'At least one contract declaration and violation test are required')],
-    };
+    return {};
   }
 
killedBy: contract identity checker rejects an empty source/test selection instead of claiming parity
statusReason: expected {} to match object { exitCode: 2, diagnostics: [ …(1) ] }

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:120:32
   if (declarations.length === 0 && tests.length === 0) {
     return {
       exitCode: 2,
-      diagnostics: [diagnostic('PL-CONTRACT-NO-EVIDENCE', '', 'At least one contract declaration and violation test are required')],
+      diagnostics: [diagnostic("", '', 'At least one contract declaration and violation test are required')],
     };
   }
killedBy: contract identity checker rejects an empty source/test selection instead of claiming parity
statusReason: expected { exitCode: 2, diagnostics: [ …(1) ] } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:126:68
 
   const violations = [...evidenceViolations];
   const declarationCounts = new Map();
-  for (const item of declarations) declarationCounts.set(item.id, (declarationCounts.get(item.id) ?? 0) + 1);
+  for (const item of declarations) declarationCounts.set(item.id, (declarationCounts.get(item.id) && 0) + 1);
   const testIds = new Set(tests.map((item) => item.id));
   for (const item of declarations) {
killedBy: contract identity checker reports duplicate declarations without count parity
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/scripts/pl-contract-check.mjs:126:67
 
   const violations = [...evidenceViolations];
   const declarationCounts = new Map();
-  for (const item of declarations) declarationCounts.set(item.id, (declarationCounts.get(item.id) ?? 0) + 1);
+  for (const item of declarations) declarationCounts.set(item.id, (declarationCounts.get(item.id) ?? 0) - 1);
   const testIds = new Set(tests.map((item) => item.id));
   for (const item of declarations) {
killedBy: contract identity checker reports duplicate declarations without count parity
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/scripts/pl-contract-check.mjs:127:37
   const violations = [...evidenceViolations];
   const declarationCounts = new Map();
   for (const item of declarations) declarationCounts.set(item.id, (declarationCounts.get(item.id) ?? 0) + 1);
-  const testIds = new Set(tests.map((item) => item.id));
+  const testIds = new Set(tests.map(() => undefined));
   for (const item of declarations) {
     if (declarationCounts.get(item.id) > 1
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:128:36
   const declarationCounts = new Map();
   for (const item of declarations) declarationCounts.set(item.id, (declarationCounts.get(item.id) ?? 0) + 1);
   const testIds = new Set(tests.map((item) => item.id));
-  for (const item of declarations) {
-    if (declarationCounts.get(item.id) > 1
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
-      violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
-    }
-    if (!testIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-MISSING-TEST' && entry.message.includes(item.id))) {
-      violations.push(diagnostic('PL-CONTRACT-MISSING-TEST', item.file, `Contract ${item.id} has no violation test`));
-    }
-  }
+  for (const item of declarations) {}
   const declaredIds = new Set(declarations.map((item) => item.id));
   for (const item of tests) {
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: +0, diagnostics: [] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:129:9
   for (const item of declarations) declarationCounts.set(item.id, (declarationCounts.get(item.id) ?? 0) + 1);
   const testIds = new Set(tests.map((item) => item.id));
   for (const item of declarations) {
-    if (declarationCounts.get(item.id) > 1
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
+    if (declarationCounts.get(item.id) > 1 || !violations.some(entry => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
       violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
     }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:129:9
   for (const item of declarations) declarationCounts.set(item.id, (declarationCounts.get(item.id) ?? 0) + 1);
   const testIds = new Set(tests.map((item) => item.id));
   for (const item of declarations) {
-    if (declarationCounts.get(item.id) > 1
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
+    if (true) {
       violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
     }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ArrowFunction
src/scripts/pl-contract-check.mjs:130:27
   const testIds = new Set(tests.map((item) => item.id));
   for (const item of declarations) {
     if (declarationCounts.get(item.id) > 1
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
+      && !violations.some(() => undefined)) {
       violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
     }
killedBy: contract identity checker reports duplicate declarations without count parity
statusReason: expected [ { version: '1', …(5) }, …(1) ] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/scripts/pl-contract-check.mjs:130:11
   const testIds = new Set(tests.map((item) => item.id));
   for (const item of declarations) {
     if (declarationCounts.get(item.id) > 1
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
+      && !violations.every(entry => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
       violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
     }
killedBy: contract identity checker reports duplicate declarations without count parity
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:131:73
   for (const item of declarations) {
     if (declarationCounts.get(item.id) > 1
       && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
-      violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
+      violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, ``));
     }
     if (!testIds.has(item.id)
killedBy: contract identity checker reports duplicate declarations without count parity
statusReason: expected [ { version: '1', …(5) }, …(1) ] to deeply equal [ ObjectContaining{…} ]

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:131:34
   for (const item of declarations) {
     if (declarationCounts.get(item.id) > 1
       && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
-      violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
+      violations.push(diagnostic("", item.file, `Contract id ${item.id} is declared more than once`));
     }
     if (!testIds.has(item.id)
killedBy: contract identity checker reports duplicate declarations without count parity
statusReason: expected [ { version: '1', …(5) }, …(1) ] to deeply equal [ ObjectContaining{…} ]

[Killed] BooleanLiteral
src/scripts/pl-contract-check.mjs:133:9
       && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
       violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
     }
-    if (!testIds.has(item.id)
+    if (testIds.has(item.id)
       && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-MISSING-TEST' && entry.message.includes(item.id))) {
       violations.push(diagnostic('PL-CONTRACT-MISSING-TEST', item.file, `Contract ${item.id} has no violation test`));
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:133:9
       && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-DUPLICATE-ID' && entry.message.includes(item.id))) {
       violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
     }
-    if (!testIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-MISSING-TEST' && entry.message.includes(item.id))) {
+    if (true) {
       violations.push(diagnostic('PL-CONTRACT-MISSING-TEST', item.file, `Contract ${item.id} has no violation test`));
     }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] MethodExpression
src/scripts/pl-contract-check.mjs:134:11
       violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
     }
     if (!testIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-MISSING-TEST' && entry.message.includes(item.id))) {
+      && !violations.every(entry => entry.rule_id === 'PL-CONTRACT-MISSING-TEST' && entry.message.includes(item.id))) {
       violations.push(diagnostic('PL-CONTRACT-MISSING-TEST', item.file, `Contract ${item.id} has no violation test`));
     }
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: +0, diagnostics: [] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:134:120
       violations.push(diagnostic('PL-CONTRACT-DUPLICATE-ID', item.file, `Contract id ${item.id} is declared more than once`));
     }
     if (!testIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-MISSING-TEST' && entry.message.includes(item.id))) {
-      violations.push(diagnostic('PL-CONTRACT-MISSING-TEST', item.file, `Contract ${item.id} has no violation test`));
-    }
+      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-MISSING-TEST' && entry.message.includes(item.id))) {}
   }
   const declaredIds = new Set(declarations.map((item) => item.id));
killedBy: contract identity checker matches the golden missing-test diagnostic
statusReason: expected { exitCode: +0, diagnostics: [] } to deeply equal { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ArrowFunction
src/scripts/pl-contract-check.mjs:138:48
       violations.push(diagnostic('PL-CONTRACT-MISSING-TEST', item.file, `Contract ${item.id} has no violation test`));
     }
   }
-  const declaredIds = new Set(declarations.map((item) => item.id));
+  const declaredIds = new Set(declarations.map(() => undefined));
   for (const item of tests) {
     if (!declaredIds.has(item.id)
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:139:29
     }
   }
   const declaredIds = new Set(declarations.map((item) => item.id));
-  for (const item of tests) {
-    if (!declaredIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-ORPHAN-TEST' && entry.message.includes(item.id))) {
-      violations.push(diagnostic('PL-CONTRACT-ORPHAN-TEST', item.file, `Violation test ${item.id} has no contract declaration`));
-    }
-  }
+  for (const item of tests) {}
 
   const diagnostics = [...invalid, ...violations].sort((a, b) =>
killedBy: contract identity checker reports orphan test ids and ignores comments and ordinary strings
statusReason: expected { exitCode: +0, diagnostics: [] } to match object { exitCode: 1, diagnostics: [ …(1) ] }

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:140:9
   }
   const declaredIds = new Set(declarations.map((item) => item.id));
   for (const item of tests) {
-    if (!declaredIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-ORPHAN-TEST' && entry.message.includes(item.id))) {
+    if (true) {
       violations.push(diagnostic('PL-CONTRACT-ORPHAN-TEST', item.file, `Violation test ${item.id} has no contract declaration`));
     }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:140:9
   }
   const declaredIds = new Set(declarations.map((item) => item.id));
   for (const item of tests) {
-    if (!declaredIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-ORPHAN-TEST' && entry.message.includes(item.id))) {
+    if (!declaredIds.has(item.id) || !violations.some(entry => entry.rule_id === 'PL-CONTRACT-ORPHAN-TEST' && entry.message.includes(item.id))) {
       violations.push(diagnostic('PL-CONTRACT-ORPHAN-TEST', item.file, `Violation test ${item.id} has no contract declaration`));
     }
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected { exitCode: 1, diagnostics: [ …(1) ] } to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] LogicalOperator
src/scripts/pl-contract-check.mjs:141:38
   const declaredIds = new Set(declarations.map((item) => item.id));
   for (const item of tests) {
     if (!declaredIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-ORPHAN-TEST' && entry.message.includes(item.id))) {
+      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-ORPHAN-TEST' || entry.message.includes(item.id))) {
       violations.push(diagnostic('PL-CONTRACT-ORPHAN-TEST', item.file, `Violation test ${item.id} has no contract declaration`));
     }
killedBy: violation deduplication and diagnostic ordering orphan dedup matches by rule_id AND message, not by message text alone
statusReason: expected [ { version: '1', …(5) } ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:141:38
   const declaredIds = new Set(declarations.map((item) => item.id));
   for (const item of tests) {
     if (!declaredIds.has(item.id)
-      && !violations.some((entry) => entry.rule_id === 'PL-CONTRACT-ORPHAN-TEST' && entry.message.includes(item.id))) {
+      && !violations.some((entry) => false)) {
       violations.push(diagnostic('PL-CONTRACT-ORPHAN-TEST', item.file, `Violation test ${item.id} has no contract declaration`));
     }
killedBy: violation deduplication and diagnostic ordering reports an orphan-test violation exactly once even when the same orphan id appears in two tests
statusReason: expected [ { version: '1', …(5) }, …(1) ] to have a length of 1 but got 2

[Survived] MethodExpression
src/scripts/pl-contract-check.mjs:146:23
     }
   }
 
-  const diagnostics = [...invalid, ...violations].sort((a, b) =>
-    `${a.file}\0${a.rule_id}\0${a.message}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.message}`));
+  const diagnostics = [...invalid, ...violations];
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics };
 }

[Survived] ArrowFunction
src/scripts/pl-contract-check.mjs:146:56
     }
   }
 
-  const diagnostics = [...invalid, ...violations].sort((a, b) =>
-    `${a.file}\0${a.rule_id}\0${a.message}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.message}`));
+  const diagnostics = [...invalid, ...violations].sort(() => undefined);
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics };
 }

[Survived] StringLiteral
src/scripts/pl-contract-check.mjs:147:59
   }
 
   const diagnostics = [...invalid, ...violations].sort((a, b) =>
-    `${a.file}\0${a.rule_id}\0${a.message}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.message}`));
+    `${a.file}\0${a.rule_id}\0${a.message}`.localeCompare(``));
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics };
 }

[Killed] ObjectLiteral
src/scripts/pl-contract-check.mjs:148:10
 
   const diagnostics = [...invalid, ...violations].sort((a, b) =>
     `${a.file}\0${a.rule_id}\0${a.message}`.localeCompare(`${b.file}\0${b.rule_id}\0${b.message}`));
-  return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics };
+  return {};
 }
 
killedBy: contract identity checker matches declaration ids to ids in test names
statusReason: expected {} to deeply equal { exitCode: +0, diagnostics: [] }

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:151:26
   return { exitCode: invalid.length ? 2 : violations.length ? 1 : 0, diagnostics };
 }
 
-function parseArgs(args) {
-  const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
-    if (args[index] === '--root') options.root = resolve(args[++index]);
-    else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
-    else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
-    else if (args[index] === '--format') options.format = args[++index];
-    else throw new Error(`Unknown argument: ${args[index]}`);
-  }
-  if (!options.sources.length || !options.tests.length) throw new Error('At least one --source and --test are required');
-  return options;
-}
+function parseArgs(args) {}
 
 if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/scripts/pl-contract-check.mjs:152:19
 }
 
 function parseArgs(args) {
-  const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
+  const options = {};
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--root') options.root = resolve(args[++index]);
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Survived] StringLiteral
src/scripts/pl-contract-check.mjs:152:74
 }
 
 function parseArgs(args) {
-  const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
+  const options = { root: process.cwd(), sources: [], tests: [], format: "" };
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--root') options.root = resolve(args[++index]);

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:153:23
 
 function parseArgs(args) {
   const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
+  for (let index = 0; false; index += 1) {
     if (args[index] === '--root') options.root = resolve(args[++index]);
     else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:153:23
 
 function parseArgs(args) {
   const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
+  for (let index = 0; index <= args.length; index += 1) {
     if (args[index] === '--root') options.root = resolve(args[++index]);
     else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] UpdateOperator
src/scripts/pl-contract-check.mjs:154:63
 function parseArgs(args) {
   const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
-    if (args[index] === '--root') options.root = resolve(args[++index]);
+    if (args[index] === '--root') options.root = resolve(args[--index]);
     else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
     else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:154:9
 function parseArgs(args) {
   const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
-    if (args[index] === '--root') options.root = resolve(args[++index]);
+    if (true) options.root = resolve(args[++index]);
     else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
     else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:155:14
   const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--root') options.root = resolve(args[++index]);
-    else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
+    else if (true) options.sources.push(resolve(args[++index]));
     else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
     else if (args[index] === '--format') options.format = args[++index];
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:155:14
   const options = { root: process.cwd(), sources: [], tests: [], format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--root') options.root = resolve(args[++index]);
-    else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
+    else if (false) options.sources.push(resolve(args[++index]));
     else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
     else if (args[index] === '--format') options.format = args[++index];
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:156:14
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--root') options.root = resolve(args[++index]);
     else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
-    else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
+    else if (true) options.tests.push(resolve(args[++index]));
     else if (args[index] === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
killedBy: pl-contract-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: expected 2 to be 1 // Object.is equality
