[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:156:14
   for (let index = 0; index < args.length; index += 1) {
     if (args[index] === '--root') options.root = resolve(args[++index]);
     else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
-    else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
+    else if (args[index] !== '--test') options.tests.push(resolve(args[++index]));
     else if (args[index] === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:157:14
     if (args[index] === '--root') options.root = resolve(args[++index]);
     else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
     else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
-    else if (args[index] === '--format') options.format = args[++index];
+    else if (false) options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
   }
killedBy: pl-contract-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:157:14
     if (args[index] === '--root') options.root = resolve(args[++index]);
     else if (args[index] === '--source') options.sources.push(resolve(args[++index]));
     else if (args[index] === '--test') options.tests.push(resolve(args[++index]));
-    else if (args[index] === '--format') options.format = args[++index];
+    else if (args[index] !== '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
   }
killedBy: pl-contract-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:160:7
     else if (args[index] === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
   }
-  if (!options.sources.length || !options.tests.length) throw new Error('At least one --source and --test are required');
+  if (true) throw new Error('At least one --source and --test are required');
   return options;
 }
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/scripts/pl-contract-check.mjs:160:7
     else if (args[index] === '--format') options.format = args[++index];
     else throw new Error(`Unknown argument: ${args[index]}`);
   }
-  if (!options.sources.length || !options.tests.length) throw new Error('At least one --source and --test are required');
+  if (options.sources.length || !options.tests.length) throw new Error('At least one --source and --test are required');
   return options;
 }
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:164:81
   return options;
 }
 
-if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
-  try {
-    const options = parseArgs(process.argv.slice(2));
-    const result = checkContracts({ root: options.root, sourceFiles: options.sources, testFiles: options.tests });
-    process.stdout.write(options.format === 'json'
-      ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
-      : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
-    process.exitCode = result.exitCode;
-  } catch (error) {
-    process.stderr.write(`${error.message}\n`);
-    process.exitCode = 2;
-  }
-}
+if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {}
 
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-contract-check.mjs:165:7
 }
 
 if (process.argv[1] && import.meta.url === pathToFileURL(process.argv[1]).href) {
-  try {
-    const options = parseArgs(process.argv.slice(2));
-    const result = checkContracts({ root: options.root, sourceFiles: options.sources, testFiles: options.tests });
-    process.stdout.write(options.format === 'json'
-      ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
-      : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
-    process.exitCode = result.exitCode;
-  } catch (error) {
+  try {} catch (error) {
     process.stderr.write(`${error.message}\n`);
     process.exitCode = 2;
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-contract-check.mjs:168:26
   try {
     const options = parseArgs(process.argv.slice(2));
     const result = checkContracts({ root: options.root, sourceFiles: options.sources, testFiles: options.tests });
-    process.stdout.write(options.format === 'json'
+    process.stdout.write(options.format !== 'json'
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
killedBy: pl-contract-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '[\n  {\n    "version": "1",\n    "rul…' not to contain '{'

[Killed] ConditionalExpression
src/scripts/pl-contract-check.mjs:168:26
   try {
     const options = parseArgs(process.argv.slice(2));
     const result = checkContracts({ root: options.root, sourceFiles: options.sources, testFiles: options.tests });
-    process.stdout.write(options.format === 'json'
+    process.stdout.write(false
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
killedBy: pl-contract-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: Unexpected token 'P', "PL-CONTRAC"... is not valid JSON

[Killed] StringLiteral
src/scripts/pl-contract-check.mjs:169:9
     const options = parseArgs(process.argv.slice(2));
     const result = checkContracts({ root: options.root, sourceFiles: options.sources, testFiles: options.tests });
     process.stdout.write(options.format === 'json'
-      ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
+      ? ``
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : ''));
     process.exitCode = result.exitCode;
killedBy: pl-contract-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: Unexpected end of JSON input
