[Killed] BlockStatement
src/scripts/pl-scope-guard.mjs:8:41
 
 const MANIFEST = 'scripts/release-manifest.json';
 
-export function checkPhaseAScope(paths) {
-  return paths
-    .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/'))
-    .sort();
-}
+export function checkPhaseAScope(paths) {}
 
 export function isMainModule(moduleUrl, argv1) {
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: expected undefined to deeply equal []

[Killed] MethodExpression
src/scripts/pl-scope-guard.mjs:9:10
 const MANIFEST = 'scripts/release-manifest.json';
 
 export function checkPhaseAScope(paths) {
-  return paths
-    .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/'))
-    .sort();
+  return paths.map(value => posix.normalize(String(value).replaceAll('\\', '/'))).filter(value => value !== MANIFEST && !value.startsWith('src/'));
 }
 
killedBy: Phase A scope guard rejects every other implementation path
statusReason: expected [ 'package.json', …(3) ] to deeply equal [ '.agents/registry.json', …(3) ]

[Killed] MethodExpression
src/scripts/pl-scope-guard.mjs:9:10
 const MANIFEST = 'scripts/release-manifest.json';
 
 export function checkPhaseAScope(paths) {
-  return paths
-    .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/'))
+  return paths.map(value => posix.normalize(String(value).replaceAll('\\', '/')))
     .sort();
 }
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: expected [ …(2) ] to deeply equal []

[Killed] ArrowFunction
src/scripts/pl-scope-guard.mjs:10:10
 
 export function checkPhaseAScope(paths) {
   return paths
-    .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
+    .map(() => undefined)
     .filter((value) => value !== MANIFEST && !value.startsWith('src/'))
     .sort();
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] LogicalOperator
src/scripts/pl-scope-guard.mjs:11:24
 export function checkPhaseAScope(paths) {
   return paths
     .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/'))
+    .filter((value) => value !== MANIFEST || !value.startsWith('src/'))
     .sort();
 }
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: expected [ …(2) ] to deeply equal []

[Killed] MethodExpression
src/scripts/pl-scope-guard.mjs:11:47
 export function checkPhaseAScope(paths) {
   return paths
     .map((value) => posix.normalize(String(value).replaceAll('\\', '/')))
-    .filter((value) => value !== MANIFEST && !value.startsWith('src/'))
+    .filter((value) => value !== MANIFEST && !value.endsWith('src/'))
     .sort();
 }
killedBy: Phase A scope guard permits src paths and the exact release-manifest exception
statusReason: expected [ 'src/scripts/pl-arch-check.mjs' ] to deeply equal []

[Killed] BlockStatement
src/scripts/pl-scope-guard.mjs:15:48
     .sort();
 }
 
-export function isMainModule(moduleUrl, argv1) {
-  return moduleUrl === pathToFileURL(argv1 ?? '').href;
-}
+export function isMainModule(moduleUrl, argv1) {}
 
 if (isMainModule(import.meta.url, process.argv[1])) {
killedBy: isMainModule is true only when the module URL matches argv[1] resolved to a file URL
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/scripts/pl-scope-guard.mjs:16:10
 }
 
 export function isMainModule(moduleUrl, argv1) {
-  return moduleUrl === pathToFileURL(argv1 ?? '').href;
+  return moduleUrl !== pathToFileURL(argv1 ?? '').href;
 }
 
killedBy: isMainModule is true only when the module URL matches argv[1] resolved to a file URL
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-scope-guard.mjs:16:10
 }
 
 export function isMainModule(moduleUrl, argv1) {
-  return moduleUrl === pathToFileURL(argv1 ?? '').href;
+  return false;
 }
 
killedBy: isMainModule is true only when the module URL matches argv[1] resolved to a file URL
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/scripts/pl-scope-guard.mjs:19:53
   return moduleUrl === pathToFileURL(argv1 ?? '').href;
 }
 
-if (isMainModule(import.meta.url, process.argv[1])) {
-  const violations = checkPhaseAScope(process.argv.slice(2));
-  if (violations.length) {
-    process.stderr.write(`${violations.join('\n')}\n`);
-    process.exitCode = 1;
-  }
-}
+if (isMainModule(import.meta.url, process.argv[1])) {}
 
killedBy: Phase A scope guard top-level CLI guard (in-process) runs the CLI side effect when argv[1] resolves to this module
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-scope-guard.mjs:19:5
   return moduleUrl === pathToFileURL(argv1 ?? '').href;
 }
 
-if (isMainModule(import.meta.url, process.argv[1])) {
+if (true) {
   const violations = checkPhaseAScope(process.argv.slice(2));
   if (violations.length) {
killedBy: Phase A scope guard top-level CLI guard (in-process) does not run the CLI side effect when argv[1] resolves to a different module
statusReason: expected 1 to be undefined

[Killed] MethodExpression
src/scripts/pl-scope-guard.mjs:20:39
 }
 
 if (isMainModule(import.meta.url, process.argv[1])) {
-  const violations = checkPhaseAScope(process.argv.slice(2));
+  const violations = checkPhaseAScope(process.argv);
   if (violations.length) {
     process.stderr.write(`${violations.join('\n')}\n`);
killedBy: Phase A scope guard top-level CLI guard (in-process) runs the CLI side effect when argv[1] resolves to this module
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "package.json

[Killed] ConditionalExpression
src/scripts/pl-scope-guard.mjs:21:7
 
 if (isMainModule(import.meta.url, process.argv[1])) {
   const violations = checkPhaseAScope(process.argv.slice(2));
-  if (violations.length) {
+  if (false) {
     process.stderr.write(`${violations.join('\n')}\n`);
     process.exitCode = 1;
killedBy: Phase A scope guard top-level CLI guard (in-process) runs the CLI side effect when argv[1] resolves to this module
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/scripts/pl-scope-guard.mjs:21:26
 
 if (isMainModule(import.meta.url, process.argv[1])) {
   const violations = checkPhaseAScope(process.argv.slice(2));
-  if (violations.length) {
-    process.stderr.write(`${violations.join('\n')}\n`);
-    process.exitCode = 1;
-  }
+  if (violations.length) {}
 }
 
killedBy: Phase A scope guard top-level CLI guard (in-process) runs the CLI side effect when argv[1] resolves to this module
statusReason: expected undefined to be 1 // Object.is equality

[Killed] StringLiteral
src/scripts/pl-scope-guard.mjs:22:26
 if (isMainModule(import.meta.url, process.argv[1])) {
   const violations = checkPhaseAScope(process.argv.slice(2));
   if (violations.length) {
-    process.stderr.write(`${violations.join('\n')}\n`);
+    process.stderr.write(``);
     process.exitCode = 1;
   }
killedBy: Phase A scope guard top-level CLI guard (in-process) runs the CLI side effect when argv[1] resolves to this module
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "package.json

[Killed] StringLiteral
src/scripts/pl-scope-guard.mjs:22:45
 if (isMainModule(import.meta.url, process.argv[1])) {
   const violations = checkPhaseAScope(process.argv.slice(2));
   if (violations.length) {
-    process.stderr.write(`${violations.join('\n')}\n`);
+    process.stderr.write(`${violations.join("")}\n`);
     process.exitCode = 1;
   }
killedBy: Phase A scope guard top-level CLI guard (in-process) runs the CLI side effect when argv[1] resolves to this module
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "package.json
