[Killed] StringLiteral
src/utils/contracts.ts:9:11
     public readonly id: string,
     message: string,
   ) {
-    super(`[${kind}:${id}] ${message}`);
+    super(``);
     this.name = 'ContractViolation';
   }
killedBy: stable contracts requires remains on and identifies its violation
statusReason: expected [Function] to throw error including '[requires:ORDER-TOTAL-POSITIVE] total…' but got ''

[Killed] BlockStatement
src/utils/contracts.ts:14:106
   }
 }
 
-function enforce(condition: boolean, kind: ContractKind, id: string, message: string): asserts condition {
-  if (!condition) throw new ContractViolation(kind, id, message);
-}
+function enforce(condition: boolean, kind: ContractKind, id: string, message: string): asserts condition {}
 
 export function requires(condition: boolean, id: string, message: string): asserts condition {
killedBy: stable contracts requires remains on and identifies its violation
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/utils/contracts.ts:15:7
 }
 
 function enforce(condition: boolean, kind: ContractKind, id: string, message: string): asserts condition {
-  if (!condition) throw new ContractViolation(kind, id, message);
+  if (false) throw new ContractViolation(kind, id, message);
 }
 
killedBy: stable contracts requires remains on and identifies its violation
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/utils/contracts.ts:15:7
 }
 
 function enforce(condition: boolean, kind: ContractKind, id: string, message: string): asserts condition {
-  if (!condition) throw new ContractViolation(kind, id, message);
+  if (true) throw new ContractViolation(kind, id, message);
 }
 
killedBy: stable contracts requires remains on and identifies its violation
statusReason: expected [Function] to not throw an error but 'ContractViolation: [requires:ORDER-TO…' was thrown

[Killed] BlockStatement
src/utils/contracts.ts:18:94
   if (!condition) throw new ContractViolation(kind, id, message);
 }
 
-export function requires(condition: boolean, id: string, message: string): asserts condition {
-  enforce(condition, 'requires', id, message);
-}
+export function requires(condition: boolean, id: string, message: string): asserts condition {}
 
 export function ensures(condition: boolean, id: string, message: string): asserts condition {
killedBy: stable contracts requires remains on and identifies its violation
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/utils/contracts.ts:19:22
 }
 
 export function requires(condition: boolean, id: string, message: string): asserts condition {
-  enforce(condition, 'requires', id, message);
+  enforce(condition, "", id, message);
 }
 
killedBy: stable contracts requires remains on and identifies its violation
statusReason: expected [Function] to throw error including '[requires:ORDER-TOTAL-POSITIVE] total…' but got '[:ORDER-TOTAL-POSITIVE] total must be…'

[Killed] BlockStatement
src/utils/contracts.ts:22:93
   enforce(condition, 'requires', id, message);
 }
 
-export function ensures(condition: boolean, id: string, message: string): asserts condition {
-  enforce(condition, 'ensures', id, message);
-}
+export function ensures(condition: boolean, id: string, message: string): asserts condition {}
 
 export function invariant(condition: boolean, id: string, message: string): asserts condition {
killedBy: stable contracts ensures remains on and identifies its violation
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/utils/contracts.ts:26:95
   enforce(condition, 'ensures', id, message);
 }
 
-export function invariant(condition: boolean, id: string, message: string): asserts condition {
-  enforce(condition, 'invariant', id, message);
-}
+export function invariant(condition: boolean, id: string, message: string): asserts condition {}
 
killedBy: stable contracts invariant remains on and identifies its violation
statusReason: expected [Function] to throw an error
