[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:19:9
   const invalid = [];
   const legacyKeys = ['domain_events', 'commands', 'aggregates'];
   for (const key of legacyKeys) {
-    if (!Array.isArray(model?.[key]) || model[key].length === 0
+    if (false
       || model[key].some((value) => typeof value !== 'string' || value.trim() === '' || /[\r\n]/.test(value))
       || new Set(model[key]).size !== model[key].length) {
killedBy: scenario generation does not throw when the model itself is missing (optional-chained legacy-key lookup)
statusReason: Cannot read properties of null (reading 'domain_events')

[Killed] ConditionalExpression
src/scripts/gen-scenarios.mjs:40:9
   const eventCounts = new Map(model.domain_events.map((value) => [value, 0]));
   let exactReferences = true;
   for (const relation of model.ownership_relations_v1) {
-    if (!relation || typeof relation.command !== 'string' || typeof relation.aggregate !== 'string'
-      || typeof relation.event !== 'string' || !commands.has(relation.command)
-      || !events.has(relation.event) || !aggregates.has(relation.aggregate)) {
+    if (false || !aggregates.has(relation.aggregate)) {
       exactReferences = false;
       continue;
killedBy: scenario generation flags a relation object with the wrong field types or an unknown command/event/aggregate reference
statusReason: Cannot read properties of null (reading 'aggregate')
