[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:32:28
   version: '1', rule_id, severity: 'error', file, dependency, message,
 });
 
-function compileGlob(glob) {
-  const normalized = slash(glob);
-  const segments = normalized.split('/');
-  if (!normalized || /[?\[\]{}!]/.test(normalized)
-    || segments.some((part) => part.includes('**') && part !== '**')) {
-    throw new Error(`Unsupported glob: ${glob}`);
-  }
-  const pattern = segments.map((part, index) => {
-    if (part === '**') return index === segments.length - 1 ? '.*' : '(?:[^/]+/)*';
-    return part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
-  }).join('/');
-  return new RegExp(`^${pattern}$`);
-}
+function compileGlob(glob) {}
 
 function validateManifest(raw) {
killedBy: layer manifest validation rejects invalid manifest input
statusReason: Cannot read properties of undefined (reading 'test')

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:39:49
     || segments.some((part) => part.includes('**') && part !== '**')) {
     throw new Error(`Unsupported glob: ${glob}`);
   }
-  const pattern = segments.map((part, index) => {
-    if (part === '**') return index === segments.length - 1 ? '.*' : '(?:[^/]+/)*';
-    return part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
-  }).join('/');
+  const pattern = segments.map((part, index) => {}).join('/');
   return new RegExp(`^${pattern}$`);
 }
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:40:31
     throw new Error(`Unsupported glob: ${glob}`);
   }
   const pattern = segments.map((part, index) => {
-    if (part === '**') return index === segments.length - 1 ? '.*' : '(?:[^/]+/)*';
+    if (part === '**') return true ? '.*' : '(?:[^/]+/)*';
     return part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
   }).join('/');
killedBy: glob compilation a mid-path ** never matches, at any directory depth (compileGlob join inserts a redundant slash)
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:40:9
     throw new Error(`Unsupported glob: ${glob}`);
   }
   const pattern = segments.map((part, index) => {
-    if (part === '**') return index === segments.length - 1 ? '.*' : '(?:[^/]+/)*';
+    if (part !== '**') return index === segments.length - 1 ? '.*' : '(?:[^/]+/)*';
     return part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
   }).join('/');
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:41:41
   }
   const pattern = segments.map((part, index) => {
     if (part === '**') return index === segments.length - 1 ? '.*' : '(?:[^/]+/)*';
-    return part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
+    return part.replace(/[.+^$()|\\]/g, "").replaceAll('*', '[^/]*');
   }).join('/');
   return new RegExp(`^${pattern}$`);
killedBy: source root discovery and file walking extracts the full directory for a glob with no wildcard character at all
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:42:11
   const pattern = segments.map((part, index) => {
     if (part === '**') return index === segments.length - 1 ? '.*' : '(?:[^/]+/)*';
     return part.replace(/[.+^$()|\\]/g, '\\$&').replaceAll('*', '[^/]*');
-  }).join('/');
+  }).join("");
   return new RegExp(`^${pattern}$`);
 }
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:48:37
 
 function validateManifest(raw) {
   if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
-  if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
+  if (!Array.isArray(raw.layers) || raw.layers.length !== 0) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-INVALID-MANIFEST' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:50:7
   if (raw?.version !== '1') throw Object.assign(new Error('Unsupported manifest version'), { rule: 'PL-ARCH-MANIFEST-VERSION' });
   if (!Array.isArray(raw.layers) || raw.layers.length === 0) throw new Error('Manifest layers must be non-empty');
   const names = new Set(raw.layers.map((layer) => layer?.name));
-  if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
+  if (true) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
     if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected 'PL-ARCH-INVALID-MANIFEST' to be 'PL-ARCH-UNSUPPORTED-GLOB' // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:52:9
   const names = new Set(raw.layers.map((layer) => layer?.name));
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
-    if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
+    if (false) throw new Error(`Invalid layer ${layer.name}`);
     if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"a","globs":"not-array","may_import":[]}],"aliases":{},"external":{"allow":true}}
statusReason: expected 'layer.globs.map is not a function' to contain 'Invalid layer'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:53:9
   if (names.size !== raw.layers.length || names.has(undefined) || names.has('')) throw new Error('Layer names must be unique non-empty strings');
   const layers = raw.layers.map((layer) => {
     if (!Array.isArray(layer.globs) || !Array.isArray(layer.may_import)) throw new Error(`Invalid layer ${layer.name}`);
-    if (layer.may_import.some((name) => !names.has(name))) throw new Error(`Unknown may_import layer in ${layer.name}`);
+    if (false) throw new Error(`Unknown may_import layer in ${layer.name}`);
     let globs;
     try { globs = layer.globs.map(compileGlob); }
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"a","globs":["src/**"],"may_import":["unknown-layer"]}],"aliases":{},"external":{"allow":true}}
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:60:7
     return { ...layer, patterns: layer.globs, globs };
   });
   const aliases = raw.aliases ?? {};
-  if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
+  if ((!aliases || Array.isArray(aliases)) && typeof aliases !== 'object'
     || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
     throw new Error('Manifest aliases must map non-empty keys to paths');
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":[],"external":{"allow":true}}
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:61:55
   });
   const aliases = raw.aliases ?? {};
   if (!aliases || Array.isArray(aliases) || typeof aliases !== 'object'
-    || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
+    || Object.entries(aliases).some(([key, value]) => !key && typeof value !== 'string')) {
     throw new Error('Manifest aliases must map non-empty keys to paths');
   }
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":{"":"src"},"external":{"allow":t
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:64:7
     || Object.entries(aliases).some(([key, value]) => !key || typeof value !== 'string')) {
     throw new Error('Manifest aliases must map non-empty keys to paths');
   }
-  if (typeof raw.external?.allow !== 'boolean') throw new Error('Manifest external.allow must be boolean');
+  if (false) throw new Error('Manifest external.allow must be boolean');
   return { layers, aliases, external: raw.external };
 }
killedBy: layer manifest validation rejects manifest shape violations: {"version":"1","layers":[{"name":"application","globs":["src/**"],"may_import":["application"]}],"aliases":{},"external":{}}
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ObjectLiteral
src/scripts/pl-arch-check.mjs:65:10
     throw new Error('Manifest aliases must map non-empty keys to paths');
   }
   if (typeof raw.external?.allow !== 'boolean') throw new Error('Manifest external.allow must be boolean');
-  return { layers, aliases, external: raw.external };
+  return {};
 }
 
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: layers is not iterable

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:74:16
     for (const entry of readdirSync(dir, { withFileTypes: true })) {
       const path = join(dir, entry.name);
       if (entry.isDirectory()) walk(path);
-      else if (entry.isFile() && SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
+      else if (entry.isFile() || SOURCE_EXTENSIONS.includes(extname(entry.name))) files.push(path);
     }
   };
killedBy: source root discovery and file walking treats a wildcard-prefixed glob with no directory component as rooted at the project root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] Regex
src/scripts/pl-arch-check.mjs:88:42
   for (const layer of layers) {
     for (const pattern of layer.patterns) {
       const normalized = slash(pattern);
-      const wildcard = normalized.search(/[*?\[]/);
+      const wildcard = normalized.search(/[^*?\[]/);
       let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
killedBy: source root discovery and file walking treats a wildcard-prefixed glob with no directory component as rooted at the project root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] MethodExpression
src/scripts/pl-arch-check.mjs:89:76
     for (const pattern of layer.patterns) {
       const normalized = slash(pattern);
       const wildcard = normalized.search(/[*?\[]/);
-      let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
+      let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized);
       prefix = prefix.replace(/\/+$/, '');
       const candidate = resolve(root, prefix || '.');
killedBy: source root discovery and file walking discovers additional source roots from wildcard layer globs outside src/
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:89:21
     for (const pattern of layer.patterns) {
       const normalized = slash(pattern);
       const wildcard = normalized.search(/[*?\[]/);
-      let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
+      let prefix = (true ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
       const candidate = resolve(root, prefix || '.');
killedBy: source root discovery and file walking treats a wildcard-prefixed glob with no directory component as rooted at the project root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Survived] Regex
src/scripts/pl-arch-check.mjs:90:31
       const normalized = slash(pattern);
       const wildcard = normalized.search(/[*?\[]/);
       let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
-      prefix = prefix.replace(/\/+$/, '');
+      prefix = prefix.replace(/\/+/, '');
       const candidate = resolve(root, prefix || '.');
       if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:92:11
       let prefix = (wildcard === -1 ? normalized.replace(/\/[^/]+$/, '') : normalized.slice(0, wildcard));
       prefix = prefix.replace(/\/+$/, '');
       const candidate = resolve(root, prefix || '.');
-      if (inside(root, candidate) && existsSync(candidate)) roots.add(realpathSync(candidate));
+      if (inside(root, candidate) || existsSync(candidate)) roots.add(realpathSync(candidate));
     }
   }
killedBy: layer manifest validation rejects unmatched and overlapping file ownership
statusReason: ENOENT: no such file or directory, lstat '/private/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-arch-czcfBe/lib'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:102:9
   const tokens = [];
   for (let index = 0; index < source.length;) {
     const char = source[index];
-    if (/\s/.test(char)) { index += 1; continue; }
+    if (true) { index += 1; continue; }
     if (char === '/' && source[index + 1] === '/') {
       index = source.indexOf('\n', index + 2);
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:103:9
   for (let index = 0; index < source.length;) {
     const char = source[index];
     if (/\s/.test(char)) { index += 1; continue; }
-    if (char === '/' && source[index + 1] === '/') {
+    if (char === '/' || source[index + 1] === '/') {
       index = source.indexOf('\n', index + 2);
       if (index < 0) break;
killedBy: fail-closed import scanner throws on an unterminated block comment
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:108:9
       if (index < 0) break;
       continue;
     }
-    if (char === '/' && source[index + 1] === '*') {
+    if (true) {
       const end = source.indexOf('*/', index + 2);
       if (end < 0) throw new Error('Unterminated block comment');
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:110:11
     }
     if (char === '/' && source[index + 1] === '*') {
       const end = source.indexOf('*/', index + 2);
-      if (end < 0) throw new Error('Unterminated block comment');
+      if (false) throw new Error('Unterminated block comment');
       index = end + 2;
       continue;
killedBy: fail-closed import scanner throws on an unterminated block comment
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:114:9
       index = end + 2;
       continue;
     }
-    if (char === '"' || char === "'") {
+    if (char === '"' && char === "'") {
       const quote = char;
       let value = '';
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:121:13
       let escaped = false;
       index += 1;
       while (index < source.length) {
-        if (source[index] === '\\') {
+        if (false) {
           if (index + 1 >= source.length) break;
           escaped = true;
killedBy: fail-closed import scanner rejects escaped module specifiers instead of misclassifying them
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:126:20
           escaped = true;
           value += source[index + 1];
           index += 2;
-        } else if (source[index] === quote) {
+        } else if (true) {
           index += 1;
           closed = true;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:134:11
           value += source[index++];
         }
       }
-      if (!closed) throw new Error('Unterminated string');
+      if (closed) throw new Error('Unterminated string');
       tokens.push({ type: 'string', value, escaped });
       continue;
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:135:27
         }
       }
       if (!closed) throw new Error('Unterminated string');
-      tokens.push({ type: 'string', value, escaped });
+      tokens.push({ type: "", value, escaped });
       continue;
     }
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:138:9
       tokens.push({ type: 'string', value, escaped });
       continue;
     }
-    if (char === '`') {
+    if (true) {
       let closed = false;
       index += 1;
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:142:13
       let closed = false;
       index += 1;
       while (index < source.length) {
-        if (source[index] === '\\') index += 2;
+        if (source[index] !== '\\') index += 2;
         else if (source[index] === '`') { index += 1; closed = true; break; }
         else index += 1;
killedBy: fail-closed import scanner skips an escaped backslash inside a template literal without ending it early
statusReason: Unterminated template

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:153:27
     if (/[A-Za-z_$]/.test(char)) {
       let end = index + 1;
       while (end < source.length && /[\w$]/.test(source[end])) end += 1;
-      tokens.push({ type: 'identifier', value: source.slice(index, end) });
+      tokens.push({ type: "", value: source.slice(index, end) });
       index = end;
       continue;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] ArrayDeclaration
src/scripts/pl-arch-check.mjs:165:24
 
 export function scanImports(source) {
   const tokens = lexSource(source);
-  const dependencies = [];
+  const dependencies = ["Stryker was here"];
   const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
   const moduleSpecifier = (token) => {
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ Array(6) ] to deeply equal [ './static', './setup', …(3) ]

[Survived] ObjectLiteral
src/scripts/pl-arch-check.mjs:166:106
 export function scanImports(source) {
   const tokens = lexSource(source);
   const dependencies = [];
-  const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
+  const unsupported = () => Object.assign(new Error('Dynamic import/require must use a string literal'), {});
   const moduleSpecifier = (token) => {
     if (token?.type !== 'string') throw unsupported();

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:172:23
     if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     return token.value;
   };
-  for (let index = 0; index < tokens.length; index += 1) {
+  for (let index = 0; false; index += 1) {
     const token = tokens[index];
     if (token.type !== 'identifier') continue;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [] to deeply equal [ './static', './setup', …(3) ]

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:172:23
     if (token.escaped) throw Object.assign(new Error('Direct imports cannot use an escaped module specifier'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     return token.value;
   };
-  for (let index = 0; index < tokens.length; index += 1) {
+  for (let index = 0; index <= tokens.length; index += 1) {
     const token = tokens[index];
     if (token.type !== 'identifier') continue;
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:178:32
     if (token.value === 'import') {
       const next = tokens[index + 1];
       if (next?.value === '.') continue;
-      if (next?.value === '(') {
-        if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
-        dependencies.push(moduleSpecifier(tokens[index + 2]));
-        index += 3;
-      } else if (next?.type === 'string') {
+      if (next?.value === '(') {} else if (next?.type === 'string') {
         dependencies.push(moduleSpecifier(next));
         index += 1;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './static', './setup', …(2) ] to deeply equal [ './static', './setup', …(3) ]

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:178:11
     if (token.value === 'import') {
       const next = tokens[index + 1];
       if (next?.value === '.') continue;
-      if (next?.value === '(') {
+      if (false) {
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] ArithmeticOperator
src/scripts/pl-arch-check.mjs:179:20
       const next = tokens[index + 1];
       if (next?.value === '.') continue;
       if (next?.value === '(') {
-        if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
+        if (tokens[index - 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
         index += 3;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:182:43
         if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
         dependencies.push(moduleSpecifier(tokens[index + 2]));
         index += 3;
-      } else if (next?.type === 'string') {
-        dependencies.push(moduleSpecifier(next));
-        index += 1;
-      } else {
+      } else if (next?.type === 'string') {} else {
         let cursor = index + 1;
         while (cursor < tokens.length && tokens[cursor].value !== ';'
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './static', './re-export', …(2) ] to deeply equal [ './static', './setup', …(3) ]

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:187:16
         index += 1;
       } else {
         let cursor = index + 1;
-        while (cursor < tokens.length && tokens[cursor].value !== ';'
+        while (cursor < tokens.length || tokens[cursor].value !== ';'
           && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
           if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
killedBy: fail-closed import scanner rejects a bare import that runs off the end of the token stream without a from clause
statusReason: expected [Function] to throw error including 'string literal' but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:196:40
           }
           cursor += 1;
         }
-        if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
+        if (cursor >= tokens.length || tokens[cursor]?.value === 'from') throw unsupported();
       }
     } else if (token.value === 'export') {
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:196:40
           }
           cursor += 1;
         }
-        if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
+        if (cursor >= tokens.length || false) throw unsupported();
       }
     } else if (token.value === 'export') {
killedBy: fail-closed import scanner stops scanning a bare-import from-search when an "export" keyword interrupts it first
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:198:42
         }
         if (cursor >= tokens.length || tokens[cursor]?.value !== 'from') throw unsupported();
       }
-    } else if (token.value === 'export') {
-      let cursor = index + 1;
-      while (cursor < tokens.length && tokens[cursor].value !== ';'
-        && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
-        if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
-          dependencies.push(moduleSpecifier(tokens[cursor + 1]));
-          index = cursor + 1;
-          break;
-        }
-        cursor += 1;
-      }
-    } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
+    } else if (token.value === 'export') {} else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './static', './setup', …(2) ] to deeply equal [ './static', './setup', …(3) ]

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:200:40
       }
     } else if (token.value === 'export') {
       let cursor = index + 1;
-      while (cursor < tokens.length && tokens[cursor].value !== ';'
+      while (cursor < tokens.length && tokens[cursor].value === ';'
         && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
         if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './static', './setup', …(2) ] to deeply equal [ './static', './setup', …(3) ]
