[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:200:14
       }
     } else if (token.value === 'export') {
       let cursor = index + 1;
-      while (cursor < tokens.length && tokens[cursor].value !== ';'
-        && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
+      while (cursor < tokens.length && tokens[cursor].value !== ';' && tokens[cursor].value !== 'import' || tokens[cursor].value !== 'export') {
         if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
           dependencies.push(moduleSpecifier(tokens[cursor + 1]));
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:202:48
       let cursor = index + 1;
       while (cursor < tokens.length && tokens[cursor].value !== ';'
         && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
-        if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
+        if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type !== 'string') {
           dependencies.push(moduleSpecifier(tokens[cursor + 1]));
           index = cursor + 1;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './static', './setup', …(2) ] to deeply equal [ './static', './setup', …(3) ]

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:202:13
       let cursor = index + 1;
       while (cursor < tokens.length && tokens[cursor].value !== ';'
         && tokens[cursor].value !== 'import' && tokens[cursor].value !== 'export') {
-        if (tokens[cursor].value === 'from' && tokens[cursor + 1]?.type === 'string') {
+        if (false) {
           dependencies.push(moduleSpecifier(tokens[cursor + 1]));
           index = cursor + 1;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: expected [ './static', './setup', …(2) ] to deeply equal [ './static', './setup', …(3) ]

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:209:16
         }
         cursor += 1;
       }
-    } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
+    } else if (true) {
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:209:16
         }
         cursor += 1;
       }
-    } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
+    } else if (true && tokens[index - 1]?.value !== '.') {
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:210:11
         cursor += 1;
       }
     } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
-      if (tokens[index + 1]?.value !== '(') {
+      if (tokens[index + 1]?.value === '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
       }
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Direct require(...) calls are required

[Survived] StringLiteral
src/scripts/pl-arch-check.mjs:211:90
       }
     } else if (token.value === 'require' && tokens[index - 1]?.value !== '.') {
       if (tokens[index + 1]?.value !== '(') {
-        throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
+        throw Object.assign(new Error('Direct require(...) calls are required'), { rule: "" });
       }
       if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:213:11
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
       }
-      if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
+      if (true) throw unsupported();
       dependencies.push(moduleSpecifier(tokens[index + 2]));
       index += 3;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:213:51
       if (tokens[index + 1]?.value !== '(') {
         throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
       }
-      if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value !== ')') throw unsupported();
+      if (tokens[index + 2]?.type !== 'string' || tokens[index + 3]?.value === ')') throw unsupported();
       dependencies.push(moduleSpecifier(tokens[index + 2]));
       index += 3;
killedBy: fail-closed import scanner extracts all five supported forms across comments, strings, and multiline syntax
statusReason: Dynamic import/require must use a string literal

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:217:37
       dependencies.push(moduleSpecifier(tokens[index + 2]));
       index += 3;
     } else if (token.value === 'require' && tokens[index - 1]?.value === '.' && tokens[index + 1]?.value === '(') {
-      throw Object.assign(new Error('Direct require(...) calls are required'), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
+      throw Object.assign(new Error(""), { rule: 'PL-ARCH-UNSUPPORTED-SYNTAX' });
     }
   }
killedBy: fail-closed import scanner rejects indirect CommonJS loading: module.require('../infra/SqlOrder')
statusReason: expected [Function] to throw error including 'Direct require' but got ''

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:226:33
 function resolveFile(candidate) {
   const choices = [candidate, ...SOURCE_EXTENSIONS.map((extension) => candidate + extension),
     ...SOURCE_EXTENSIONS.map((extension) => join(candidate, `index${extension}`))];
-  return choices.find((path) => existsSync(path) && statSync(path).isFile()) ?? null;
+  return choices.find((path) => existsSync(path) || statSync(path).isFile()) ?? null;
 }
 
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: ENOENT: no such file or directory, stat '/private/var/folders/tm/cs75hqc52qv64h654f_m32xm0000gq/T/pl-arch-vnFKll/src/domain/x'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:233:7
   let candidate;
   let internal = false;
   let alias = false;
-  if (specifier.startsWith('.')) {
+  if (true) {
     candidate = resolve(dirname(sourceFile), specifier);
     internal = true;
killedBy: bounded resolution and deterministic diagnostics resolves configured aliases inside root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/scripts/pl-arch-check.mjs:238:23
     internal = true;
   } else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
-      .find((name) => specifier === name || specifier.startsWith(name));
+      .find((name) => specifier === name && specifier.startsWith(name));
     if (!key) return { external: true };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
killedBy: bounded resolution and deterministic diagnostics reports an unresolved alias distinctly from an unresolved relative import
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:238:23
     internal = true;
   } else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
-      .find((name) => specifier === name || specifier.startsWith(name));
+      .find((name) => false);
     if (!key) return { external: true };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
killedBy: bounded resolution and deterministic diagnostics reports an unresolved alias distinctly from an unresolved relative import
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:239:9
   } else {
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
       .find((name) => specifier === name || specifier.startsWith(name));
-    if (!key) return { external: true };
+    if (false) return { external: true };
     candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
     internal = true;
killedBy: bounded resolution and deterministic diagnostics leaves an unrecognized bare specifier as an external dependency
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] Regex
src/scripts/pl-arch-check.mjs:240:81
     const key = Object.keys(aliases).sort((a, b) => b.length - a.length)
       .find((name) => specifier === name || specifier.startsWith(name));
     if (!key) return { external: true };
-    candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[/\\]/, ''));
+    candidate = resolve(root, aliases[key], specifier.slice(key.length).replace(/^[^/\\]/, ''));
     internal = true;
     alias = true;
killedBy: bounded resolution and deterministic diagnostics resolves configured aliases inside root
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/scripts/pl-arch-check.mjs:244:19
     internal = true;
     alias = true;
   }
-  if (internal && !inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
+  if (internal && inside(root, candidate)) return { error: 'PL-ARCH-PATH-ESCAPE' };
   const file = resolveFile(candidate);
   if (!file) return { error: alias ? 'PL-ARCH-UNRESOLVED-ALIAS' : 'PL-ARCH-UNRESOLVED-IMPORT' };
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ArrayDeclaration
src/scripts/pl-arch-check.mjs:253:19
 }
 
 export function checkArchitecture({ root, manifest = join(root, 'layers.map.json') }) {
-  const invalid = [];
+  const invalid = ["Stryker was here"];
   const violations = [];
   const dependencies = [];
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected undefined to be 'PL-ARCH-MANIFEST-VERSION' // Object.is equality

[Killed] ObjectLiteral
src/scripts/pl-arch-check.mjs:262:12
     config = validateManifest(JSON.parse(readFileSync(manifest, 'utf8')));
   } catch (error) {
     invalid.push(diagnostic(error.rule ?? 'PL-ARCH-INVALID-MANIFEST', projectPath(canonicalRoot, manifest), '', error.message));
-    return { exitCode: 2, diagnostics: invalid, dependencies };
+    return {};
   }
 
killedBy: layer manifest validation rejects invalid manifest input
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:266:7
   }
 
   const files = [...new Set(configuredSourceRoots(canonicalRoot, config.layers).flatMap(walkSources))];
-  if (files.length === 0) {
+  if (false) {
     invalid.push(diagnostic('PL-ARCH-NO-SOURCES', '', '', 'Configured layer roots contain no source files'));
   }
killedBy: source root discovery and file walking does not add a source root for a non-existent wildcard prefix directory
statusReason: expected { exitCode: +0, diagnostics: [], …(1) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(1 matching property omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:267:59
 
   const files = [...new Set(configuredSourceRoots(canonicalRoot, config.layers).flatMap(walkSources))];
   if (files.length === 0) {
-    invalid.push(diagnostic('PL-ARCH-NO-SOURCES', '', '', 'Configured layer roots contain no source files'));
+    invalid.push(diagnostic('PL-ARCH-NO-SOURCES', '', '', ""));
   }
   const ownership = new Map();
killedBy: bounded resolution and deterministic diagnostics fails closed when configured layer roots contain no source files
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(3 matching properties omitted from actual)

[Killed] MethodExpression
src/scripts/pl-arch-check.mjs:272:53
   const ownership = new Map();
   for (const file of files) {
     const rel = projectPath(canonicalRoot, file);
-    const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
+    const matches = config.layers.filter((layer) => layer.globs.every(glob => glob.test(rel)));
     if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
     else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
killedBy: layer manifest validation matches a file when ANY of a layer's multiple globs match, not only when ALL do
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:273:9
   for (const file of files) {
     const rel = projectPath(canonicalRoot, file);
     const matches = config.layers.filter((layer) => layer.globs.some((glob) => glob.test(rel)));
-    if (matches.length === 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
+    if (matches.length !== 0) invalid.push(diagnostic('PL-ARCH-UNMATCHED-LAYER', rel, '', `No layer owns ${rel}`));
     else if (matches.length > 1) invalid.push(diagnostic('PL-ARCH-AMBIGUOUS-LAYER', rel, '', `Multiple layers own ${rel}`));
     else ownership.set(file, matches[0]);
killedBy: layer manifest validation accepts a manifest with no aliases key at all (defaults to empty object)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/scripts/pl-arch-check.mjs:285:45
     let imports;
     try { imports = scanImports(readFileSync(file, 'utf8')); }
     catch (error) {
-      invalid.push(diagnostic(error.rule ?? 'PL-ARCH-UNSUPPORTED-SYNTAX', rel, '', error.message));
+      invalid.push(diagnostic(error.rule ?? "", rel, '', error.message));
       continue;
     }
killedBy: bounded resolution and deterministic diagnostics falls back to a default rule_id when a source-scan error has no .rule (unterminated string)
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: 2, diagnostics: [ …(1) ] }
(5 matching properties omitted from actual)

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:290:30
     }
     for (const specifier of imports) {
       const resolved = resolveImport(canonicalRoot, file, specifier, config.aliases);
-      if (resolved.external) {
-        dependencies.push({ file: rel, specifier, dependency: specifier });
-        if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
-        continue;
-      }
+      if (resolved.external) {}
       if (resolved.error) {
         invalid.push(diagnostic(resolved.error, rel, specifier,
killedBy: bounded resolution and deterministic diagnostics leaves an unrecognized bare specifier as an external dependency
statusReason: The "to" argument must be of type string. Received undefined

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:295:11
         if (!config.external.allow) violations.push(diagnostic('PL-ARCH-EXTERNAL-IMPORT', rel, specifier, `External import ${specifier} is forbidden`));
         continue;
       }
-      if (resolved.error) {
+      if (true) {
         invalid.push(diagnostic(resolved.error, rel, specifier,
           resolved.error === 'PL-ARCH-PATH-ESCAPE' ? 'Resolved path escapes project root' : `Cannot resolve internal import ${specifier}`));
killedBy: layer manifest validation accepts may_import referencing a layer declared later in the array
statusReason: expected { exitCode: 2, …(2) } to match object { exitCode: +0 }
(2 matching properties omitted from actual)

[Killed] ObjectLiteral
src/scripts/pl-arch-check.mjs:318:19
 }
 
 function parseArgs(args) {
-  const options = { root: process.cwd(), manifest: null, format: 'text' };
+  const options = {};
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
killedBy: pl-arch-check CLI entrypoint guard (in-process) defaults --root to the current working directory when --root is omitted
statusReason: expected '' to contain 'PL-ARCH-NO-SOURCES'

[Killed] BlockStatement
src/scripts/pl-arch-check.mjs:319:56
 
 function parseArgs(args) {
   const options = { root: process.cwd(), manifest: null, format: 'text' };
-  for (let index = 0; index < args.length; index += 1) {
-    const key = args[index];
-    if (key === '--root') options.root = resolve(args[++index]);
-    else if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
-    else throw new Error(`Unknown argument: ${key}`);
-  }
+  for (let index = 0; index < args.length; index += 1) {}
   return options;
 }
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected 'PL-ARCH-INVALID-MANIFEST layers.map.j…' to contain 'PL-ARCH-NO-SOURCES'

[Killed] EqualityOperator
src/scripts/pl-arch-check.mjs:321:9
   const options = { root: process.cwd(), manifest: null, format: 'text' };
   for (let index = 0; index < args.length; index += 1) {
     const key = args[index];
-    if (key === '--root') options.root = resolve(args[++index]);
+    if (key !== '--root') options.root = resolve(args[++index]);
     else if (key === '--manifest') options.manifest = resolve(args[++index]);
     else if (key === '--format') options.format = args[++index];
killedBy: pl-arch-check CLI entrypoint guard (in-process) runs the CLI block and writes text diagnostics when argv[1] resolves to this module
statusReason: expected '' to contain 'PL-ARCH-NO-SOURCES'

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:323:14
     const key = args[index];
     if (key === '--root') options.root = resolve(args[++index]);
     else if (key === '--manifest') options.manifest = resolve(args[++index]);
-    else if (key === '--format') options.format = args[++index];
+    else if (false) options.format = args[++index];
     else throw new Error(`Unknown argument: ${key}`);
   }
killedBy: pl-arch-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: Unexpected end of JSON input

[Killed] ConditionalExpression
src/scripts/pl-arch-check.mjs:333:20
   try {
     const options = parseArgs(process.argv.slice(2));
     const result = checkArchitecture({ root: options.root, manifest: options.manifest ?? join(options.root, 'layers.map.json') });
-    const output = options.format === 'json'
+    const output = false
       ? `${JSON.stringify(result.diagnostics, null, 2)}\n`
       : result.diagnostics.map((item) => `${item.rule_id} ${item.file}: ${item.message}`).join('\n') + (result.diagnostics.length ? '\n' : '');
killedBy: pl-arch-check CLI entrypoint guard (in-process) writes JSON diagnostics when --format json is given
statusReason: Unexpected token 'P', "PL-ARCH-NO"... is not valid JSON
